[
  {
    "url": "https://martech.org/why-ai-content-strategies-need-to-focus-on-tasks-not-transactions/",
    "title": "Why AI content strategies need to focus on tasks not transactions",
    "date": "2025-12-10T15:46:19+00:00",
    "content": "AI chat assistants are not being used the way many marketers expect. Instead of acting as shopping tools or search engines, they function primarily as support systems for cognitive tasks — writing, planning, analyzing and learning, according to a report by AI SEO agency Dejan. In 2026, optimizing for AI means understanding how users actually engage with assistants, not just assuming commercial behavior.\nDan Petrovic, director of Dejan, conducted an extensive analysis of 3.9 million conversational turns — covering 613 million words and 4.4 billion characters — to uncover patterns in real-world AI usage. The results challenge many assumptions in AI content strategy.\nPetrovic noted that user contributions typically account for just 16–17% of the session, meaning the assistant generates the bulk of the content.\nPetrovic analyzed 24,259 classified sessions across 42 intent categories. He found that 64.6% of sessions had no commercial intent. Users primarily engaged AI for tasks like:\nEven among the 35.4% of sessions showing commercial intent, the majority were early in the funnel:\nMany marketers and SEOs are optimizing content with a search-first mindset — assuming AI chats mimic keyword-based queries. Petrovic’s findings suggest otherwise. AI assistants are more often used to support multi-step tasks, rather than making immediate purchases.\n“AI chat use is overwhelmingly non-commercial,” Petrovic stated. “Users treat assistants as co-pilots — not sales reps.”\nMarketers should adjust their approach to AI optimization by:\nBottom line: The future of AI content visibility isn’t about gaming intent — it’s about meeting it. Assistants are becoming tools for cognition, not just conversion. If your content helps users learn, plan, write, or evaluate, it’s far more likely to show up in real-world AI usage."
  }
]