[
  {
    "url": "https://www.searchenginejournal.com/how-to-analyze-google-discover/565198/",
    "title": "How To Analyze Google Discover",
    "date": "2026-01-19T14:30:18+00:00",
    "content": "Discover isn’t a completely black box. We have a decent idea of how it works and can reverse engineer more value with some smart analysis.\nYes, there’s always going to be some surprises. It’s a bit mental at times. But we can make the most of the platform without destroying our credibility by publishing articles about vitamin B12 titled:\n“Outlive your children with this one secret trick the government don’t want you to know about.”\nBefore diving in headfirst, let’s check the depth of the pool.\n“Sustained presence on search helps maintain your status as a trustworthy publisher.”\nObviously, loads of people know how to game the system and have become pretty rich by doing so. If you want to laugh and cry in equal measure, see the state of Google’s spam problems here .\nMost algorithms follow the Golden Hour Rule . Not to be confused with the golden shower rule, it means the first 60 minutes after posting determine whether algorithms will amplify or bury your content.\nIf you want to go viral, your best bet is to drive early stage engagement.\nThis is focused more on how you, as an SEO or analyst, can get more value out of the platform. So, let’s take conversions and click/impression data as read. We’re going deeper. This isn’t amateur hour.\nI think you need to track the below and I’ll explain why.\nYou need to already get traffic from Discover to generate value from this analysis. If you don’t, revert back to creating high-quality, unique content in your niche(s) and push it out to the wider world.\nCreate great content and get the right people sharing it.\nWorth noting you can’t accurately identify Discover traffic in analytics platforms. You have to accept some of it will be mis-attributed. Most companies make an educated guess of sorts, using a combination of Google and mobile/android to group it together.\nCTR is one of the foundational metrics of news SEO, Top Stories, Discover, and almost any form of real-time SEO. It is far more prevalent in news than traditional SEO because the algorithm is making decisions about what content should be promoted in almost real time.\nEvergreen results are altered continuously, based on much longer-term engagement.\nThis is weighted alongside some kind of traditional Navboost engagement data – clicks, on-page interactions, session duration, et al. – to associate a clickable headline and image with content that serves the user effectively.\nIt’s also one of the reasons why clickbait has (broadly) started to die a death. Like rampant AI slop , even the mouth breathers will tire of it eventually.\nTo get the most out of CTR, you need to combine it with:\nEntities are more important in news than any other part of SEO . While entity SEO has been growing in popularity for years, news sites have been obsessed with entities (arguably without knowing it), for years.\nWhile it isn’t as easy to just frontload headlines with relevant entities to get traffic anymore, there’s still a real value in analyzing performance at an entity level.\nYou want to know what people, places, and organizations (arguably, these three make up 85%+ of all entities you need to care about) drive value for you and users in Discover.\nTo run proper entity analysis you cannot do this manually. At least not well or at scale.\nMy advice is to use a combination of your LLM of choice, an NER (Named Entity Recognition) tool and either Google’s Knowledge Graph or WikiData .\nYou can then extract the entity from the page in question (the title), disambiguate using the on page content (this helps you assess whether ‘apple’ is the computing company, the fruit or an idiotic celebrities daughter) and confirm it with WikiData or Google’s Knowledge Graph.\nRelatively straightforward, but you want to know which subfolders tend to generate more impressions and clicks on average in Discover. This is particularly valuable if you work on larger sites with a lot of subfolders and high content production.\nYou want to make sure that everything you do maximizes value.\nThis becomes far more valuable when you combine this data with the type of headline and entities. If you begin to understand the type of headline (and content) that works for specific subfolders, you can help commissioners and writers make smarter decisions.\nSubfolders that tend to perform better in Discover give individual articles a better chance of success.\nGenerate a list of all of your subfolders (or topics if your site isn’t setup particularly effectively) and tracking clicks, impressions and CTR over time. I’d use total clicks, impressions and CTR and an average per article as a starting point.\nGoogle tracks authorship in search. No ifs, no buts. The person who writes the content has significance when it comes to E-E-A-T , and good, reliable authorship makes a difference.\nHow much significance, I don’t know. And neither do you.\nIn breaking down all metrics from the leak that mention the word “author,” the below is how Google perceives and values authorship. As always, this is an imperfect science, but it’s interesting to note that of the 35 categories I reviewed, almost half are related just to identifying the author.\nDisambiguation is one of the most important components of modern-day search. Semantic SEO. Knowledge graphs. Structured data. E-E-A-T. A huge amount of this is designed to counter false documents, AI slop, and misinformation.\nSo, it’s really important for search (and Discover) that you provide undeniable clarity.\nFor Discover specifically, you should see authors through the prism of:\nThis is a really good way of viewing the type of content that tends to perform for you. For example, you want to know whether curiosity gap headlines work well for you and whether headlines with numbers have a higher or lower CTR on average.\nThese are all questions and hypotheses that you should be asking. Although you can’t scrape Discover directly (trust me, I’ve tried), you can hypothesize which H1, page title, and OG title is the clickiest.\nWhat’s interesting in this example is that “how-to” headlines are not portrayed as very Discover-friendly. But it’s the concept that sells it. It’s different.\nStart by defining all the types of headlines you use – curiosity gap, localized, numbered lists, questions, how-to or utility type, emotional trigger, first person, et al. – and analyze how effective each one is.\nUse a machine learning model (you can absolutely use ChatGPT’s API) to categorize each headline.\nWorth noting that there are five different headlines you and Google can and should be using to determine how content is perceived. Discover is known to use the OG title more frequently than traditional search.\nIt’s an opportunity to create a “clickier” headline than you would typically use in the H1 or page title.\nImages fall into a similar category as headlines. They’re crucial. You can’t definitively prove which image gets pulled through into Discover. But as long as your featured image is 1200 px wide, it’s safe-ish to assume this is the one that’s used.\nCTR is arguably the single biggest factor in determining early success. Continued success, I believe, is more Navboost-related – more traditional-ish engagement.\nWell, two things in your control. You could be pedantic and say, “ Ooo, your brand is an important factor in CTR, actually. Psychologically, people always click on…”\nAnd I’d tell you to bore off. We’re talking about an individual article. We’ve done a significant amount of image testing and know that in straight news, people like seeing people looking sad. They like real-ness.\nIn money, they like people looking at the camera, looking happy. It makes them feel safe in a financial decision.\nStupid, I know. But we’re not an intelligent race. Sure, there are a few outliers. Galileo. Einstein. Noel Edmonds. But the rest of us are just trying not to throw stuff at each other outside Yates’s on a Friday night.\nIt is actually why clickbait headlines have worked for years. It works until it doesn’t.\nYou’ll need to upload a set of images to help train the model, and please don’t take it as gospel. Check the outputs. For the basics – whether people are present, where they’re looking, color schemes, etc. – great. For more nuanced decisions like trustworthiness or emotional meaning, you’ll need to do that yourself.\nWorth noting that lots of publishers trial badges and logos on images. And for good reason. Images with logos consistently click higher for larger brands (to the best of my knowledge), and if you’re a paywalled site, but have set live blogs to free, it’s worth telling people.\nThen you can use machine learning to bucket photos into groups to help determine CTR. For example, people directly looking at a camera + smiling could be one bucket. Not looking at a camera + scowling.\nLarge newsrooms run analysis on publishing volumes, times, and content freshness fairly consistently and at a desk-level. If you only have 50 or fewer articles per month making it into Discover, you probably don’t need to do this.\nBut if we’re talking about hundreds or thousands of articles, these insights can be really useful to commissioners.\nYour output should give really clear guidance to desks, commissioners, and publishers around when is best to publish for peak Discover performance.\nWe never make direct recommendations solely for Discover for a number of reasons. Discover is a highly volatile platform and one that does reward nonsense. It can lead you down the garden path with all sorts of thin, curiousity gap style content if you just follow the numbers.\nAnd it has limited direct impact on your bottom line.\nYou need a clear set of goals. Goals that help you deliver analysis that directly impacts the value of your content in Discover. When you set your analysis, focus on elements you have more control over.\nFor example, you might not be able to control what commissioners choose to publish, but you can change the headline (H1, title, and/or OG) and image prior to publish.\nUnderstanding whether your role is more strategic or tactical is crucial. Strategic roles are more advisory in nature. You can offer some thoughts and advice on the type of headlines and entities to avoid or choose, but you may not be able to change them.\nTactical roles mean you have more say in the implementation of change. Headlines, publish times, entity targeting, etc.\nThis post was originally published on Leadership in SEO ."
  }
]