[
  {
    "url": "https://blog.hubspot.com/marketing/how-the-doux-uses-ai-to-engage-community",
    "title": "How The Doux uses AI to engage community",
    "date": "2025-12-05T09:30:04+00:00",
    "content": "“I think we're moving into a space where most beauty companies are tech companies,” says Maya Smith.\nIt’s a striking claim from a brand that launched in 2012, long before AI was everywhere. But The Doux has always been ahead of the curve. Since day one, the haircare brand has been anchored in culture: hip-hop references, retro- and Afrofuturism, Black hair-salon nostalgia, all in service of marketing hair products to Black women.\nFor all AI can do, Smith, who’s The Doux's co-founder, CEO, and creative director, is well aware that system biases are still rampant; the tech is accelerating faster than access and representation. “What I understood is that in order for that to change, you really have to start to train AI ,” Smith tells me. “I wanted to be a part of [it].”\nCollaborating with Black Girls Code (BGC), The Doux launched the Black Beauty AI Challenge back in June, calling on budding creators to submit their original AI-generated videos.\nOther than the requirement to use only free tools like Canva, Capcut, or Pika — “because a lot of the obstacles are to do with access” — participants were given intentionally broad parameters to showcase how they define Black beauty, for a chance to earn cash prizes and additional visibility opportunities. Winners will be announced later this month.\n“I understand that there‘s some apprehension, because a lot of people don’t understand it,” says Smith, hopeful that this challenge provides some awareness. “But it‘s important for Black creators to be able to participate in the AI conversation, because it’s not going anywhere.”\nKey takeaway: Leading with education and access is a powerful form of thought leadership and a solid way to build trust and authority.\nPrior to the BGC partnership, Smith had already been experimenting with AI to help bring her campaign and product launches to life.\nTo help execute the vision for The Doux’s Press Play Collection, which launched last year, she used Midjourney AI to organize the endless thoughts in her head and generate usable renderings that guided her production team. “We didn't want to spend a lot of time and money on revisions,” says Smith.\nSmith is inspired by everything from the Black Barbie evolution to pin-up culture to Palm Springs aesthetics. “When people are communicating with any of these platforms, even if you‘re good at it, you’re still going to have to be very specific,” says Smith.\n“You have to learn [in this case] art history so that you know what to say. You have to learn about camera angles, wide shots. You still have to educate yourself on what you're telling AI to do.”\nThe latest launch was no different. Products across The Doux’s Block Party Collection were formulated to stand up to humidity. The biggest challenge, notes Smith, was telling this story without leaning into the typical, often culturally unsound campaign showcasing the frizz-to-sleek arc, implying that the hair wasn’t beautiful to begin with.\nWith the help of AI, a bubble visual became the metaphor for an anti-humidity barrier.\n“Beauty brands need to lean into the people they’re serving,” says Smith. “Everything we do is informed by our community. AI is just another way to engage them.”\nKey takeaway: Use AI to clarify — not replace — your creative vision. Humans still set the tone; AI helps execute it faster.\nIn that spirit, the “Block Party” concept was customer-led. New York remains its biggest community and what Smith kept hearing about the city stuck with her: that it was changing, that neighborhoods were looking different than what people grew up with.\nSo Block Party became an homage to the famous New York block parties that raised so many of The Doux’s customers.\nFor its NYC debut party, The Doux team invited 60 beauty journalists, influencers, and distributors for dinner and dancing, and hired DJ Ty Alexander to lead the set comprising crowd pleasers like Boosie’s “Wipe Me Down,” Lauryn Hill’s “Doo Wop (That Thing),” and FLY’s “Swag Surfin.”\n“I think our love language to our community is showing them the way that we see them and ensuring that they see themselves,” says Smith.\nKey takeaway: AI is inevitable, but in-person experiences remain irreplaceable drivers of community."
  },
  {
    "url": "https://www.searchenginejournal.com/cloudflare-outage-returns-triggering-fresh-wave-of-5xx-errors/562602/",
    "title": "Cloudflare Outage Returns, Triggering Fresh Wave Of 5xx Errors via @sejournal, @theshelleywalsh",
    "date": "2025-12-05T09:23:30+00:00",
    "content": "Cloudflare is experiencing another major service disruption, causing widespread 5xx errors and connectivity issues for websites and services globally.\nBreaking news: Cloudflare is experiencing another major service disruption, causing widespread 5xx errors and connectivity issues for websites and services globally. This follows closely after a significant outage earlier this month .\nUsers attempting to access sites using Cloudflare as a reverse proxy or CDN are encountering 5xx errors.\nThe official status page at Cloudflarestatus.com is tracking the real-time system performance and the ongoing incident.\nRelated : How 500 Error Codes Can Impact Google Indexing\nCloudflare is currently investigating an issue affecting Workers scripts and the Workers KV namespace.\nAccording to Cloudflare’s status page, a fix has now been applied and the company is monitoring the situation."
  }
]