[
  {
    "url": "https://blog.hubspot.com/marketing/the-gentlemens-agreement",
    "title": "The gentlemen’s agreement that netted 210,000 subscribers. [Steal this play.]",
    "date": "2026-01-21T22:03:24+00:00",
    "content": "“SMASH that like button,” the host says, and your eyes roll back so far you can see your own medulla. “And don’t forget to subscribe!”\nIf you make videos, podcasts, or social media posts, you know you should be encouraging engagement. But if doing so makes you feel like you need a shower, this story is for you.\nToday, the producer of My First Million shares how they turned boring engagement farming into shared language that their audience willingly (and joyfully) spreads — netting 200k subscribers in the process.\nThe team calls it “The Gentlemen’s Agreement.” And you should absolutely try something similar.\nEntrepreneurs Sam Parr and Shaan Puri didn’t set out to be podcasters or YouTubers.\n“They were operating in the mindset of ‘We’re creating this for us, and if people watch it, great,’” says Arie Desormeaux. “They weren’t identifying as content creators.”\nSo when the show started to organically pick up followers, they had to decide whether to do all the things that content creators are “supposed” to do: Ad breaks. Engagement farming. Begging for subscribers.\nDesormeaux is a senior producer for HubSpot Media and one of the minds behind the ongoing success of My First Million , which currently boasts almost 900,000 followers.\nBut it didn’t start that way, and she shares with me the thinking behind one of their early moments of explosive growth.\n“Instead of doing something we should be doing, just by default, we decided to make it a funny exchange, and then turn that into a bit that’s also a value add. We’re going to turn it into something that becomes part of the language of the audience. ”\nSo, instead of the typical ‘like and subscribe,’ Parr and Puri came up with the Gentlemen’s Agreement. Here it is in Parr’s words :\n“If this is the first episode you’re listening to, you get this one for free. But if it’s the second episode or more that you’ve listened to, here’s our Gentlemen’s agreement. You go to whatever app you’re on, and you click ‘subscribe’ or ‘follow’ or whatever it is.\n“We make this for you. We’re your little laboratory rats. We’re doing all this crap for you, just go and do that for us.”\nThe effect was nearly immediate, with the show picking up 210,000 subscribers within a matter of months.\nAnd while it’s nearly impossible to say this was the sole reason in isolation, Parr himself described the Gentlemen’s Agreement as “the biggest needle mover.”\nIt wasn’t simply that listeners were honoring the agreement. They were sharing it.\n“You’ll see it in the YouTube comments. You’ll see it on LinkedIn,” Desormeaux says. “It becomes almost inside baseball for people who know. It’s become a proper noun. And that creates an inclusion factor.”\nThat inclusion factor is what she attributes the success of the tactic to. The very words “Gentlemen’s Agreement” have become a way for listeners to identify with each other. It has transcended engagement farming to become community building.\n“ ‘Like and subscribe’ is such an anonymous way of communicating to people. It’s transactional. I’m talking to you like you’re only what’s on the other side of a button. It’s a signal for the brain to check out, ” she explains. “[Whereas,] the Gentlemen’s Agreement is a relationship-building tactic. It’s a goodwill agreement between us and the audience.”\nNow, you shouldn’t copy this tactic word-for-word. Not only would that be ungentlemanly, but it would also be ineffective. Your unique audience needs your unique language.\nBut Desormeaux shared some thoughts on how to find the lingua franca for your listeners.\n“Everyone who is creating content on the internet is doing the same value exchange with their audience. Whether it’s entertainment, tutorials, interviews, it’s all the same.” You’re exchanging your content for their attention.\nBut when you simply ask for likes, you’re presenting it as a one-sided equation. Instead, remind your potential audience that the exchange goes both ways.\nParr and Puri make no secret of the amount of effort they’re offering in return.\nBy now, you can probably spot engagement farming just by the change in tone, without even listening to the words. So many content creators treat these moments as a chore, so that’s what listening feels like.\n“It becomes part of the noise of the internet. It’s the same as, ‘Hey, let’s take a quick ad break.’ They’ve heard it so many times, it’s lost its potency.”\nInstead, find the wording that matches the soul of your content.\n“What is the tone that your audience responds to? My First Million is entertainment first, nerds second, and business third.”\nThat’s why the Gentlemen’s Agreement is presented as a funny, kinda-nerdy business proposition. It probably wouldn’t work for, say, a podcast about knitting grannies.\n“If we had done it one time, it would have just been a novelty. Doing it consistently is what creates a movement. Bringing it back from episode to episode is what lodges it in the brain.”\nAnd they don’t just mention it in each episode. They also use it in their social media posts, create tongue-in-cheek shareable content , and even slap it on their merch .\nThe result? “The audience recognizes it and uses it in situ.”\nDuring one episode, Parr mused that the Gentlemen’s Agreement may have lost its novelty, but Desormeaux isn’t worried.\n“ It’s novel for whoever is hearing it for the first time, for people who haven’t subscribed yet. ”\nIn other words, if you’ve heard it enough to tune it out, you’re probably already a subscriber. (Or you’re breaking the agreement. Tsk, tsk.)\n“There’s value in the subversive. It IS cringe and unlikeable to ask for subscribers,” Desormeaux admits. “But somehow, making fun of the economics of being a content creator helps to claw away the objections of the audience.”\nIf you acknowledge that it’s cringey, they can’t call you cringey. Part of the success of the Gentlemen’s Agreement is that it disarms the transactional nature by acknowledging the transactional nature.\nAnd, hey, if you’ve made it this far… do a gentleman a favor? Go click on that subscribe button."
  }
]