[
  {
    "url": "https://www.searchenginejournal.com/googles-mueller-says-sites-in-a-bad-state-may-need-to-start-over/562109/",
    "title": "Google’s Mueller Says Sites In A ‘Bad State’ May Need To Start Over via @sejournal, @MattGSouthern",
    "date": "2025-11-28T17:15:35+00:00",
    "content": "Google's John Mueller says sites with low-quality AI content should rethink their purpose rather than manually rewrite pages. Starting fresh may be faster than recovering.\nGoogle Search Advocate John Mueller says sites in a bad state after publishing low-quality AI content may not fix the problem by rewriting pages with human authors.\nThe guidance came in response to a Reddit question about whether a site showing “Crawled – currently not indexed” could recover if the owner replaced AI-generated English content with original Portuguese content written by humans.\nMueller reframed the question when responding. He says the issue isn’t AI versus human authorship. It’s whether the site adds value to the web.\n“I wouldn’t think about it as AI or not, but about the value that the site adds to the web. Just rewriting AI content by a human won’t change that, it won’t make it authentic.”\nHe advised treating a full content overhaul as a fresh start rather than an editing project:\n“If you want to change all your sites content, I’d approach it as essentially starting over with no content, and consider what it is that you want to do on the site, not as a checklist of pages that you need to tweak manually.”\nMueller also offered a direct comparison on recovery timelines. Sites starting from a “bad state” face a harder path than those launching on new domains:\n“Starting with a bad state will be harder than starting with a new domain (and perhaps take longer, maybe much longer), but sometimes that’s still worthwhile.”\nMueller’s guidance suggests there’s more to domain recovery than rewriting content. It’s also about articulating a clear purpose for the site that justifies its existence.\nThis framing is consistent with Google’s broader guidance on helpful content : demonstrate expertise, provide original value, and address a clear audience need.\nDomains with a history that puts them in a “bad state” may require longer recovery periods. In some cases, a fresh start could deliver results faster.\nWhen facing indexing issues after publishing low-value content, think about whether the domain’s history justifies the extended recovery timeline."
  }
]