[
  {
    "url": "https://www.searchenginejournal.com/when-platforms-say-dont-optimize-smart-teams-run-experiments/565256/",
    "title": "When Platforms Say ‘Don’t Optimize,’ Smart Teams Run Experiments via @sejournal, @DuaneForrester",
    "date": "2026-01-22T14:30:08+00:00",
    "content": "A quick note up front, so we start on the right foot.\nThe research I’m about to reference is not mine. I did not run these experiments. I’m not affiliated with the authors. I’m not here to “endorse” a camp, pick a side, or crown a winner. What I am going to endorse, loudly and without apology, is measurement. Replication. Real-world experiments. The kind of work that teaches us in real time, in real life, what changes when an LLM sits between customers and content. We need more tested data, and this is one of those starting points.\nIf you do nothing else with this article, do this: Read the paper, then run your own test. Whether your results agree or disagree, publish them. We need more receipts and fewer hot takes.\nOver the last year, the industry has been pushed toward a neat, comforting story: GEO is just SEO. Nothing new to learn. No need to change how you work. Just keep doing the fundamentals, and everything will be fine.\nNot because SEO fundamentals stopped mattering. They still matter, and they remain necessary. But because “necessary” is not the same as “sufficient,” and because the incentives behind platform messaging do not always align with the operational realities businesses are walking into and dealing with.\nIf you’ve paid attention to public guidance coming from the leading search platforms lately, you’ve probably heard a version of: Don’t focus on chunking. Don’t create “bite-sized chunks.” Don’t optimize for how the machine works. Focus on good content.\nThat’s been echoed and amplified across industry coverage, though I want to be precise about my position here. I’m not claiming a conspiracy, and I’m not saying anyone is being intentionally misleading. I’m not doing that.\nI am saying something much simpler. It’s my opinion and happens to be based on actual experience – when messaging repeats across multiple spokespeople in a tight window, it signals an internal alignment effort.\nThat’s not an insult nor is it a moral judgment. That’s how large organizations operate when they want the market to hear one clear message. I was part of exactly that type of environment for well over a decade in my career.\nAnd the message itself, on its face, is not wrong. You can absolutely hurt yourself by over-optimizing for the wrong proxy. You can absolutely create brittle content by trying to game a system you do not fully understand. In many cases, “write clearly for humans” is solid baseline guidance.\nThe problem is what happens when that baseline guidance becomes a blanket dismissal of how the machine layer works today, even if it’s unintentional. Because we are not in a “10 blue links” world anymore.\nWe are in a world where answer surfaces are expanding, search journeys are compressing, and the unit of competition is shifting from “the page” to “the selected portion of the page,” assembled into an answer the user never clicks past.\nAnd that is where “GEO is just SEO” starts to break in my mind.\nExecutives love comforting statements: “ Google still dominates search. Traditional SEO still drives the most traffic. Therefore this LLM-stuff is overblown. ”\nThe first half is true , but the conclusion is where companies get hurt.\nThe biggest risk here is asking the wrong question. “ Where does traffic come from today? ” is a dashboard question, and it’s backward-looking. It tells you what has been true.\nIf you want the behavior trendline in plain terms, start here, with the 2024 SparkToro study , then take a look at what Danny Goodwin wrote in 2024 , and as a follow-up in 2025 (spoiler – zero click instances increased Y-o-Y). And while some sources are a couple of years old, you can easily find newer data showing the trend growing.\nI’m not using these sources to claim “the sky is falling.” I’m using them to reinforce a simple operational reality: If the click declines, “ranking” is no longer the end goal. Being selected into the answer becomes the end goal.\nThat requires additional thinking beyond classic SEO. Not instead of it. On top of it.\nIf you want to understand why the public messaging is conservative, you have to look at the platform’s strategic direction.\nGoogle, for example, has been expanding AI answer surfaces, and it’s not subtle. Both AI Overviews and AI Mode saw announcements of large expansions during 2025.\nAgain, notice what this implies at the operating level. When AI Overviews and AI Mode expand, you’re not just dealing with “ranking signals.” You’re dealing with an experience layer that can answer, summarize, recommend, and route a user without a click.\nThen comes the part everyone pretends not to see until it’s unavoidable: Monetization follows attention.\nThis is no longer hypothetical. Search Engine Journal covered Google’s official rollout of ads in AI Overviews , which matters because it signals this answer layer is being treated as a durable interface surface, not a temporary experiment.\nGoogle’s own Ads documentation reinforces the same point: This isn’t just “something people noticed,” it’s a supported placement pattern with real operational guidance behind it. And Google noted mid-last-year that AI Overviews monetize at a similar rate to traditional search, which is a quiet signal that this isn’t a side feature.\nYou do not need to be cynical to read this clearly. If the answer surface becomes the primary surface, the ad surface will evolve there too. That’s not a scandal so much as just the reality of where the model is evolving to.\nNow connect the dots back to “don’t focus on chunking”-style guidance.\nA platform that is actively expanding answer surfaces has multiple legitimate reasons to discourage the market from “engineering for the answer layer,” including quality control, spam prevention, and ecosystem stability.\nBusinesses, however, do not have the luxury of optimizing for ecosystem stability. Businesses must optimize for business outcomes. Their own outcomes.\nThis isn’t about blaming anyone. It’s about understanding misaligned objectives, so you don’t make decisions that feel safe but cost you later.\nI’m on record that traditional search is still an important driver, and that optimizing in this new world is additive, not an overnight replacement story. But “additive” still changes the workflow.\nAI assistants are becoming measurable referrers. Not dominant, not decisive on their own, but meaningful enough to track as an early indicator. Two examples that capture this trend.\nTechCrunch noted that while it’s not enough to offset the loss of traffic from search declines, news sites are seeing growth in ChatGPT referrals. And Digiday has data showing traffic from ChatGPT doubled from 2024 to 2025.\nBecause this is how platform shifts look in the early stages. They start small, then they become normal, then they become default. If you wait for the “big numbers,” you’re late building competence and in taking action. (Remember “directories”? Yeah, Search ate their lunch.)\nAnd competence, in this new environment, is not “ how do I rank a page .” It’s “ how do I get selected, cited, and trusted when the interface is an LLM. ”\nThis is where the “GEO is just SEO” framing stops being a helpful simplification and starts becoming operationally dangerous.\nLet’s talk about the research. The paper I’m referencing here is publicly available , and I’m going to summarize it in plain English, because most practitioners do not have time to parse academic structure during the week.\nAt a high level, the (“E-GEO: A Testbed for Generative Engine Optimization in E-Commerce”) paper tests whether common human-written rewrite heuristics actually improve performance in an LLM-mediated product selection environment, then compares that to a more systematic optimization approach. It uses ecommerce as the proving ground, which is smart for one reason: Outcomes can be measured in ways that map to money. Product rank and selection are economically meaningful.\nThis is important because the GEO conversation often gets stuck in “vibes.” In contrast, this work is trying to quantify outcomes.\nA lot of common “rewrite advice” does not help in this environment. Some of it can be neutral. Some of it can be negative. But when they apply a meta-optimization process, prompts improve consistently, and the optimized patterns converge on repeatable features.\nThat convergence is the part that should make every practitioner sit up. Because convergence suggests there are stable signals the system responds to. Not mystical. Not magical. Not purely random.\nAnd this is where I come back to my earlier point: If GEO were truly “just SEO,” then you would expect classic human rewrite heuristics to translate cleanly. You would expect the winning playbook to be familiar.\nThis paper suggests the reality is messier. Not because SEO stopped mattering, but because the unit of success changed.\nI want to be careful here, as I’m not telling you to treat this paper like doctrine. You should not accept it on face value and suddenly adopt this as gospel. You should treat it as a public experiment that deserves replication.\nNow, the most valuable output isn’t the exact numbers in their environment, but rather, it’s the shape of the solution the optimizer keeps converging on. (The name of their system/process is optimizer .)\nThe optimized patterns repeatedly emphasize clarity, explicitness, and decision-support structure. They reduce ambiguity. They surface constraints. They define what the product is and is not. They make comparisons easier. They encode “selection-ready” information in a form that is easier for retrieval and ranking layers to use.\nThat is a different goal than classic marketing copy, which often leans on narrative, brand feel, and emotional persuasion.\nThose things still have a place. But if you want to be selected by an LLM acting as an intermediary, the content needs to do a second job: become machine-usable decision support.\nThat’s not “anti-human.” It’s pro-clarity, and it’s the kind of detail that will come to define what “good content” means in the future, I think.\nWhat follows is not me inventing a process out of thin air. This is me reverse-engineering what their optimization process converged toward, and turning it into a repeatable template you can apply to product descriptions and other decision-heavy content.\nTreat it as a starting point, then test it. Revise it, create your own version, whatever.\nStep 1: State the product’s purpose in one sentence, with explicit context. Not “premium quality.” Not “best in class.” Purpose.\nExample pattern: This is a [product] designed for [specific use case] in [specific constraints], for people who need [core outcome].\nStep 2: Declare the selection criteria you satisfy, plainly. This is where you stop writing like a brochure and start writing like a spec sheet with a human voice.\nInclude what the buyer cares about most in that category. If the category is knives, it’s steel type, edge retention, maintenance, balance, handle material. If it’s software, it’s integration, security posture, learning curve, time-to-value.\nStep 3: Surface constraints and qualifiers early, not buried. Most marketing copy hides the “buts” until the end. Machines do not reward that ambiguity.\nExamples of qualifiers that matter: Not ideal for [X]. Works best when [Y]. Requires [Z]. Compatible with [A], not [B]. This matters if you [C].\nStep 4: State what it is, and what it is not. This is one of the simplest ways to reduce ambiguity for both the user and the model.\nPattern: This is for [audience]. It is not for [audience]. This is optimized for [scenario]. It is not intended for [scenario].\nStep 5: Convert benefits into testable claims. Instead of “durable,” say what durable means in practice. Instead of “fast,” define what “fast” looks like in a workflow.\nDo not fabricate. Do not inflate. This is not about hype. It’s about clarity.\nStep 6: Provide structured comparison hooks. LLMs often behave like comparison engines because users ask comparative questions.\nGive the model clean hooks: Compared to [common alternative], this offers [difference] because [reason]. If you’re choosing between [A] and [B], pick this when [condition].\nStep 7: Add evidence anchors that improve trust. This can be certifications, materials, warranty terms, return policies, documented specs, and other verifiable signals.\nThis is not about adding fluff. It’s about making your claims attributable and your product legible.\nStep 8: Close with a decision shortcut. Make the “if you are X, do Y” moment explicit.\nPattern: Choose this if you need [top 2–3 criteria]. If your priority is [other criteria], consider [alternative type].\nNotice what it does. It turns a product description into structured decision support, which is not how most product copy is written today. And it is an example of why “GEO is just SEO” fails as a blanket statement.\nSEO fundamentals help you get crawled, indexed, and discovered. This helps you get selected when discovery is mediated by an LLM.\nSaying GEO = SEO and SEO = GEO is an oversimplification that will become normalized and lead to people missing the fact that the details matter. The differences, even small ones, matter. And they can have impacts and repercussions.\n*A much deeper-dive pdf version of this process is available for my Substack subscribers for free via my resources page .\nHere’s the part I want to be explicit about. This paper is interesting because it’s measurable, and because it suggests the system responds to repeatable features.\nBut you should treat it as a starting point, not a law of physics. Results like this are sensitive to context: industry, brand authority, page type, and even the model and retrieval stack sitting between the user and your content.\nThat’s why replication matters. The only way we learn what holds, what breaks, and what variables actually matter is by running controlled tests in our own environments and publishing what we find. If you work in SEO, content, product marketing, or growth, here is the invitation.\nThen run a controlled test on a small, meaningful slice of your site.\nAnd if you can, track whether these pages are being surfaced, cited, paraphrased, or selected in the AI answer interfaces your customers are increasingly using.\nYou are not trying to win a science fair. You are trying to reduce uncertainty with a controlled test. If your results disagree with the paper, that’s not failure. That’s signal.\nPublish what you find, even if it’s messy. Even if it’s partial. Even if the conclusion is “it depends.” Because that is exactly how a new discipline becomes real. Not through repeating platform talking points. Not through tribal arguments. Through measurement.\nPlatform guidance is one input, not your operating system. Your operating system is your measurement program. SEO is still necessary. If you can’t get crawled, you can’t get chosen.\nBut GEO, meaning optimizing for selection inside LLM-mediated discovery, is an additional competence layer. Not a replacement. A layer. If you decide to ignore that layer because a platform said “don’t optimize,” you’re outsourcing your business risk to someone else’s incentive structure.\nAnd that’s not a strategy. The strategy is simple: learn the layer by testing the layer.\nThis post was originally published on Duane Forrester Decodes ."
  },
  {
    "url": "https://www.searchenginejournal.com/five-things-to-do-that-will-increase-authoritativeness-and-earn-links/565639/",
    "title": "Five Things To Do That Will Increase Authoritativeness And Earn Links via @sejournal, @martinibuster",
    "date": "2026-01-22T14:14:08+00:00",
    "content": "The following are five things that anyone can do to establish authoritativeness and trustworthiness that can be communicated quickly and contribute to earning more links. The trick to this technique is that you have to put some time into these tactics first but the rewards after you are done are links, lots of them.\nThe idea behind this tactic is to convince a web publisher to give you a free link, or to give you the opportunity to publish an article (with or without a customary byline and link).\nIn order to cut through the noise of all the other emails the web publisher receives, it is necessary to establish your authority in order to inspire trust. And you need to do it quickly. These are some touchstones I crafted, through trial and error, in order to accomplish a higher success level in link building campaigns.\nI call this method, Establishing your Bona Fides. It works by creating trust with one to two sentences. Whether at the beginning, middle or end of the outreach is up to you, but I’ve enjoyed a good response rate by placing it near the beginning.\nAs you can see this isn’t really something you can fake your way through. But if you take the time to first establish your bona fides (what makes your legitimate and authoritative), you will see a higher percentage of positive response rates. People will take your emails more seriously.\nThere is no need to be annoying and badger people over and over the way some marketing agencies do. The success rate improvement from this method will cut the need for such aggressive pestering, something that I have never approved of.\nThe first two bona fides are self explanatory. But I will explain them quickly.\nAwards It’s always useful to obtain recognition in whatever field that you are in (if that’s a thing). Even if it’s recognition for volunteering for an organization and doing charitable work.  Other kinds of awards are the kind that local news might give out, like best whatever in whatever town your company is based out of.\nMedia Appearances And Mentions Appearing in television news, being cited in respected news or online magazines are ways to establish signals of authoritativeness. Signals of authoritativeness aren’t just ranking signals, they are also the kinds of things that  humans respond to.\nOrganizations And Associations The third bona fide relates to associations and organizations that your company is allied or partnered with, and any publications that are related to those organizations, both online and offline. Some organizations are always on the lookout for people to profile or publish articles by for their association publications. This kind of publishing is a great way to establish authoritativeness and trustworthiness. It’s truly earning recognition for your expertise.\nPublishing articles in offline publications are a bonanza. While you likely won’t get a link, you will also be the rare online organization submitting a guest post in those publications. Most companies and marketing agencies aren’t doing this because there is no link associated with it. This this will be your advantage because as you’ll see, it will help to increase your link building success rate. When you publish an article in an authoritative space, even if it’s offline, it gives you the ability to rightfully say in your outreach email that you’ve been published in so and so magazine or newsletter. Associating your brand with the authoritative brand in this way instantly makes your brand authoritative to the person you’re communicating with. This is especially powerful if the person you’re communicating with is also a member of whatever association or organization that you have published an article with.\nThe reason this approach works is that it enables you to establish yourself as authoritative with a single sentence. With only a few words in your outreach email, you can quickly profile your site as not a spammer, and a legit organization that’s ultimately worthy of getting a link. In my experience this has worked exceedingly well for consistently earning instant trust from whoever you’re outreaching to.\nYou can get to number four  (list of peers that have published your work) without doing number three (list of organizations that have published your work). But you’ll have greater success if you put a good amount of number three projects behind you. Even if you don’t use all the projects in your initial outreach email, you may have to deploy them in follow up emails to doubting recipients who need more convincing. And you get add all of these to your About Us page.\nAuthority Of Website Authors Point number five (authority of your website’s authors) is more or less self-explanatory. It helps if the person authoring your articles is someone who the outreach recipient can identify with, can think of as “one of us” when you list their credentials. For example, I once did an outreach in the educational space citing the writing talents of a math teacher who was also an education technology blogger. This person’s credentials and authority opened doors for my link building outreach and helped my client receive links from some truly prestigious education related websites.\nObviously, the success of this approach requires do some work ahead of time to get appearances in blogs, podcasts, video interviews, publishing in association and organization online and offline publications. Even taking a photo with someone who is well known and authoritative and putting that on your About Us page can be helpful. People who are considering giving you a link will go to your website’s About Us page to verify who this company is and if they’re as above board and authoritative as you say.\nUsing the above pre-campaign tactics will improve your trustworthiness and authoritativeness and have a positive impact on link building success rates."
  }
]