[
  {
    "url": "https://www.searchenginejournal.com/survey-publishers-expect-search-traffic-to-fall-over-40/565040/",
    "title": "Survey: Publishers Expect Search Traffic To Fall Over 40% via @sejournal, @MattGSouthern",
    "date": "2026-01-15T15:07:03+00:00",
    "content": "The Reuters Institute for the Study of Journalism has published its annual predictions report based on a survey of 280 senior media leaders across 51 countries and territories.\nThe report suggests publishers are preparing for two potential threats: generative AI tools, and creators who attract audiences with personality-led formats.\nNote that the Reuters Institute survey reflects a strategic group of senior leaders. It’s not a representative sample of the entire industry.\nSurvey respondents expect search engine traffic to decline by more than 40% over the next three years as AI-driven answers expand.\nThe report cites Chartbeat data showing aggregate Google Search traffic to hundreds of news sites has already started to dip. Lifestyle-focused publishers say they’ve been hit especially hard by Google’s AI Overviews rollout.\nThat comes on top of longer-running platform declines. The report notes referral traffic to news sites from Facebook fell 43% over the last three years, while referrals from X fell 46% over the same period.\nIn response to traffic pressure and AI summarization, publishers say they’ll invest more in original investigations, on-the-ground reporting, contextual analysis, and human stories.\nLeaders surveyed say they plan to scale back service journalism and evergreen content, which many expect AI chatbots to commoditize.\nPublishers expect to invest more in video, including “watch tabs,” and more in audio formats such as podcasts. Text output is less of a priority.\nOn distribution, YouTube is the main off-platform channel cited in the report, alongside TikTok and Instagram.\nPublishers are also trying to work out how to navigate distribution through AI platforms such as OpenAI’s ChatGPT, Google’s Gemini, and Perplexity.\nFor commercial publishers, paid content like subscriptions and memberships are the top focus. There’s also renewed interest in native advertising and face-to-face events as publishers look for revenue beyond traditional display ads.\nPublishers are also looking at licensing and other platform payments. The report notes interest in platform funding has nearly doubled over the last two years as AI companies began offering large deals.\nI’ve watched publishers cycle through traffic crises before. When Facebook’s algorithm changes hit in 2018, the industry scrambled, and eventually most publishers adjusted by leaning harder into search. Search was supposed to be the stable channel.\nThat assumption is what this report challenges. A projected decline of 40%+ over three years has become a planning number, affecting budgets, headcount, and content strategy.\nThe content mix change warrants attention. When 280 senior media leaders say they’re scaling back service journalism and evergreen content, it signals which pages they think will still drive traffic in an AI-summarized environment. Original reporting and analysis survive because chatbots can’t replicate them. Commodity information doesn’t, because it can be synthesized without a click.\nThe doubling of interest in licensing deals over two years is the other number that jumped out to me. When AI companies started writing checks, the conversation changed from “should we license” to “what’s our leverage.”\nThis report is useful as a benchmark for where the industry’s head is at, even if individual outcomes vary.\nTraffic from search and AI aggregators is unlikely to disappear, but the terms of trade are still being negotiated.\nThat includes how citations work, what licensing looks like at scale, and whether revenue-sharing becomes a standard arrangement."
  },
  {
    "url": "https://www.searchenginejournal.com/seo-is-no-longer-a-single-discipline/564776/",
    "title": "SEO Is No Longer A Single Discipline via @sejournal, @DuaneForrester",
    "date": "2026-01-15T14:30:58+00:00",
    "content": "Most people have a favorite coffee mug. You reach for it without thinking. It fits your hand. It does its job. For a long time, SEO felt like that mug. A defined craft, a repeatable routine, a discipline you could explain in a sentence. Crawl the site. Optimize the pages. Earn visibility. Somewhere along the way, that single mug turned into a cabinet full of cups. Each one different. Each one required – none of them optional anymore.\nThat shift did not happen because SEO got bloated or unfocused. It happened because discovery changed shape.\nSEO did not become complex on its own. The environment around it fractured, multiplied, and layered itself. SEO stretched to meet it.\nDespite everything that has changed, SEO still has a core. It is smaller than many people remember, but it is still essential.\nThis core is about access, clarity, and measurement. Search engines must be able to crawl content, understand it, and present it in a usable way. Google’s own SEO Starter Guide still frames these fundamentals clearly.\nCrawl and indexing remain foundational. If content cannot be accessed or stored, nothing else matters. Robots.txt governance follows a formal standard, RFC 9309 , which defines how crawlers interpret exclusion rules. This matters because robots.txt is guidance, not enforcement. Misuse can create accidental invisibility.\nPage experience is no longer optional. Core Web Vitals represent measurable user experience signals that Google incorporates into Search. The broader framework and measurement approach are documented on Web.dev .\nContent architecture still matters. Pages must map cleanly to intent. Headings must signal structure. Internal links must express relationships. Structured data still plays a role in helping machines interpret content and enable eligible rich results today.\nMeasurement and diagnostics remain part of the job. Search Console, analytics, and validation tools still anchor decision-making for traditional search.\nThat is the SEO core. It is real work, and it is not shrinking. It is, however, no longer sufficient on its own.\nThis first ring out from the core is where SEO stops being a single lane.\nOnce the core is in place, modern SEO immediately runs into systems it does not fully control. This is where the real complexity starts to expand.\nAI systems now sit between content and audience. They do not behave like traditional search engines. They summarize, recommend, and sometimes cite. Critically, they do not agree with each other.\nIn mid-2025, BrightEdge analyzed brand recommendations across ChatGPT, Google AI experiences, and other AI-driven interfaces and found that they disagreed on brand recommendations for 62% of queries. Search Engine Land covered the same analysis and framed it as a warning for marketers assuming consistency across AI search experiences.\nThis introduces a new kind of SEO work. Rankings alone no longer describe visibility. Practitioners now track whether their brand appears in answers, which pages are cited when citations exist, and how often competitors are recommended instead.\nThis is not arbitrary. Retrieval-augmented generation exists precisely to ground AI responses in external sources and improve factual reliability. The original RAG paper outlines this architecture clearly.\nThat architectural choice pulls SEO into new territory. Content must be written so it can be extracted without losing meaning. Ambiguity becomes a liability. Sections must stand alone.\nPages are no longer the smallest competitive unit. Passages are. And despite being told we shouldn’t focus on chunks for traditional search, when you look outside of traditional search, you need to understand the role chunks play. And traditional search isn’t the only game in town now.\nModern retrieval systems often pull fragments of content, not entire documents. That forces SEOs to think in chunks. Each section needs a single job. Each answer needs to survive without surrounding context.\nThis changes how long-form content is written. It does not eliminate depth. It demands structure. We now live in a hybrid world where both layers of the system must be served. It means more work, but selecting one over the other? That’s a mistake at this point.\nDiscovery increasingly starts with cameras. Google Lens allows users to search what they see, using images as queries. Pinterest Lens and other visual tools follow the same model.\nThis forces new responsibilities. Image libraries become strategic assets. Alt text stops being a compliance task and becomes a retrieval signal. Product imagery must support recognition, not just aesthetics.\nGoogle’s product structured data documentation explicitly notes that product information can surface across Search, Images, and Lens experiences.\nVoice changes how people ask questions and what kind of answers they accept. Queries become more conversational, more situational, and more task-focused.\nIndustry research compiled by Marketing LTB shows that a meaningful portion of users now rely on voice input, with multiple surveys indicating that roughly one in four to one in three people use voice search , particularly on mobile devices and smart assistants.\nThat matters less as a headline number and more for what it does to query shape. Spoken queries tend to be longer, more natural, and framed as requests rather than keywords. Users expect direct, complete answers, not a list of links.\nAnd the biggest search platform is reinforcing this behavior. Google has begun rolling out conversational voice experiences directly inside Search, allowing users to ask follow-up questions in real time using speech. The Verge covered Google’s launch of Search Live , which turns search into an ongoing dialogue rather than a single query-response interaction.\nFor SEO practitioners, this expands the work. It pulls them into spoken-language modeling, answer-first content construction, and situational phrasing that works when read aloud. Pages that perform well in voice and conversational contexts tend to be clear, concise, and structurally explicit, because ambiguity collapses quickly when an answer is spoken rather than scanned. Still think traditional SEO approaches are all you need?\nThere is no single SERP. Google explains that search results vary based on factors including personalization, language, and location.\nFor practitioners, this means rankings become samples, not truths. Monitoring shifts toward trends, segments, and outcome-based signals rather than position reports.\nThe third ring is where complexity becomes really visible.\nThese are not just SEO tasks. The things in this layer are entire disciplines that SEO now interfaces with.\nBrand protection used to be a communications problem. Today, it is also a retrieval problem.\nLarge language models do not simply repeat press releases or corporate messaging. They retrieve information from a mixture of training data, indexed content, and real-time sources, then synthesize an answer that feels authoritative, whether it is accurate or not.\nThis creates a new class of risk. A brand can be well-known, well-funded, and well-covered by media, yet still be misrepresented, outdated, or absent in AI-generated answers.\nUnlike traditional search, there is no single ranking to defend. Different AI systems can surface different descriptions, different competitors, or different recommendations for the same intent. That BrightEdge analysis showing 62% disagreement in brand recommendations across AI platforms illustrates how unstable this layer can be.\nThis is where SEO is pulled into brand protection work.\nSEO practitioners already operate at the intersection of machine interpretation and human intent. In an LLM environment, that skill set extends naturally into brand retrieval monitoring. This includes tracking whether a brand appears in AI answers, how it is described, which sources are cited when citations exist, and whether outdated or incorrect narratives persist.\nPR and brand teams are not historically equipped to do this work. Media monitoring tools track mentions, sentiment, and coverage. They do not track how an AI model synthesizes a brand narrative, nor how retrieval changes over time.\nAs a result, SEO increasingly becomes the connective tissue between brand, PR, and the machine layer.\nThis does not mean SEO owns brand. It means SEO helps ensure that the content machines retrieve about a brand is accurate, current, and structured in ways retrieval systems can use. It means working with brand teams to align authoritative sources, consistent terminology, and verifiable claims. It means working with PR teams to understand which coverage reinforces trust signals that machines recognize, not just headlines humans read.\nIn practice, brand protection in AI search becomes a shared responsibility, with SEO providing the technical and retrieval lens that brand and PR teams lack, and brand and PR providing the narrative discipline SEO cannot manufacture alone.\nThis is not optional work. As AI systems increasingly act as intermediaries between brands and audiences, the question is no longer “how do we rank?” It is “how are we being represented when no one clicks at all?”\nBranding is not a subset of SEO. It is a discipline that includes voice, identity, reputation, executive presence, and crisis response.\nSEO intersects with branding because AI systems increasingly behave like advisors, recommending, summarizing, and implicitly judging.\nTrust matters more in that environment. The Edelman Trust Barometer documents declining trust across institutions and brands, reinforcing why authority can no longer be assumed. Trust diminishes, and consumer behavior changes. The equation is no longer brand = X, therefore X = brand .\nSEO practitioners now care about sourcing, claims, and consistency because brand perception can now influence whether content is surfaced or ignored.\nThough old, these remain applicable. Nielsen Norman Group defines success rate as a core usability metric, measuring whether users can complete tasks. They also outline usability metrics tied directly to task efficiency and error reduction.\nWhen AI and zero-click experiences compress opportunities, the pages that do earn attention must deliver. SEO now has a stake in friction reduction, clarity, and task flow. CRO (conversion rate optimization) has never been more important, but how you define “conversion” has also never been broader.\nDiscovery spans organic, AI answers, video feeds, and paid placements. Measurement follows the same fragmentation.\nGoogle Analytics defines attribution as assigning credit across touchpoints in the path to conversion.\nSEO practitioners are pulled into cross-channel conversations not because they want to own them, but because outcomes are shared. Organic assists paid. Email creates branded demand. Paid fills gaps while organic matures.\nAudience behavior is not uniform. Pew Research Center’s 2025 research on teens, social media, and AI chatbots shows how discovery and engagement increasingly differ across age groups, platforms, and interaction modes, including traditional search, social feeds, and AI interfaces.\nThis shapes format expectations. Discovery may happen in video-first environments. Conversion may happen on the web. Sometimes the web is skipped entirely.\nSEO did not become more complex because practitioners lost discipline or focus; it became more complex because discovery fractured. The work expanded because the interfaces expanded. The inputs multiplied. The outputs stopped behaving consistently.\nIn that environment, SEO stopped being a function you execute and became a role you play inside a system you do not fully control, and that distinction matters.\nMuch of the anxiety practitioners feel right now comes from being evaluated as if SEO were still a closed loop. Rankings up or down. Traffic in or out. Conversions attributed cleanly. Those models assume a world where discovery happens in one place and outcomes follow a predictable path.\nToday, a user might encounter a brand inside an AI answer, validate it through a video platform, compare it through reviews surfaced in search, and convert days later through a branded query or a direct visit. In many cases, no single click tells the story. In others, there is no click at all.\nThis is why SEO keeps getting pulled into UX conversations, brand discussions, PR alignment, attribution debates, and content format decisions. Not because SEO owns those disciplines, but because SEO sits closest to the fault lines where discovery breaks or holds.\nThis is also why trying to “draw a box” around SEO keeps failing.\nYou can still define an SEO core, and you should. Crawlability, performance, content architecture, structured data, and measurement remain non-negotiable. But pretending the job ends there creates a gap between responsibility and reality. When visibility drops, or when AI answers misrepresent a brand, or when traffic declines despite strong fundamentals, that gap becomes painfully visible.\nWhat’s changed is not the importance of SEO, but the nature of its influence.\nModern SEO operates as an integration discipline. It connects systems that were never designed to work together. It translates between machines and humans, between intent and interface, between brand narrative and retrieval logic. It absorbs volatility from platforms so organizations don’t have to feel it all at once.\nThat does not mean every SEO must take on every cup in the cabinet. It does mean understanding what those cups contain, which ones you own, which ones you influence, and which ones you simply need to account for when explaining outcomes.\nThe cabinet is already there, and you can choose to keep reaching for a single familiar mug and accept increasing unpredictability. Or you can open the cabinet deliberately, understand what’s inside, and decide how much of the expanded role you’re willing to take on.\nEither choice is valid, but pretending everything still fits in one cup is no longer an option.\nThis post was originally published on Duane Forrester Decodes ."
  }
]