[
  {
    "url": "https://martech.org/marketing-learned-how-to-grab-attention-but-forgot-what-to-do-with-it/",
    "title": "Marketing learned how to grab attention, but forgot what to do with it",
    "date": "2026-01-21T13:35:00+00:00",
    "content": "I remember seeing the famous Dollar Shave Club commercial “ Our Blades are F***ing Great ” for the first time. Someone walked up to my desk and said, “You have got to see this.” It’s certainly absurd, but that was the point. It got the point across  —  “Dollar Shave Club’s razors are better, cheaper and easier to get than competitors.”\nWithin two days, Dollar Shave Club had 12,000 orders and crashed their servers. Within three years, they hit $152 million in revenue. In 2016, Unilever bought them for $1 billion.\nI didn’t realize it at the time, but I was watching the birth of something new and misunderstood: the attention economy.\nAfter the ad went viral, I saw hundreds of copycats. None worked.\nTo quote Basher from “Ocean’s 13,” “You don’t run the same gag twice. You do the next gag.” Marketers tried and failed because they learned the wrong lesson.\nDollar Shave Club’s ad worked because it used novelty to cut through the noise, letting a single, concrete claim hit the viewer. The comedy was just a delivery mechanism.\nDig deeper: Why CreativeOps and MOps can’t survive independently\nMarketing, however, got a simpler takeaway  —  grab attention at all costs. Over the next decade, all the training, tools and incentives tried to do just that, and mostly failed. They lost the second half of the equation — having something credible and valuable to say once you got attention. Clearly, that matters more than most teams realize.\nIn the past three months, dozens of people have pitched me on writing a book. They use the same stat in their pitch — that when you have “author” next to your name, it’s easier to get attention from your target audience because the author title gives you credibility. That scares me.\nPeople hire ghostwriters to buy credibility with their good writing and clear thinking. The existence of so many ghostwriting companies shows that many people and companies recognize that a lack of credibility is a problem. It shows that customers no longer respond to attention-grabber ads like they used to. It also shows that marketers must prepare for the next “economy”  —  the trust economy.\nWhen too many people fight for customer attention, and too few have something valuable to say, marketers double down on buying credibility. But when everyone has “author,” or any other manufactured title, next to their name, the title becomes meaningless.\nYou can’t buy credibility. And borrowed credibility doesn’t store well. It expires quickly under scrutiny.\nCredibility must be earned through experience. There’s a difference between 10 years of marketing experience and one year repeated 10 times.\nAttention still matters. Novelty and humor still matter. But the next phase of marketing won’t reward eyeballs as much as it will reward those who are still trustworthy once attention is won. That’s a shift many of the marketing teams I’ve worked with aren’t preparing for.\nDig deeper: 3 brand mistakes that AI will keep amplifying in 2026\nHere are three rules that marketing teams can use to begin building credibility today.\nIn 2006, Microsoft partnered with comedian Demetri Martin for the rollout of Windows Vista, its next operating system. The campaign was clever, funny and well-funded. It got great numbers and won awards. It also failed to drive Windows Vista sales, and many users opted to stick with Windows XP.\nWhen asked about the campaign, people remembered Demetri Martin, but not why Vista was better than XP. Dollar Shave Club used absurdity to get attention while making an important point. Novelty was a tool, not the point. Microsoft made novelty the goal and forgot that attention isn’t the same as trust. They forgot that sales is the art of getting someone to trust you to solve their painful problems.\nA few minutes into a sales call, a founder said, “Our customer retention is 90%.” I knew it wasn’t true. I’ve reviewed retention data for sub-$10M companies for years. Numbers like that don’t exist at that stage.\nSo, I asked how they measured it. There was a pause, then a clarification, then the truth spilled out. Retention was closer to 20%. At that point, the meeting was effectively over. I doubt I was the only prospect who walked away that week.\nNot because the number was bad. Early-stage SaaS retention is ugly. It’s because their claim couldn’t stand up to basic examination. If they’d tried to hide something this fundamental, then what else were they hiding?\nThat’s how credibility works. You can’t fake it. It’s earned by knowing why something is true, because you’ve stress-tested it against reality. In the credibility economy, every claim gets examined. And the ones that can’t be defended disqualify you entirely.\nLast month, I got a LinkedIn message from a kid who wasn’t old enough to drink, who promised in no uncertain terms “5 conversations with qualified leads per week with your exact target audience.” No context or conditions. Pure bravado. I ignored it.\nRegardless of age, anyone who’s tried to book buyer conversations knows how many variables can blow that promise up. Those limits are learned by failing. He hadn’t failed enough yet. Markets are very good at spotting that mismatch.\nHe’s far from alone. Plenty of people think that out-promising the competition will build confidence in their product or service. It does the opposite. It reduces trust.\nThe alternative to bold claims isn’t timid ones, it’s credible ones. Credible operators don’t make grand promises. They make precise ones. They know precisely what they can and can’t do, and they’re not afraid to share both.\nThis is an uncomfortable time for marketing. I see teams who are very good at getting seen, but increasingly bad at being believed. They’re optimized for attention while ignoring the credibility they’ll need when people stop believing every claim they hear. That shift is already happening.\nBuyers are making fewer impulsive decisions. Sales cycles are longer and more thorough. Messaging that used to convert doesn’t because it isn’t credible.\nDig deeper: What efficiency-first martech gets wrong about creativity\nWhen markets tighten up and capital gets cautious, the margin for error disappears. Every purchase decision is vetted as if someone’s career is at stake, because it probably is. Brands that can’t explain where, when and why they’re right are quietly and instantly disqualified.\nThe teams that win in the future won’t do it by being louder than everyone else. They’ll do it because their claims survive under a microscope. Because they know attention can be rented, but credibility must be earned.\nWhen the market moves from rewarding attention to demanding credibility, will you know how to build it? Or have you been focused on attention for so long that you’re not even sure where to start?"
  }
]