[
  {
    "url": "https://blog.hubspot.com/marketing/hubspot-marketers-lessons-2025",
    "title": "\"AI is bad at being cool\"",
    "date": "2025-12-15T10:00:06+00:00",
    "content": "I spent the last week asking HubSpot marketers to get really honest about what actually worked for them in 2025 — and what they let go of.\nSix HubSpotters share some of their “why didn’t I do this sooner?” moments from the past 12 months, from rethinking how they use AI to backing unmeasurable bets.\n“ Stop overthinking AI. It is exciting, easily the biggest technological shift of my lifetime, but so many use cases are still experimental and not consistently accurate.\n“The real wins have come from keeping it simple. Small tasks, small workflow tweaks. Building a handful of custom GPTs for specific jobs, getting meeting notes summarized for a quick Slack update, turning messy ideas into a clear campaign brief.\n“Those little building blocks have made me way more productive, organized, and efficient at work.”\n“I would have told myself not to overthink how AI is disrupting top of funnel search marketing, and that’s because we’ve seen this year how the search community has evolved to focus on optimizing for AI visibility . We’ve now got AI visibility monitoring tools, proven AEO tactics, and clear AEO reporting KPIs.\n“In January 2025, the route forwards was uncertain, but we’ve thankfully been able to navigate that uncertainty and establish a new AEO process that’s scaling AI visibility for HubSpot.”\n“My biggest win came from a simple mindset shift. I stopped thinking I needed a playbook for everything and started treating each challenge like something I could figure out. Once I leaned into that, my work got faster and the results got better.”\n“One small change I made in H1 2025 that had an outsized impact on H2 results was repurposing one 15-minute meeting per month to educate my team on AI developments. AI Overviews, model updates, and the decrease of organic traffic was very nerve-wracking — especially for those with SEO backgrounds. But spending the time to consolidate information from across the industry into short lessons empowered my team to use AI in their work daily .\n“Now in December, they're bringing news and insights to me and sharing with each other. Our efficiency and creativity have improved greatly, which has led to growing AI referral demand.”\n“ The narrative that AI will replace the need for creative strategists is so wrong.\n“We integrated AI into our social content production this year, and the opposite proved true: AI made creative strategy and taste more valuable, not less. Anyone can generate content now. But knowing what's viral vs forgettable, culturally fluent vs cringe, and what maintains our voice vs sounding like generic AI because what actually makes the content work.\n“ AI is pretty bad at being cool, interesting, and differentiated , and I‘m not sure that’s something that can be prompted.”\n“This year I let go of the idea that if you can’t measure it, you shouldn’t do it. We backed out-of-home in a region where awareness had stalled, even though it didn’t map to a clean LTV story. It worked. Not everything that builds brand shows up in the weekly dashboard. “"
  }
]