[
  {
    "url": "https://sproutsocial.com/insights/social-media-content-series/",
    "title": "The rise of episodic content: Should your brand launch a social media content series?",
    "date": "2026-01-06T15:51:35+00:00",
    "content": "When you scroll your feed on major social media networks, it looks nothing like it did a few years ago. Gone are photo dumps from your friends and family. Instead, you’ll see video after video starring people you don’t know. Some of these videos are from influencers and creators, while others are from brands.\nSocial has become the new destination for video streaming, an inevitable milestone after years of video dominance. We swipe through videos like we’re changing the TV channel (Instagram even recently launched Instagram for TV ). Top brands are responding by building their own social media content series .\nRead on to learn more about the consumer preferences that led to the explosion of social media content series. Plus, examples of real brands producing their own episodic content, and actionable advice for teams that want to follow suit.\nFirst, what is episodic social media content? Episodic content is a series of interconnected social video posts that weave together a larger story or theme. Similar to a TV series, episodic content crafts a brand universe with a cohesive narrative and familiar faces.\nHuman-centric storytelling and relatability are hallmarks of episodic social content, as many series center around real and fictional people.\n“A lot of brands are creating series that mirror TV shows, like Office-style workplace content. The common thread is serialization; people want to follow along and come back for the next episode,” described Angelo Castillo, the creator behind ProfitPlug, when asked about current social media trends.\nAs Castillo pointed out, content series are a strategic response to saturated feeds , where posting for volume alone is unlikely to grab attention as audiences tune out noise. It’s a way to create something specific to your brand that can’t be replicated by a competitor. It hooks consumers and reels them in for the long haul.\nWhen we asked over 2,000 global social media users what they wanted brands to prioritize in 2026, 57% said posting original content series, per the Sprout Q2 2025 Pulse Survey . That answer was nearly tied with interacting with audiences, the top response.\nLet’s dive deeper into where audience appetite for serialized storytelling is coming from.\nA predictable posting cadence creates a fear of missing out among your audience, especially when you’re publishing serialized content. When a new episode drops every week, consuming your content becomes a weekly ritual for your community. They seek out the latest video instead of waiting for it to pop up in their feed.\nAs creator Coco Mocoe wrote for Sprout’s Substack, Social Futures, “The routine that long-form creators give their audience through weekly podcast or YouTube uploads is something that even the most viral TikTokers and short-form creators fail to replicate due to the nature of the unpredictable algorithms. To transcend algorithms, you have to give your audience routine.”\nJust like characters in our favorite books and TV shows, the continuous narrative arcs in a social series foster emotional investment and connection. We need to know what happens next, how the story ends.\nThese emotional ties extend beyond the stars of the series, with bonds forming between fellow fans, too. By posting and interacting in the comments sections, we become a part of something. Like when Brita dropped their viral song “ At least I’m hydrated ” on Spotify, and nearly 105,000 people streamed it and thousands shared their love for the single on TikTok.\nNot only does episodic content answer the consumer mandate for original, human-generated content, it also answers consumers’ call for community. For brands, this translates to audiences becoming loyal viewers, and often brand advocates with a higher customer lifetime value . Content series aren’t just about entertainment—they’re a full-funnel effort.\nWe are living in an era of constant content consumption and AI slop. People are overloaded with stimuli. Merriam-Webster even named “ slop ” the 2025 word of the year.\nThe content that stops their scroll is relatable, entertaining, educational, niche or human-centered. Everything else is passed over. Content series allow brands to embody all of those traits, while building out lore and depth in their narratives.\nThe shift toward serialized storytelling isn’t just a trending format. It’s the beginning of what Rachel Karten, author of Link in Bio, calls “post-social media” or “New Social.” Karten explains how in this new landscape, recommendation-based algorithms reward episodic content because it retains viewership. Among a deluge of content, viewers will continue tuning in.\nNow the fun part: seeing episodic content in action. These are a few of Team Sprout’s favorite brand content series, with the best characters, storylines and fanbases.\nJewelry and lifestyle brand Alexis Bittar’s character Margeaux Goldrich has become a pop culture phenomenon all her own. The brand first introduced Goldrich, played by Patricia Black, and her sidekick Jules/Hazel, played by Julie J., in 2024. The two are a part of the larger Bittarverse , a brand universe created to showcase the brand’s jewelry and handbags in a disruptive, social-first way, while paying homage to the many personalities of New York City.\nIn the brand’s mockumentary-style videos, Margeaux collides with famous celebrities and stylists from the real world—all while forcing Jules/Hazel to jump through increasingly egregious hoops. It’s “The Real Housewives of New York” repackaged for social.\nSports retailer Under Armour announced the launch of Lab96 Studios , its new in-house content studio designed to deliver athlete stories in episodic and cinematic ways. Lab96 Studios is the beginning of a new kind of marketing for the company—a shift away from traditional ads toward entertainment-driven content.\nThe studio’s debut short film, We Are Football , features Under Armour brand ambassadors—from NFL athletes to emerging stars in women’s flag football. In just three minutes, the brand weaves together a world where their ambassadors have superhuman abilities.\nThe finance automation platform, Ramp, makes corporate spending clear and easy. Like other B2B companies, product benefits are at the forefront of their marketing. Unlike other B2B companies, Ramp uses episodic content as the vehicle for their brand storytelling.\nWhether it’s making the office Grinch’s holiday season “chill” or calling on a former contractor for “one last job” (à la the artistic stylings of filmmakers Christopher Nolan and Martin Scorsese), they drop us into a scene that’s relatable and deeply entertaining—yet still product-centric.\nWhen planning your social media series, it’s important to consider how your content will stand out from your competitors and other creators. Here are tips for crafting episodic content that is truly unique and tailored to your target audience.\nVideo is the bedrock of episodic content. Some brands create short-form, lo-fi videos for multi-part series, while other brands take a highly-produced, cinematic approach. The type of video content you create will depend on your internal capabilities and the subject matter of your series.\nTake Immi Eats’ “Ramen on the Street” series. The videos are casual and appear to be taken with a smartphone, a typical style for man-on-the-street interviews. Whereas Nike produces Oscar-worthy athlete profiles , similar to professional documentaries.\nNo matter where you fall stylistically, many brands will need to invest in video production beyond their existing bandwidth to pull off episodic content. As Castillo predicts , “Content creators will become the next coveted [corporate] roles. Strategists, scriptwriters and producers will be highly sought after. Creative strategists who can blend data with storytelling will be especially competed for. The traditional social media manager role will split, with some focusing on community and analytics, others on content production.”\nApply it: Start by dreaming up the focal point of your series and the story arc. What type of video is needed to tell the story correctly? What resources will you need to get there? Where do you have skill gaps on your team? It’s better to take stock in the beginning so you can secure the resources you need and maintain a consistent look and feel throughout the series.\nSo, you have an imaginative concept for your series. Check. You know it will be highly engaging and perform well. Check, check. The only problem is your narrative has nothing to do with the messaging framework your product marketing team handed down. What should you do?\nMove forward with your idea anyway. Prioritize human-led storytelling over corporate messaging. When it comes to episodic content, focusing too much on product can detract, especially if it’s not a natural fit.\nLook at Bilt’s series, Roomies . The theme of the show—the convergence of roommates in New York City—is adjacent to Bilt’s platform, where users can earn points for on-time rent payments. But Bilt’s platform hardly shows up in the series at all. The purpose of Roomies is to build brand goodwill, not promote a specific offering, according to Bilt’s senior director of content .\nApply it: When outlining your series, don’t push a hard sell. Episodic content complements other efforts in your brand ecosystem—like paid and influencer marketing—but should feel like organic, social-first content. Keep human connection at the heart.\nFamiliar faces make for compelling (and heart-warming) characters in a series. For some brands, that might mean “casting” full-time members of your social and content teams. For others, it could mean hiring professional actors.\nYou could also consider spotlighting your influencer partners and brand fans in the series. Pretzelized even hired stand-up comedians for their series, “ Pretzel or Pita Chip? ” The brand went on to work with the comedians as brand ambassadors.\nApply it: Every series needs a cast. When finding stars for episodic content, consider how series regulars will interact in your content ecosystem and as part of your brand universe.\nBecause of social, every brand is co-created by its audience—whether they want to be or not. It’s best to get ahead of public sentiment and align with audience feedback early on. Content series are no exception. Fans want to influence how storylines pan out and which characters are brought back. It’s important to listen to audience reactions and comments in real-time to inform your storylines, turning social insights into creative feedback.\nThrough the comments section especially, you’ll know if you’re making your audience feel seen . Like in Tower28’s series The Blush Lives of Sensitive Girls . A character was accused of looking like a “ghost” without Tower28 blush, to which one user replied, “We all know that feeling.”\nApply it: It’s important to ritualize gathering, analyzing and sharing audience feedback. Have a plan in place to surface both quantitative and qualitative data. It can help guide your content, secure more resources and plan your series’ next season.\nBy giving audiences familiar characters, predictable cadences and human-centered narratives worth following, brands move from being passively consumed to actively sought out. The mandate is to think like an entertainment brand. That means allocating resources to storytelling and video, and building feedback loops that let audience insights shape what comes next. Episodic content isn’t a passing fad, it’s a long-term engine for building community, brand affinity and full-funnel impact.\nFor another example of episodic content in action, check out Sprout Social’s My Social Media Diet Substack series where social marketers sound off on their predictions for the future of social."
  },
  {
    "url": "https://martech.org/b2b-marketing-on-tiktok-what-you-need-to-know/",
    "title": "B2B marketing on TikTok: What you need to know",
    "date": "2026-01-06T15:44:35+00:00",
    "content": "Updated with details on TikTok’s new US-based ownership .\nTikTok is mainly seen as a prime venue for Gen Z to share dance crazes, which can be perfect for B2C marketers. However, its reach is far broader than that. According to Meltwater, TikTok ads have the potential to reach 48.8% of people over the age of 18 in the U.S.\nSo, it’s useful for B2B marketers, too. Also, the Gen Z cohort is moving up into positions to make purchase decisions.\nWhat makes it suitable for B2C applies to B2B as well. It is an essential tool for brands to connect directly with customers. It offers opportunities for in-app shopping, live-streaming and branded hashtag challenges. However, marketers must understand and work with TikTok’s culture to succeed.\nThis guide covers key data, user demographics, marketing strategies, content creation and best practices for B2B success on TikTok.\nUse the form below and MarTechBot will personalize the content on this page according to your job role. If you’d rather not personalize the content, simply keep reading.\nWhile the platform initially appealed primarily to Gen Z and younger millennials, it experienced significant growth among older demographics and professional audiences. Today, many decision-makers and industry professionals turn to TikTok for both informational content and entertainment, positioning it as a valuable channel for engaging B2B audiences. Additionally, it is important to note that B2B decision-makers have been getting younger in recent years, and a significant proportion are now of digital natives.\nThe app’s short video format allows for presenting intricate topics in an engaging and easily digestible manner. Furthermore, TikTok provides various advertising options, including targeted ads and influencer collaborations, making it easier to reach specific B2B audiences.\nDig deeper: How influencer marketing became an essential marketing channel\nData from TikTok and Nielsen also found that the platform is the fastest-growing channel for product discovery. According to the data, 15% of product discoveries begin on TikTok. According to TikTok data, advertisers are now seeing an average return of $2 for every $1 spent .\nGender distribution: TikTok’s user base is relatively balanced in gender, with 54% identifying as male and 45% identifying as female.\nAge distribution: While TikTok is popular among younger generations, a substantial portion of its audience comprises older demographics. For example, 21.7% of TikTok’s US user base are Millennials. Also:\nGeographic distribution: The top three countries with the most TikTok users are the United States, Indonesia and Brazil. The U.S. has the largest TikTok audience, with 148 million monthly unique users. Indonesia has 126.83 million users and Brazil has 98.59 million users.\nSmall business owners: Small business owners represent a significant community on TikTok. More than half (52%) of users exposed to SMB (small and mid-size business) content on TikTok made purchases, demonstrating the platform’s power to drive intent, according to a report by The Drum.\nDig deeper: 6 things to look for in a B2B influencer\nTikTok’s algorithm is the key to the site. It’s so important that the Chinese government has said it cannot leave China (further clouding a possible sale of the platform). The algorithm determines which content appears on a user’s For You Page (FYP).\nSmaller accounts gain the highest impression percentage from the ‘For You’ feed, showing that TikTok’s algorithm gives any content an equal opportunity to go viral, regardless of followers. Good content can go viral if it has captured targeted user interest.\nDig deeper: Behind the scenes of Betterment’s B2B brand awareness campaign\nHere are some specific use cases for B2B companies on TikTok:\nMany B2B brands have established a presence on TikTok to connect with a broader audience, showcase their expertise and humanize their brand. Here are some examples of B2B brands on TikTok and how they have used the platform:\nThese brands adjust their voice to match TikTok’s focus on humor and entertainment. They create demo videos to illustrate product features, share valuable tips and fun facts, highlight their product from the customer’s perspective and provide behind-the-scenes glimpses of their company’s operations.\nDig deeper: How to balance ROAS, brand safety and suitability in social media advertising\nTikTok is replacing its Creator Marketplace with the TikTok One creative platform. The marketplace, which facilitated brand and creator collaboration, is closed for new campaigns and will fully shut down on April 1, 2025. The social media site also shut down its Video Generator tool, an online editor where people could upload videos and add music.\nThese features have been combined in TikTok One, along with tools to help creators find inspiration, research trends and connect with experts to make “native-looking” TikTok videos for ad campaigns.\nTikTok’s CPM is the best bargain in social media right now — which isn’t good news for the platform. The cost per mille has dropped by 80% year-over-year, according to AdRoll’s latest State of Digital Advertising report. “The decline reflects growing uncertainty about the platform’s future in the United States, leading advertisers to pull back their investments.”\nPinterest has done the best of the social media platforms covered in the report. Its CPMs are up 120% year-over-year “as brands reallocate budgets to more stable platforms with an established user base.” The report also speculated that advertisers may prefer Pinterest’s user base of “more established” generations (I think they mean older) to TikTok’s younger ones, especially as the U.S. economy continues to ride the whirlwind.\nTikTok upgraded its generative AI offering—Symphony—with tools to streamline creative work and move faster without sacrificing quality.\nTikTok is also expanding its reach through partnerships. The Image to Video tool is coming to Adobe Express so that creators can build content directly inside Adobe’s social media platform. Some Symphony tools (like AI dubbing and avatars) are also making their way into WPP Open, WPP’s AI-powered marketing suite. The tools—Image to Video, Text to Video and Showcase Products—aren’t in WPP Open yet.\nOutside the Symphony suite, TikTok’s “Generate with AI” feature in Ads Manager provides another way to quickly create creative assets. Drop in a product URL, TikTok Shop ID or a few manual inputs, and it will generate videos, images, scripts, voiceovers and avatars. Then, it picks the top 10 based on AI insights, which you can tweak as needed. It is available (for now) to select advertisers using English content.\nTikTok says it’s committed to transparency: All Symphony-generated content is clearly labeled as AI, and everything, including the input and final output, goes through multiple layers of review.\nOf course, all this raises some big questions. With AI avatars able to endlessly crank out content, what happens to human influencers? Brands get scalability and fewer contracts to manage, but there’s concern that an AI flood might put downward pressure on creator rates.\nTikTok is expanding its “Out of Phone” program, extending its digital influence into the physical world by leveraging real-world screens and spaces. The new phase includes partnerships with Curb, Westfield Malls, Rockbot, and Hope Hydration, bringing TikTok content to taxis, shopping centers, fitness venues, airports, retail locations, and hydration stations. This initiative follows successful billboard and retail placements and underscores TikTok’s goal to make its community-driven content more accessible in everyday environments.\nEach partner brings a distinct context for TikTok content to reach audiences. Curb’s Taxi TV network will show full-screen videos in over 15,000 taxis across 65+ U.S. cities. Westfield Malls will integrate TikTok content into digital screens across upscale shopping centers, tapping into the popular #TikTokMadeMeBuyIt trend. Rockbot will deliver curated TikTok streams in high-traffic spaces like gyms and cafes. Meanwhile, Hope Hydration’s 55-inch digital HydroStations—installed at locations such as Times Square and major festivals—will blend hydration with bite-sized entertainment. Together, these moves further embed TikTok into consumers’ offline journeys, transforming idle moments into engagement opportunities.\nTikTok finally signed a deal to sell its U.S. operations to American investors, which resolves long-running uncertainty about the platform’s future in the United States. The deal creates a new U.S. joint venture backed by Oracle, Silver Lake and MGX that will retain TikTok’s massive U.S. user base and allow advertisers and creators to keep using the platform without disruption, while retraining the recommendation algorithm on U.S. data and storing that data locally for security assurances. For B2B marketers who have been watching TikTok’s fate closely, the new ownership structure should mean continued access to the platform’s reach and engagement tools, removing a key strategic unknown from 2026 planning and enabling more confidence in allocating budget to short-form video and creator-driven campaigns."
  }
]