[
  {
    "url": "https://www.searchenginejournal.com/googles-recommender-system-breakthrough-detects-semantic-intent/564393/",
    "title": "Google’s Recommender System Breakthrough Detects Semantic Intent via @sejournal, @martinibuster",
    "date": "2026-01-06T10:26:32+00:00",
    "content": "Google published a research paper about helping recommender systems understand what users mean when they interact with them. Their goal with this new approach is to overcome the limitations inherent in the current state-of-the-art recommender systems in order to get a finer, detailed understanding of what users want to read, listen to, or watch at the level of the individual.\nRecommender systems predict what a user would like to read or watch next. YouTube, Google Discover, and Google News are examples of recommender systems for recommending content to users. Other kinds of recommender systems are shopping recommendations.\nRecommender systems generally work by collecting data about the kinds of things a user clicks on, rates, buys, and watches and then using that data to suggest more content that aligns with a user’s preferences.\nThe researchers referred to those kinds of signals as primitive user feedback because they’re not so good at recommendations based on an individual’s subjective judgment about what’s funny, cute, or boring.\nThe intuition behind the research is that the rise of LLMs presents an opportunity to leverage natural language interactions to better understand what a user wants through identifying semantic intent.\n“Interactive recommender systems have emerged as a promising paradigm to overcome the limitations of the primitive user feedback used by traditional recommender systems (e.g., clicks, item consumption, ratings). They allow users to express intent, preferences, constraints, and contexts in a richer fashion, often using natural language (including faceted search and dialogue).\nYet more research is needed to find the most effective ways to use this feedback. One challenge is inferring a user’s semantic intent from the open-ended terms or attributes often used to describe a desired item. This is critical for recommender systems that wish to support users in their everyday, intuitive use of natural language to refine recommendation results.”\nThe researchers explained that hard attributes are something that recommender systems can understand because they are objective ground truths like “genre, artist, director.” What they had problems with were other kinds of attributes called “soft attributes” that are subjective and for which they couldn’t be matched with movies, content, or product items.\nThe research paper states the following characteristics of soft attributes:\nThe problem of soft attributes is the problem that the researchers set out to solve and why the research paper is called Discovering Personalized Semantics for Soft Attributes in Recommender Systems using Concept Activation Vectors.\nConcept Activation Vectors (CAVs) are a way to probe AI models to understand the mathematical representations (vectors) the models use internally. They provide a way for humans to connect those internal vectors to concepts.\nSo the standard direction of the CAV is interpreting the model. What the researchers did was to change that direction so that the goal is now to interpret the users, translating subjective soft attributes into mathematical representations for recommender systems. The researchers discovered that adapting CAVs to interpret users enabled vector representations that helped AI models detect subtle intent and subjective human judgments that are personalized to an individual.\n“We demonstrate … that our CAV representation not only accurately interprets users’ subjective semantics, but can also be used to improve recommendations through interactive item critiquing.”\nFor example, the model can learn that users mean different things by “funny” and be better able to leverage those personalized semantics when making recommendations.\nThe problem the researchers are solving is figuring out how to bridge the semantic gap between how humans speak and how recommender systems “think.”\nHumans think in concepts, using vague or subjective descriptions (called soft attributes).\nRecommender systems “think” in math: They operate on vectors (lists of numbers) in a high-dimensional “embedding space”.\nThe problem then becomes making the subjective human speech less ambiguous but without having to modify or retrain the recommender system with all the nuances. The CAVs do that heavy lifting.\n“…we infer the semantics of soft attributes using the representation learned by the recommender system model itself.”\n“(1) The recommender system’s model capacity is directed to predicting user-item preferences without further trying to predict additional side information (e.g., tags), which often does not improve recommender system performance.\n(2) The recommender system model can easily accommodate new attributes without retraining should new sources of tags, keywords or phrases emerge from which to derive new soft attributes.\n(3) Our approach offers a means to test whether specific soft attributes are relevant to predicting user preferences. Thus, we are able focus attention on attributes most relevant to capturing a user’s intent (e.g., when explaining recommendations, eliciting preferences, or suggesting critiques).\n(4) One can learn soft attribute/tag semantics with relatively small amounts of labelled data, in the spirit of pre-training and few-shot learning.”\nThey then provide a high-level explanation of how the system works:\n“At a high-level, our approach works as follows. we assume we are given:\n(i) a collaborative filtering-style model (e.g.,probabilistic matrix factorization or dual encoder) which embeds items and users in a latent space based on user-item ratings; and\n(ii) a (small) set of tags (i.e., soft attribute labels) provided by a subset of users for a subset of items.\nWe develop methods that associate with each item the degree to which it exhibits a soft attribute, thus determining that attribute’s semantics. We do this by applying concept activation vectors (CAVs) —a recent method developed for interpretability of machine-learned models—to the collaborative filtering model to detect whether it learned a representation of the attribute.\nThe projection of this CAV in embedding space provides a (local) directional semantics for the attribute that can then be applied to items (and users). Moreover, the technique can be used to identify the subjective nature of an attribute, specifically, whether different users have different meanings (or tag senses) in mind when using that tag. Such a personalized semantics for subjective attributes can be vital to the sound interpretation of a user’s true intent when trying to assess her preferences.”\nOne of the interesting findings is that their test of an artificial tag (odd year) showed that the systems accuracy rate was barely above a random selection, which corroborated their hypothesis that “CAVs are useful for identifying preference related attributes/tags.”\nThey also found that using CAVs in recommender systems were useful for understanding “critiquing-based” user behavior and improved those kinds of recommender systems.\n“(i) using a collaborative filtering representation to identify attributes of greatest relevance to the recommendation task;\n(ii) distinguishing objective and subjective tag usage;\n(iii) identifying personalized, user-specific semantics for subjective attributes; and\n(iv) relating attribute semantics to preference representations, thus allowing interactions using soft attributes/tags in example critiquing and other forms of preference elicitation.”\nThey found that their approach improved recommendations for situations where discovery of soft attributes are important. Using this approach for situations in which hard attributes are more the norm, such as in product shopping, is a future area of study to see if soft attributes would aid in making product recommendations.\nThe research paper was published in 2024 and I had to dig around to actually find it, which may explain why it generally went unnoticed in the search marketing community.\nGoogle tested some of this approach with an algorithm called WALS (Weighted Alternating Least Squares), actual production code that is a product in Google Cloud for developers.\nTwo notes in a footnote and in the appendix explain:\n“CAVs on MovieLens20M data with linear attributes use embeddings that were learned (via WALS) using internal production code, which is not releasable.”\n…The linear embeddings were learned (via WALS, Appendix A.3.1) using internal production code, which is not releasable.”\n“Production code” refers to software that is currently running in Google’s user-facing products, in this case Google Cloud. It’s likely not the underlying engine for Google Discover, however it’s important to note because it shows how easily it can be integrated into an existing recommender system.\nThey tested this system using the MovieLens20M dataset, which is a public dataset of 20 million ratings, with some of the tests done with Google’s proprietary recommendation engine (WALS). This lends credibility to the inference that this code can be used on a live system without having to retrain or modify them.\nThe takeaway that I see in this research paper is that this makes it possible for recommender systems to leverage semantic data about soft attributes. Google Discover is regarded by Google as a subset of search, and search patterns are some of the data that the system uses to surface content. Google doesn’t say whether they are using this kind of method, but given the positive results, it is possible that this approach could be used in Google’s recommender systems. If that’s the case, then that means Google’s recommendations may be more responsive to users’ subjective semantics.\nThe research paper credits Google Research (60% of the credits), and also Amazon, Midjourney, and Meta AI.\nDiscovering Personalized Semantics for Soft Attributes in Recommender Systems using Concept Activation Vectors"
  },
  {
    "url": "https://www.blogdigital.fr/pourquoi-contenus-ne-convertissent-pas-et-comment-les-aligner-avec-objectifs-marketing/",
    "title": "Pourquoi vos contenus ne convertissent pas et comment les aligner avec vos objectifs marketing ?",
    "date": "2026-01-06T11:19:04+00:00",
    "content": "Vos publications génèrent-elles vraiment des clients ?\nVous publiez régulièrement des articles, des vidéos, des livres blancs, et même des posts sur LinkedIn. Autrement dit, la machine à contenu est en marche. Et pourtant, la conversion ne suit pas. Les visiteurs consomment, repartent, et les équipes commerciales jugent les leads peu exploitables. Le marketing, de son côté, observe une hausse du trafic et de l’engagement, sans impact direct sur le chiffre d’affaires.\nSi cela peut paraître étonnant au premier abord, en réalité, ce décalage est fréquent. Il ne vient pas d’un manque d’effort, mais plutôt d’un défaut d’alignement entre le contenu, les objectifs marketing et les attentes commerciales. Désormais, produire du contenu ne suffit plus , car celui-ci doit s’inscrire dans un parcours structuré, pensé pour accompagner un prospect jusqu’à la décision.\nCréer du contenu sans objectif précis revient à diffuser des messages sans aucune direction. Dans les faits, beaucoup d’équipes publient simplement du contenu « pour exister », sans savoir à quelle étape du parcours client chaque contenu doit répondre. Et si cela peut amener à des articles parfois intéressants, il n’y a malheureusement pas toujours de rôle clair dans la conversion.\nEn effet, un contenu vraiment efficace doit toujours s’inscrire dans une intention mesurable, qu’il s’agisse d’ attirer une audience qualifiée , de nourrir la réflexion d’un prospect , ou encore de déclencher une prise de contact . Mais sans objectifs définis, il est impossible d’évaluer la performance autrement qu’avec des métriques superficielles.\nPour structurer votre approche, les spécialistes raisonnent par entonnoir avec :\nBeaucoup d’entreprises concentrent leurs efforts sur le BOFU, en parlant directement de leur solution. Néanmoins, sans travail en amont, la confiance ne se construit pas, le prospect n’est pas prêt, et il finit par quitter votre contenu sans interaction.\nA l’inverse, un calendrier éditorial structuré, associé à des objectifs clairs par contenu, permet de corriger ce déséquilibre et de mesurer la contribution réelle de chaque publication.\nPour vous aider à définir vos objectifs plus facilement, certaines solutions comme HubSpot sont reconnues aujourd’hui pour le gain de temps et l’efficacité qu’elles apportent. C’est d’autant plus intéressant qu’il est possible de créer un compte gratuit sur HubSpot , sans aucun engagement.\nUn contenu qui ne parle à personne ne convertit personne, et lorsque les personas sont mal définis, les messages deviennent génériques et perdent toute portée. Le lecteur ne se reconnaît pas dans les problématiques évoquées, ni dans le ton employé.\nPour éviter cela, vous devez définir un persona marketing qui repose sur des données très concrètes, comme son rôle, son secteur, des enjeux quotidiens, des freins à l’achat, et des critères de décision. Sans cette base de travail, les contenus restent vagues, alors qu’à l’inverse, un message ciblé, qui nomme clairement un contexte et une problématique, crée un effet miroir immédiat.\nPour construire des personas exploitables avec un outil comme HubSpot, voici trois règles à suivre :\nUne fois ces profils établis, adaptez les contenus, les formats et les appels à l’action. Par exemple, un directeur marketing attend des analyses et des données, alors qu’un responsable commercial cherche des leviers concrets pour générer des opportunités. Le fond, comme la forme, doit évoluer selon la cible.\nPublier des contenus déjà vus ailleurs ne crée ni engagement durable, ni crédibilité . A la place, les lecteurs attendent des analyses, des retours d’expérience, des angles concrets. Sans cela, votre production se fond dans la masse des milliers de contenus, d’autant plus à l’heure de l’IA où il est très facile de créer des contenus.\nDans les faits, la valeur ajoutée peut prendre plusieurs formes, avec des données internes, des cas clients détaillés, une lecture terrain issue de vos équipes, ou encore une analyse structurée d’une problématique métier que vos concurrents ne pourront pas répliquer.\nDans ce travail, le storytelling joue également un rôle clé . Montrer une situation avant/après, expliquer un choix stratégique, partager un apprentissage réel renforce l’impact du message. À cela s’ajoute la qualité rédactionnelle, avec la clarté, le rythme, et des exemples concrets tout au long du contenu pour inspirer davantage la confiance et favoriser la lecture jusqu’au bout.\nMalheureusement, beaucoup de contenus échouent car ils parlent trop de la solution, et pas assez du problème du prospect . Entre les fonctionnalités, les récompenses, et les promesses vagues, le lecteur peine à percevoir ce que cela change pour lui.\nUn contenu orienté autour de la conversion commence toujours par le contexte du client : quelle difficulté rencontre-t-il ? Quelles conséquences sur son activité ? que se passe-t-il lorsqu’une réponse adaptée est mise en place ?\nLa structure qui commence par un problème , puis une approche , avant de proposer des bénéfices concrets , aide à recentrer le message. Elle permet aussi d’adopter un ton plus humain, moins institutionnel, tout en restant crédible. En B2B, les décideurs attendent des marques capables d’expliquer simplement des sujets complexes, sans jargon superflu.\nDiffuser le même contenu partout, sans aucune adaptation, limite fortement son impact. Un même sujet peut être décliné en une landing page ou un long article pour le référencement naturel de votre site, en post sur LinkedIn , en un e-mail ciblé , en webinaire ou en vidéo .\nChaque canal a ses usages, avec LinkedIn qui favorise les messages courts et incarnés, l’e-mail qui nécessite de la personnalisation, ou une landing page qui doit aller droit au but.\nPour identifier les formats les plus engageants selon votre audience, si vous utilisez une solution comme HubSpot, vous pouvez même en profiter pour analyser les performances, car adapter la forme au contexte améliore mécaniquement les taux de conversion.\nEn centralisant votre stratégie de contenu, vous facilitez l’ alignement entre marketing et ventes . A ce titre, HubSpot se présente comme une plateforme unique pour planifier, produire, diffuser et analyser les contenus, tout en les reliant au parcours client.\nAvec HubSpot, chaque contenu peut être associé à une étape de maturité. Les interactions des visiteurs alimentent automatiquement le CRM , ce qui permet de qualifier les leads selon leurs comportements. Par la suite, les équipes identifient plus facilement les contacts prêts à être transmis aux commerciaux.\nLe Content Hub de HubSpot intègre également des recommandations pendant la rédaction pour votre site web, comme la structure, les mots-clés à utiliser, et le maillage interne entre les pages. Cette approche favorise notamment des contenus plus visibles et mieux alignés avec les intentions de recherche, si bien que les entreprises qui utilisent ces fonctionnalités observent en moyenne 29% de ventes supplémentaires sur 12 mois .\nUn lead n’est pas un client, ou du moins, pas encore, car sans accompagnement progressif, il se désengage. Beaucoup d’organisations transmettent des contacts aux commerciaux bien trop tôt, alors que le prospect n’a pas encore mûri sa réflexion.\nC’est là qu’intervient le lead nurturing , en reposant sur des scénarios automatisés, déclenchés par le comportement du prospect comme un téléchargement, une lecture répétée, ou la visite de pages clés. Tous ces signaux, s’ils peuvent paraître anodins, permettent d’ adresser le bon message, au bon moment .\nLà encore, HubSpot a l’avantage d’apporter une solution concrète, en facilitant la mise en place de workflows personnalisés . Un prospect qui consomme du contenu pédagogique peut recevoir des ressources plus avancées, puis être orienté vers une démonstration lorsque son intérêt se confirme. A terme, cette approche améliore la qualité des leads transmis aux ventes et réduit la friction entre équipes.\nUn contenu sans CTA (Call-to-action) assez clair peut laisser le lecteur sans direction, car même s’il est intéressé, il ne sait pas quelle étape suivre par la suite. Un CTA efficace repose sur trois éléments à prendre en compte : la visibilité , la clarté et le bénéfice explicite .\nPour être efficace, privilégiez des formulations autour des actions à réaliser, comme « Télécharger le guide », Demander une démo », ou « Voir l’étude de cas ».\nDans vos contenus, les CTA doivent être intégrés naturellement dans le contenu, puis renforcés en fin de lecture. En cas de doute sur la meilleure formulation à adopter, les tests A/B proposés par HubSpot permettent d’optimiser le ton, l’emplacement et le format pour identifier les combinaisons les plus performantes.\nSi vos contenus attirent du trafic mais peu de leads, cela veut dire qu’ils ne sont pas reliés à un objectif de conversion clair ou à un CTA adapté au niveau de maturité du lecteur.\nNon, il ne faut pas forcément produire plus de contenus pour convertir davantage. La cohérence, la valeur ajoutée et l’alignement avec le parcours client ont plus d’impact que le volume.\nPour savoir si un lead est prêt pour les ventes, analysez ses interactions avec une solution comme HubSpot, notamment les types de contenus consultés, la répétition des visites, et l’intérêt pour des pages décisionnelles."
  }
]