[
  {
    "url": "https://blog.hubspot.com/marketing/cristina-jerome-marketing-hot-takes",
    "title": "Use the Ick to Create Better Marketing",
    "date": "2025-12-01T12:00:03+00:00",
    "content": "Here's one: \"Any marketer that says they've never felt the ick from marketing isn't a true marketer. You do feel the ick.\"\nWhile that doesn't sound like the best lesson to open a marketing newsletter, stay with me. I swear this isn't a I'm-quitting-my-job-to-work-on-a-goat-farm hail mary.\nIt actually has more to do with foundational marketing than you think.\nCristina Jerome has had a whole host of jobs most marketers would kill for.\nShe's worked on content and social strategy for Jada Pinkett Smith's show Red Table Talk , plus Issa Rae's Rap Sh!t on HBOMax. She directed social content at Topicals, Sephora's fastest growing Black-owned skincare brand.\nShe's also dabbled in marketing for Adidas and Lobos 1707, a luxury tequila brand.\nAnd, most recently, she launched her own non-profit social club, Off Worque , which emphasizes mental health and work-life balance.\nSo my first question to Jerome was an easy one: How did building her own brand shift her approach to marketing?\n\"It didn't change logically,\" she told me. \"It changed spiritually. When you're working for someone, you're so pressed on reaching KPIs… with Off Worque, it's more organic, nurturing, emotional.\"\nShe still has KPIs, but they’re rooted in storytelling and community, not just conversions.\n\"The strategy is not 'do this to get these people.' It's me sharing my own personal story, and giving the mic to other people to share [theirs].\"\nJerome’s proudest takeaway? The work doesn’t feel as “icky\" because it's centered on well-being, not just selling.\nEven if you’re in SaaS or skincare, the lesson holds: If your marketing feels meaningless (or icky), it might be time to reconnect with the story behind the numbers.\nIf you feel inspired by what you're saying, other people will, too.\n\" I don't need to see another influencer on a boat, \" Jerome told me.\nWho does she want to see instead? Someone like Kathy, who hasn't had a break in three years and wants to FaceTime her kids to show them the lip gloss she's bringing home to them.\nJerome predicts the next level of community and brand-building will revolve around brands that take real customers on trips.\n\"Influencing… is becoming unrelatable,\" Jerome told me, adding that she'd much prefer to see brands rewarding real customers because \"it shows you that the brand actually hears you, and you're not just order #564 to them.\"\nSure, we might not all have the marketing budget to take our devoted customers on yacht excursions. But it's worth assessing your current budget allotment and questioning whether you can spend a little more of it on loyal customers, versus sinking thousands into another sponsored LinkedIn post.\nMaybe that means sending surprise freebies or thoughtful swag. It’s not a luxury cruise — but recognition goes a long way.\nJerome defines culture-first marketing as marketing rooted in authenticity and genuine cultural connection… not surface-level inclusivity.\nIn fact, she thinks inclusive marketing is a bit of a myth.\n\"I don't think inclusive marketing is a thing,\" Jerome told me, pointing to brands like Skims that appear inclusive but really cater to a particular aesthetic and lifestyle. Many brands mistake broad targeting for inclusivity when they're actually appealing to a specific consumer without acknowledging it.\nIn contrast, truly culture-first brands like Nike or Topicals are built around stories and experiences that resonate deeply with a defined cultural group — whether athletes or people with real skin conditions.\n\"You can't have culture-first marketing without a founder or brand story that aligns with the culture you're trying to speak to,\" Jerome explains. \"Without that alignment, the marketing feels performative.\"\nIf you don't have a founder who aligns with the culture, Jerome recommends building relationships with ambassadors from that community — and letting those partnerships inform your strategy and storytelling."
  }
]