[
  {
    "url": "https://www.searchenginejournal.com/ai-crawler-user-agents-list/558130/",
    "title": "Complete Crawler List For AI User-Agents [Dec 2025] via @sejournal, @vahandev",
    "date": "2025-12-05T12:00:52+00:00",
    "content": "AI visibility plays a crucial role for SEOs, and this starts with controlling AI crawlers. If AI crawlers can’t access your pages, you’re invisible to AI discovery engines.\nOn the flip side, unmonitored AI crawlers can overwhelm servers with excessive requests, causing crashes and unexpected hosting bills.\nUser-agent strings are essential for controlling which AI crawlers can access your website, but official documentation is often outdated, incomplete, or missing entirely. So, we curated a verified list of AI crawlers from our actual server logs as a useful reference.\nEvery user-agent is validated against official IP lists when available, ensuring accuracy. We will maintain and update this list to catch new crawlers and changes to existing ones.\nThe user-agent strings above have all been verified against Search Engine Journal server logs.\nWe’ve found that the following didn’t identify themselves:\nThere is no way to track this crawler from accessing webpages other than by identifying the explicit IP.\nWe set up a trap page ( e . g . , /specific-page-for-you-com/ ) and used the on-page chat to prompt you.com to visit it, allowing us to locate the corresponding visit record and IP address in our server logs. Below is the screenshot:\nUnfortunately, AI browsers such as Comet or ChatGPT’s Atlas don’t differentiate themselves in the user agent string, and you can’t identify them in server logs and blend with normal users’ visits.\nThis is disappointing for SEOs because tracking agentic browser visits to a website is important for reporting POV.\nSome hosting companies offer a user interface (UI) that makes it easy to access and look at server logs, depending on what hosting service you are using.\nIf your hosting doesn’t offer this, you can get server log files (usually located /var/log/apache2/access.log in Linux-based servers) via FTP or request it from your server support to send it to you.\nOnce you have the log file, you can view and analyze it in either Google Sheets (if the file is in CSV format), Screaming Frog’s log analyzer, or, if your log file is less than 100 MB , you can try analyzing it with Gemini AI.\nFake crawlers can spoof legitimate user agents to bypass restrictions and scrape content aggressively. For example, anyone can impersonate ClaudeBot from their laptop and initiate crawl request from the terminal. In your server log, you will see it as Claudebot is crawling it:\nVerification can help to save server bandwidth and prevent harvesting content illegally. The most reliable verification method you can apply is checking the request IP.\nCheck all IPs and scan to match if it’s one of the officially declared IPs listed above. If so, you can allow the request; otherwise, block.\nVarious types of firewalls can help you with this via allowlist verified IPs (which allows legitimate bot requests to pass through), and all other requests impersonating AI crawlers in their user agent strings are blocked.\nFor example, in WordPress, you can use Wordfence free plugin to allowlist legitimate IPs from the official lists (as above) and add blocking custom rules as below:\nThe allowlist rule is superior, and it will let legitimate crawlers pass through and block any impersonation request which comes from different IPs.\nHowever, please note that it is possible to spoof an IP address , and in that case, when bot user agent and IPs are spoofed, you won’t be able to block it.\nAI crawlers are now part of our web ecosystem, and the bots listed here represent the major AI platforms currently indexing the web, although this list is likely to grow.\nCheck your server logs regularly to see what’s actually hitting your site and make sure you inadvertently don’t block AI crawlers if visibility in AI search engines is important for your business. If you don’t want AI crawlers to access your content, block them via robots.txt using the user-agent name.\nWe’ll keep this list updated as new crawlers emerge and update existing ones, so we recommend you bookmark this URL, or revisit this article on a regular basis to keep your AI crawler list up to date."
  },
  {
    "url": "https://www.searchenginejournal.com/seo-pulse-google-updates-console-maps-ai-mode-flow/562591/",
    "title": "SEO Pulse: Google Updates Console, Maps & AI Mode Flow via @sejournal, @MattGSouthern",
    "date": "2025-12-05T11:18:13+00:00",
    "content": "Google packed a lot into this week, with Search Console picking up AI-powered configuration, Maps loosening its real-name rule for reviews, and a new test nudging more people from AI Overviews into AI Mode.\nGoogle introduced an experimental AI feature in Search Console that lets you describe the report you want and have the tool build it for you.\nThe feature, announced in a Google blog post , lives inside the Search results Performance report. You can type something like “compare clicks from UK versus France,” and the system will set filters, comparisons, and metrics to match what it thinks you mean.\nFor now, the feature is limited to Search results data, while Discover, News, and video reports still work the way they always have. Google says it’s starting with “a limited set of websites” and will expand access based on feedback.\nThe update is about configuration, not new metrics. It can help you set up a table, but it will not change how you sort or export data, and it does not add separate reporting for AI Overviews or AI Mode.\nIf you spend a lot of time rebuilding the same types of reports, this can save you some setup time. It’s easier to describe a comparison in one sentence than to remember which checkboxes and filters you used last month.\nThe tradeoff is that you still need to confirm what the AI actually did. When a view comes from a written request instead of a manual series of clicks, it’s easy for a small misinterpretation to slip through and show up in a deck or a client email.\nThis is not a replacement for understanding how your reports are put together. It also does nothing to answer a bigger question for SEO professionals about how much traffic is coming from Google’s AI surfaces.\nOn LinkedIn, independent SEO consultant Brodie Clark summed up the launch with:\n“Whoa, Google Search Console just rolled out another gem: a new AI-powered configuration to analyse your search traffic. The new feature is designed to reduce the effort it takes for you to select, filter, and compare your data.”\nHe then walks through how it can apply filters, set comparisons, and pick metrics for common tasks.\nUnder the official Search Central post , one commenter joked about the gap between configuration and data:\n“GSC: ‘Describe the dataview you want to see’ Me: ‘Show me how much traffic I receive from AI overviews and AI mode’ :’)”\nThe overall mood is that this is a genuine quality-of-life improvement, but many SEO professionals would still rather get first-class reporting for AI Overviews and AI Mode than another way to slice existing Search results data.\nRead our full coverage: Google Adds AI-Powered Configuration To Search Console\nGoogle Maps now lets people leave reviews under a custom display name and profile picture instead of their real Google Account name. The change rolled out globally and is documented in recent Google Maps updates .\nYou set this up in the Contributions section of your profile. Once you choose a display name and avatar, that identity appears on new reviews and can be applied to older ones if you edit them, while Google still ties everything back to a real account with a full activity history.\nThe change is more than cosmetic because review identity shapes how people interpret trust and intent when they scan a local business profile.\nReviews remain one of the strongest local ranking signals, based on Whitespark’s Local Search Ranking Factors survey . When names turn into nicknames, it shifts how business owners and customers read that feedback.\nFor local businesses, it becomes harder to recognize reviewers at a glance, review audits feel more manual because names are less useful, and owners may feel they have less visibility into who is talking about them, even though Google still sees the underlying accounts.\nIf you manage local clients, you will likely spend time explaining that this doesn’t make reviews truly anonymous, and that review solicitation and response strategies still matter.\nIn a LinkedIn post, Darren Shaw , founder of Whitespark, tried to calm some of the panic:\n“Hot take: Everyone is freaking out that anonymous Google reviews will cause a surge in fake review spam, but I don’t think so.”\nHe points out that anyone determined to leave fake reviews can already create throwaway accounts, and that:\nGoogle still sees device data, behavior patterns, and full contribution history. In his view, the bigger story is that this change lowers the barrier for honest feedback in “embarrassed consumer” categories like criminal defense, rehab, and therapy, where people do not want their real names in search results.\nThe comments add useful nuance. Curtis Boyd expects “an increase in both 5 star reviews for ‘embarrassed consumer industries’ and correspondingly – 1 star reviews, across all industries as google makes it easier to hide identity.”\nTaken together, the thread suggests you should watch for changes in review volume and rating mix, especially in sensitive verticals, without assuming this update alone will cause a sudden spike in spam.\nRead our full coverage: Google Maps Lets Users Post Reviews Using Nicknames\nGoogle is testing a new mobile flow that sends people straight from AI Overviews into AI Mode when they tap “Show more,” based on a post from Robby Stein , VP of Product for Google Search.\nIn the examples Google has shown, you see an AI Overview at the top of the results page. When you expand it, an “Ask anything” bar appears at the bottom, and typing into that bar opens AI Mode with your original query pulled into a chat thread.\nThe test is limited to mobile and to countries where AI Mode is already available, and Google hasn’t said how long it will run or when it might roll out more broadly.\nThis test blurs the line between AI Overviews as a SERP feature and AI Mode as a separate product. If it sticks, someone who sees your content cited in an Overview has a clear path to keep asking follow-up questions inside AI Mode instead of scrolling down to organic results.\nOn mobile, where this is running first, the effect is stronger because screen space is tight. A prominent “Ask anything” bar at the bottom of the screen gives people an obvious option that doesn’t involve hunting for blue links underneath ads, shopping units, and other features.\nIf your pages show up in AI Overviews today, it’s worth watching mobile traffic and AI-related impressions so you have before-and-after data if this behavior expands.\nIn a widely shared LinkedIn post, Lily Ray , VP of SEO Strategy & Research at Amsive, wrote:\n“Google announced today that they’ll be testing a new way for users to click directly into AI Mode via AI Overviews.”\nShe notes that many people will likely expect “Show more” to lead back to traditional results, not into a chat interface, and ties the test to the broader state of the results page, arguing that ads and new sponsored treatments are making it harder to find organic listings.\n“Compared to the current chaotic state of Google’s search results, AI Mode feels frictionless.”\nHer view is that Google is making traditional search more cluttered while giving AI Mode a cleaner, easier experience.\nOther SEO professionals in the comments give concrete examples. One notes that “the well hidden sponsored ads have gotten completely out of control lately,” describing a number one organic result that sits below “5–6 sponsored ads.” Another says they have “been working with SEO since 2007” and only recently had to pause before clicking on a result because they were not sure whether it was organic or an ad.\nThere’s also frustration with AI Mode’s limits. One commenter describes how the context window “just suddenly refreshes and forgets everything after about 10 prompts/turns,” which makes longer research sessions difficult even as the entry point gets smoother.\nOverall, the thread reads as a warning that AI Mode may feel cleaner but also keeps people on Google, and that this test is one more step in nudging searchers toward that experience.\nRead our full coverage: Google Connects AI Overviews To AI Mode On Mobile\nAll three updates are pulling in the same direction: More of the search journey happens inside Google’s own interfaces.\nSearch Console’s AI configuration keeps you in the Performance report longer by taking some of the work out of report setup. Maps nicknames make it easier for people to speak freely, but on a platform where Google defines how identity is presented. The AI Overviews to AI Mode test turns follow-up questions into a chat that runs on Google’s terms rather than yours.\nThere are real usability wins in all of this, but also fewer clear moments where a searcher is nudged off Google and onto your site.\nIf you want to dig deeper into this week’s stories, you can read:"
  }
]