[
  {
    "url": "https://www.searchenginejournal.com/seo-pulse-chatgpt-gets-shopping-what-drives-ai-citations/562095/",
    "title": "SEO Pulse: ChatGPT Gets Shopping & What Drives AI Citations via @sejournal, @MattGSouthern",
    "date": "2025-11-28T15:15:22+00:00",
    "content": "Welcome to the week’s Pulse: updates affect how product discovery works, what drives visibility in ChatGPT, and how background assets impact Core Web Vitals.\nOpenAI launched shopping research in ChatGPT, SE Ranking published the largest study yet on ChatGPT citation factors, and Google’s John Mueller clarified that background video loading won’t hurt SEO if content loads first.\nOpenAI rolled out shopping research in ChatGPT on November 24, making personalized buyer’s guides available to all logged-in users across Free, Go, Plus, and Pro plans.\nThe feature works differently from standard ChatGPT responses. Users describe what they need, answer clarifying questions about budget and preferences, and receive a detailed buyer’s guide after a few minutes of research.\nKey Facts : Powered by GPT-5 mini. Nearly unlimited usage through the holidays. Merchants can request inclusion through OpenAI’s allowlisting process.\nShopping research pulls more of the product comparison journey inside ChatGPT before users click through to merchant sites. This changes where product discovery happens in the funnel.\nTraditional search sent users to comparison sites, retailer pages, and review platforms to build their own shortlist. Shopping research does that work inside the chat interface, asking clarifying questions and surfacing product recommendations based on constraints like budget, features, and intended use.\nCrystal Carter, Head of AI Search & SEO Communications at Wix, highlighted the personalization implications in a LinkedIn post :\nMake sure your brand affinities, and communities are clearly stated on YOUR website, in your support documentations, FAQs, and make moves to get it cited on other websites, because for some customers, these considerations are make or break, and they will build it into their models.\nHer testing showed ChatGPT delivering different restaurant recommendations to users with different profile preferences, pulling from Google Business Profiles and other sources to match stated affinities.\nFor retailers and affiliate publishers, visibility now depends partly on how products and pages appear in OpenAI’s shopping system. The allowlisting process means merchants need to opt in rather than relying solely on organic crawling.\nRead our full coverage: ChatGPT Adds Shopping Research For Product Discovery\nSE Ranking analyzed 129,000 unique domains across 216,524 pages in 20 niches to identify which factors correlate with ChatGPT citations.\nReferring domains ranked as the single strongest predictor. Sites with up to 2,500 referring domains averaged 1.6 to 1.8 citations, while those with over 350,000 referring domains averaged 8.4 citations.\nKey Facts: Domain traffic matters only above 190,000 monthly visitors. Content over 2,900 words averaged 5.1 citations versus 3.2 for articles under 800 words. Pages with 19 or more data points averaged 5.4 citations.\nThe study suggests that traditional SEO fundamentals still align with AI citation likelihood, but the thresholds matter more than gradual improvements. A site with 20,000 monthly visitors performs similarly to one with 200 monthly visitors, but crossing 190,000 visitors doubles citation rates.\nThis creates different optimization priorities than traditional search. Building from zero to moderate traffic won’t improve ChatGPT visibility, but scaling from moderate to high traffic will. The same pattern holds for referring domains, where the jump happens at 32,000 domains.\nManidurga BLL, an IT student analyzing the research, broke down the implications in a LinkedIn post with video :\nThe AI revolution isn’t just changing how we search. It’s rewriting the entire playbook for digital authority. For us tech students and future developers, this means rethinking content strategy from day one. Building domain authority isn’t just about Google anymore. It’s about teaching AI systems to trust and cite your work.\nThe post includes a detailed video walkthrough of the study findings, highlighting that heavy Quora and Reddit presence correlates with 7 to 8 citations, while review platform listings average 4 to 6 citations.\nThe research also found that .gov and .edu domains don’t automatically outperform commercial sites despite common assumptions. What matters is content quality and domain authority, not domain extension.\nRead our full coverage: New Data Reveals The Top 20 Factors Influencing ChatGPT Citations\nGoogle Search Advocate John Mueller says large video files loading in the background are unlikely to have a noticeable SEO impact if page content loads first.\nA site owner on Reddit asked whether a 100MB video would hurt SEO if the page prioritizes loading a hero image and content before the video continues loading in the background. Mueller responded that he doesn’t expect a noticeable SEO effect.\nKey Facts : Using preload=”none” on video elements prevents browsers from downloading video data until needed. Core Web Vitals metrics should verify implementation meets performance thresholds.\nThe question addresses a common concern for sites using large hero videos or animated backgrounds. Site owners have avoided background video because of performance worries, but Mueller’s guidance clarifies that proper implementation won’t create SEO problems.\nThe key is load sequencing. If a page shows its hero image, text, and navigation immediately while a 100MB video loads in the background, users get a fast experience and search engines see content quickly.\nThe Reddit thread included debate about the guidance, with one commenter noting Mueller’s response contradicts concerns about network contention competing with critical resources. WebLinkr, an r/SEO moderator, defended Mueller’s position and noted web developers sometimes overstretch the impact of page speed factors on SEO.\nThis changes the calculation for sites considering background video. The decision now focuses on user experience and bandwidth costs rather than SEO penalties.\nTechnical implementation still matters. Using preload=”none” on video elements prevents the browser from downloading video data speculatively, saving bandwidth for users who never play the video.\nRead our full coverage: Mueller: Background Video Loading Unlikely To Affect SEO\nEach story this week shows discovery happening earlier in the journey.\nChatGPT shopping research handles product comparison before users reach merchant sites. The SE Ranking study reveals what builds citation authority at scale rather than incremental gains. Mueller’s video guidance removes a technical barrier that kept sites from using rich media.\nTaken together, this week is about where decisions really form, before anyone ever types a query into Google."
  },
  {
    "url": "https://www.searchenginejournal.com/the-impact-ai-is-having-on-the-marketing-ecosystem/562027/",
    "title": "The Impact AI Is Having On The Marketing Ecosystem",
    "date": "2025-11-28T14:30:20+00:00",
    "content": "I’m not someone who’s drunk much of the AI Kool Aid. I have sipped it. Swilled it around my mouth like you would an 1869 Château Lafite Rothschild.\nBut I’ve seen enough cult documentaries to know you should spit it back into the glass.\nDo I love the opportunities it’s provided me in a work sense? Absolutely. Do I think it’s fundamentally shifted the marketing ecosystem? No. I think it’s expedited what’s been happening for some time.\nLLMs provide a good proxy as to how you’re seen online. And they really lean into review platforms and strong brands . Associating your brand with your core topics, removing ambiguity, and strengthening your product positioning is never a bad thing.\nIt’s not just about search anymore. In reality, it never should have been. It’s about connecting. Generating value from the different types of media .\nTrue. But it’s been changing for a long time. Paid channels are becoming more expensive, owned channels like search send fewer clicks (mainly a Google-driven mechanic), and earned channels are looking more like the golden ticket to corporate stooges.\nThe majority of brands use last click attribution (gross, get away from me). A method that overvalues search. For the last decade or more, there have been discovery platforms that are more valuable than search – TikTok, YouTube, Instagram. Pick one.\nWe tend to use search for finding products, brands, or stories we know exist. And for comparison, related searches. But as AI Mode rolls ever closer and Google looks to greedily take on middle of the funnel queries, Google’s role as a discovery platform will change. Theoretically, at least.\nLike every big tech company, enough is never enough, and they don’t want to send you clicks . Unless you pay for them, of course.\nThe Rise at Seven SEO and Data teams analysed 1.5 billion searches across five channels of the most-searched keywords on the internet and found that:\nBut Google isn’t really a discovery platform. Maybe a bit. Google Shopping. Some comparison searches. But it’s not what anyone is there for.\nSomeone sees a product on Instagram or TikTok. They read a review of it on Reddit (probably through Google, albeit with a branded search) and watch videos of it on TikTok or YouTube.\nThey might even buy direct or via Amazon. At best, they perform a branded search in Google.\nI think it’s worth noting here that so many of these other platforms are driven by a clickless algorithm. Google requires a click. A fundamental search. The others have homepages that stare directly into your soul.\nI don’t think any of this is new. And I suspect it’s been a while since search was a single platform journey. But it depends on what you define as search, I suppose.\nGoogle’s Messy Middle is about right. We have been living through an era of marketing desperately tied to trying to track every penny. Something that has been a near-impossible job for some time. At some point, you just have to sit down, try to know your audience better than anyone else, and have at it.\nWe need to influence clicks via search before that happens. Brands have to focus their time on the right channels for their audience. Not just search. That’s why knowing your audience and using an attribution model that doesn’t just value the BOFU click matters.\nProbably a bit. Behavior has been changing long before LLMs hit the public arena. It’s changed because people have better options. More visually decisive. More authentic. The creator economy has boomed because people trust people.\nA lot of this ends with a Google search. Maybe all of it. Google is a navigational engine . Hence, the last click attribution issue. I suspect the last click isn’t the most important session in the majority of cases.\nUnless you’re young, lazy, or both, AI just won’t cut the mustard. Hell, Google’s kingpin tells you not to blindly trust AI . Even the guys fundamentally selling us this stuff are telling us it has some pretty serious flaws.\nIt’s one of the reasons user journeys are so much more complex and elongated.\nCutting through the noise is everything. For people and brands. So you have to learn how to build brands and products that are bold and get the right people talking and sharing.\n90% of marketers say creator content yields stronger engagement and 83% link it to more conversions. And 61% of consumers trust recommendations from creators more than they trust brand advertising.\nThings don’t happen in a silo. Call me old-fashioned, but I think we’d all do well to work together as a marketing department. AIOs don’t just affect search. They have a knock-on effect on the entire ecosystem, and it’s important we understand the what and the why.\nWhere do we start? I’ll try and be brief. The most obvious and direct threat is zero-click search , which has been on the rise for some time. While AI hasn’t been the key driver of this, it has and will continue to reduce referral traffic.\nI think AI has done some very interesting things in the SEO space. Vibe engineering platforms like Cursor and prototyping platforms like Lovable have opened up new worlds.\nIf you can wade through the shit, you can do some brilliant things.\nThen you have Profound’s Zero Click conference, where one of the speakers said he felt sorry for anyone working in SEO . According to this turdy savant, there’s very little crossover between SEO and insert favorite acronym before proceeding to discuss lots of SEO ideas from 2012.\nPeople who just do not understand marketing, SEO, the internet, or people. These are the guys driving the enshittification of our day-to-day lives. (More on this later).\nPPC and SEO are ugly cousins, really. We operate in the same space, we target the same traffic. So it stands to reason that AIOs and AI Mode significantly impact paid search.\nThanks to Seer Interactive, we have near-conclusive data that proves how serious this impact has been . When an AIO is present, and you are not cited, clicks are down over 78%.\nEven when there’s no AIO present, paid clicks are down 20%. This is disastrous. Customer acquisition becomes more expensive, and the blended CPAs are significantly more expensive.\nThis may show a real and significant shift in user behavior . Users are becoming so used to getting what they want from a TOFU search, they don’t even follow up when an AIO isn’t present.\nWe’ve seen the rapid rise of disinformation in search. Google’s been promoting fake content to millions of people on Discover and has been struggling to block them for some time . Gaming the system isn’t new. PBNs, expired domain abuse , link schemes. You name it, it’s working.\nThankfully, the Vote Leave Take Control team have put their talents to good use and can now tell me what casino site should I choose.\nThe scale is unprecedented. Bullshit flies everywhere.\nAnd that’s where social comes in. Globally, the average person spends 2 hours and 24 minutes on social media every day . That’s a lot of time to be hit by fake news. Personalized fake news, too. So maybe it’s not a surprise that social use has been on the decline for the last couple of years.\nAccording to this study by the FT, social media use has decreased by 10% and has been driven by (*shakes fist*) the youth. I think these platforms are a shell of what they once were. The connections they provided have been replaced by absolute bullshit.\nThey will do literally anything to get and hold your attention. Except help you stay in touch with people or watch something that isn’t AI-generated. The content quality bell curve we see in search is mirrored by the enshittification of social channels .\nPeople with no understanding of marketing or people thinking that auto-generated comments will boost their profile on LinkedIn. Businesses using AI to cut corners to generate meaningless bullshit and throwing it at me. See Coca Cola advert for reference.\nNothing says happy holidays like being fired for an incompetent robot.\nThe lights are on, the wheels are turning, but nobody is home. Or cares. The Mark Zuckerburgs of the world are, hopefully, turning people off hyper addictive brain rot.\nAs email is an owned channel, there’s not an obvious issue with generative AI. However, the Litmus State of Email Report shows the top roadblocks and operational challenges encountered by teams.\nAI makes all of these roadblocks worse. Crummy, personality-devoid content churned out at scale will lower engagement. And it doesn’t take a genius to figure out that execs would love to save on personnel.\nOperationally, you’d think AI will help. But if producing high-quality content at scale and improving your core benchmarks are fundamental issues, I’m not sure AI is the answer.\nPersonalization, research, and distribution. Absolutely. Creating content that draws real people in and engages with them. Color me sceptical.\nThis is all about the funnel. If it becomes more expensive to acquire customers in their unaware/aware phase with paid campaigns, your owned and earned channels need to work harder. They need to work harder to increase your conversion rate.\nAs an SEO and a marketer, you should focus on creating real connections with people. Understanding your audience. Leveraging people that have influence over your audience. Build, work with, and promote brilliant creators and own your audience data internally.\nSqueeze every last drop out of your content. Cut and share it in appropriate formats across multiple channels.\nEmail is almost certainly the most applicable channel for most brands. You actually own it. Then figure out the role your brand plays in that journey. Create a great user experience on and off-site. Make sure it’s well documented, and you own everything in your control. Speak to your PPC and social teams to understand the challenges they’re having.\nThis isn’t just about marketing. Or LLMs. They are just a good proxy for how you are seen on the internet.\nIt’s about working together as a marketing department with a shared goal of creating and amplifying brilliant experiences to the right people. Maximising the value of your owned channels, to reduce the reliance on paid, and doing things that create brand advocates and cause your earned media to soar.\nBut whatever you do, don’t forget about good quality SEO. It’s the primary purpose of our job and it still works.\nThis post was originally published on Leadership in SEO ."
  }
]