[
  {
    "url": "https://blog.hubspot.com/marketing/2025s-lingering-questions",
    "title": "2025's Lingering Questions",
    "date": "2025-12-10T09:30:04+00:00",
    "content": "Lingering Questions is one of my favorite parts of the Masters in Marketing newsletter, because it’s an opportunity for marketers to talk directly to one another.\nThis year, a few clear themes emerged: yes, AI can help you be a better and more efficient marketer, but human connection is more important than ever ; authenticity, even if it means you’re a bit unpolished, is preferable to perfection; and consumers across all industries are hungry for community .\nWe’ve rounded up all the questions marketers asked each other in the last 12 months:\n“What warm memory comes to mind when you hear these three words: creative, curious, courageous?”\n\"I've spent the last year focused on building meaningful relationships on LinkedIn — sharing personal and professional experiences to create genuine connections. Each of these words have shaped this journey: staying curious about what my audience cares about and wants to learn from me, experimenting with creative ways to share my experience and engage with others, and embracing the courage it took to get started and be vulnerable.\n\"As the CEO of a social company, I recognize the transformative power of social media. It drives pipeline, builds connections, and ensures your voice shapes conversations that are happening with or without you. But what's even more powerful is the impact the relationships built through social can have outside of the digital world.\n\"A memory that stands out is the first ‘IRL’ dinner I had with a marketing leader I connected with on LinkedIn, after months of engaging with each other‘s content. What started as a digital connection has since grown into a genuine friendship (and many double dates with our husbands!) — and it’s all thanks to social.\n“To any marketers reading this that may be hesitant to get started, let this be your sign: Make the leap into posting. You don't know what new friendships you may be missing out on.”\nRead more: Gen Z is turning this CEO’s business model upside down\nNovoselsky asked , “How do you approach your personal brand on social media? Has social created meaningful opportunities or opened doors for you professionally and personally?”\n\"I approach the personal brand piece by trying to be exactly how I am in person. I don't know how to do anything else.\n“And yes, it has opened infinite doors, not least of which is the opportunity to talk with [Masters in Marketing]!”\nRead more: Chubbies’ co-founder warns: Don’t get hooked on the performance marketing drug\nRutherford asked , “What is your favorite movie that you're embarrassed for anyone to know about?”\nGaynor: Eurovision Song Contest: The Story of Fire Saga\nRead more: Beyond the Golden Arches: How two McDonald’s marketers win Gen Z\nEngel and Gaynor asked , “What brand do you think is taking bold risks to connect with Gen Z today?”\n\"Party At Anna‘s is a company pushing boundaries by creating interactive and immersive experiences that resonate with Gen Z’s love for storytelling and social engagement.\n“Their projects take bold risks by incorporating real-time audience participation, unconventional venues, and dynamic, unpredictable narratives. By embracing themes of identity, community, and collective storytelling, they craft highly shareable and deeply personal experiences that redefine what theatre can be for a new generation.”\nRead more: Consultant behind Meow Wolf, Blue Man Group shares lessons on joy, playing, and branded experiences\nWirth asked , “What is a blind spot in the marketing world that, if addressed, would make people's lives better?”\n“A major blind spot in the marketing world is forgetting that most people aren't as aware of your brand as you are. Many brands use messaging that already assumes people know who you are or what you offer. Make sure you're clear about what your product or service is going to do to help people. Witty and eye-catching is fun, but the conversion is in solving people's problems.”\nMunn asked , “What's a career you've always wanted to get into but never have?”\n“Honestly, I always wanted to do what I'm doing today! No other careers I would want to have!”\nRead more: Be a knockout in small and local business marketing\nWaters asked , “What's one marketing mechanism that will generate the most revenue quickly for a startup?”\n\"I know it‘s annoying to say ’it depends,' but my recommendation for quick revenue growth would likely vary depending on the startup.\n\"For example, paid social is likely to be a cost-efficient and impactful choice for a budget-friendly DTC skincare brand targeted towards Gen Z. (There's a reason that paid social is the first and only paid media that many brands invest in!)\n\"Promo codes, rebates, and couponing can be an important add-on to said campaign, as these tactics provide an extra incentive for conversion and you can use redemption as a KPI.\n“No matter the business model, my most important 'do this before anything else' recommendation would be to spend time on your consumer target, positioning, and brand identity development so that you are targeting the right people in the right place with the right messaging and creative. It won't drive revenue in the short term, but it will save you money and drive revenue in the long run.”\nRead more: How this small startup outperformed a stalling industry\nQuinn asked , “What's the most memorable advertisement (commercial, print ad, OOH, anything!) you can remember seeing, and why do you think it has stuck with you?”\n“The OG Dollar Shave Club ‘Our Blades Are F*cking Great’ commercial.\nThat spot hits on everything I look for in a good ad:\nThe spot drove 27 million YouTube views on a budget of $4,500, and I believe is a big reason why DSC ultimately sold for $1 billion to Unilever.”\nRead more: Morning Brew’s co-founder on the three channels that will win 2025 (plus, how to craft a voice that stands out)\nLieberman asked , “What are your thoughts on the ongoing 'attribution' hoopla? And what's the right amount of attribution without getting overly scientific/metrics-focused with your marketing strategy?”\n\"When you‘re building a new brand from the ground-up, you don’t have historical data to look at as you evaluate performance. We‘re doing everything that we can to combine a mix of more tactical metrics (i.e., sales of our products across channels as we invest in various marketing tactics, how quickly we are growing our community and how engaged they are with the information we’re sharing with them, and of course monitoring sentiment around everything that we say and do).\n“The best thing brands can do right now is to operate with a connected strategy and look at every moment as an opportunity to be 360 – and truly analyze your results in the same way.”\nRead more: Be an addition, not a substitution: Lessons from Tom Holland’s NA beer brand\nWidmann asked , “Right now, it feels like so many brands are investing in beautifully produced, curated, experiential moments that are intended to drive awareness and shareability (and likely very expensive). How do you think new brands with limited budgets should approach this tactic and still manage to cut through the clutter?”\n\"In my experience, the highly produced moments matter at certain moments, like when customers consider a purchase, but what often catches their attention is the highly authentic, unpolished moment.\n“That's why influencer marketing works. So, as a brand with a limited budget, I'd focus my budget on a few well-produced marketing assets (like videos of product images) and the rest on authentic, raw moments that build trust and curiosity.”\nRead more: Reddit’s growth advisor on finding your vertical-specific SEO strategy\nIndig asked , “What's the most underrated marketing channel right now, and why do you think it deserves more attention?”\n\"For me, the current most underrated marketing channel is direct mail. A well-designed print piece can break through the clutter and make an impact.\n\"People save postcards from favorite non-profits that capture a mission moment, connecting them to the cause. They earmark pages in a well-designed catalog of products they covet and are incentivized to purchase with direct mail pieces that feel curated and personal.\n“Pro Tip: Mail isn't dead — ask Gen Z. According to a USPS survey, 72% of digital natives get excited about good old-fashioned mail. Give them something to hold on to.”\nRead more: Brand-building brilliance from Best Buddies\nLozelle asked , “As a marketing thought leader, how do you see AI influencing strategic thinking and the creative process in brand building?”\n\"AI is effective as a thought partner. Ask it to poke holes in your strategy and play devil‘s advocate. Also ask it to find additional research and data points you haven’t considered. Those workflows can make your original ideas even stronger.\n\"All of that being said, I believe human creativity is more critical than ever, and I love seeing human fingerprints on the content I personally consume. For instance, I've recently been swooning over all the tiny creative details in Severance.\n“I believe some AI-related changes in marketing will happen faster than we expect, and others will happen more slowly. Only time will tell what falls into which category. So I'm leaning into AI where it's useful for me, and not forcing it where it doesn't seem helpful.”\nRead more: How Heike Young uses humor to transform B2B marketing\nYoung asked , “What's a piece of marketing advice you would have given earlier in your career, but you would no longer give, due to how marketing has changed?”\n\"Early in my career, I would have advised marketers to spend time focusing on a unique brand and really investing in what you could do to deliver a remarkable customer experience.\n\"It‘s not that remarkable experiences and strong brands aren’t needed, but I find spending too much time there — especially up front — prevents brands from showing up consistently. Today's world and consumers move fast — and quite frankly, consumers will be the ones that guide you on what makes a remarkable experience.\n\"So, it‘s more important now to show up and let your voice, point of view, and what you stand for be known. Refine your experience over time, based on feedback from your customers and the community you build. That community and the trust they need to have with you is hard to build if you don’t show up consistently. Don't fall into the trap of analysis paralysis.\n“This isn't a case for delivering poor quality, but rather a case for brands and marketers to do a better job of being active shapers and participants of culture as it is happening. Be relevant and remarkable to consumers in a way that is most valued and relevant to them. Your marketing and impact will be much more effective as a result.”\nRead more: Main character energy: What Black Panther can teach you about inclusive marketing\nThompson asked , “How have you seen inclusion shape the way marketing has been done over the last five years, and how do you feel it will shape (if at all) the next five years of marketing?”\n\"Over the past five years, inclusion has shifted from a corporate checkbox to an essential part of how we approach marketing and business overall (or at least, it should be!).\n\"It‘s no longer just about who appears in stock photos; it’s about who's developing the strategy, writing the copy, and making the decisions.\n\"In our own work, from virtual events to newsletters to agency services, we've seen that when people feel seen, they engage more, share more, and stay loyal longer.\n“Looking ahead, inclusion won't just shape marketing, it will be marketing. As AI continues to dominate content creation, the ability to add a human touch, making every person feel recognized, respected, and understood will be the ultimate differentiator.”\nRead more: Attribution is garbage, says this email expert. (Plus, 3 reasons Jay’s a loser)\nSchwedelson asked , “What's one marketing belief you held five years ago that you've completely changed your mind about?”\n\"That in-person events would become less important. 100% wrong. In-person events are more important than ever.\n“Humans are social animals and will always congregate. No matter what comes with AI, I do not believe the human species will throw in the towel on congregation.”\nRead more: The growth hack era is ending, according to Digiday’s former editor-in-chief\nMorrissey asked , “Will SEO be obsolete in three to five years?”\n\"Traditional, organic SEO has always been a challenge — it required constant research and maintenance with no guaranteed returns, not to mention being beholden to an algorithm that could tank your strategy at any moment.\n\"AI Overviews and zero-click search have made it 10 times harder to drive organic traffic, and in three to five years, there will be no reason for anyone to ever scroll through pages of results to find themselves on a company-sponsored blog post reading a long-winded, H2-clad overview of an industry topic — and I say this as a long-time content marketer.\n\"I think about how my own information-seeking behavior has completely changed over the last year with AI, from finding quick answers and technical troubleshooting at work to making recipes and getting TV/movie recommendations at home.\n\"I don‘t have a technical background but I get a daily behind-the-scenes look at the AI product the Quora team is building (it’s called Poe, and it's a central place to access every AI model and create your own customized bots). The biggest shock has been how quickly new models and capabilities roll out — announcements and launches almost daily.\n\"I think marketers — probably especially B2B marketers — are hyper aware of AI‘s capabilities and its impact on SEO, among other aspects of marketing, but it won’t be long before the general public catches up and becomes accustomed to the deeply personalized experiences possible through AI.\n\"Soon everyone will gravitate to their preferred method of finding and consuming information, whether it's scanning an AI Overview, messaging a chat app (which can already do so much more than chat), conversing out loud with AI, or referencing a handful of trusted sources.\n\"In three to five years I think we'll be far away from scrolling through SERPs and much closer to a Her [the 2013 sci-fi movie in which a man falls in love with his AI] situation.\"\nDolan asked , “Besides AI, what marketing trends or technologies are you keeping your eye on or planning to try this year?”\n\"I'm paying close attention to how data storytelling is evolving, especially as trust in traditional marketing claims continues to erode.\n\"The brands standing out right now aren‘t just publishing content — they’re showing receipts. Customer impact. Product usage. Transparent benchmarks. As social algorithms continue to reward who is getting the most attention, credibility is the new currency.\n\"But here‘s the thing: credibility can’t just be manufactured and isn't all about numbers. It needs to be earned in creative, human ways, so you need to rely on real voices.\n\"That‘s why I’m excited about creator-led and community-first B2B marketing — tapping into your power users, internal experts, and community members to share the story in their own words. We're moving away from polished brand narratives and toward trusted individuals who bring both expertise and authenticity.\n“It's not about saying more, it's about being believed.”\nRead more: Turn your power users into creators (and vice versa)\nParkes asked , “What's one 'boring' marketing channel or tactic that's working way better than expected for you right now, and why do you think that is?”\n“Weekend email sends! Email campaigns targeting director-level and above contacts are generating a 40% year over year increase in click-through rates. Not testing Sunday sends is leaving a super valuable opportunity to engage with key people when they have the time to really dig into what you are sharing.”\nRead more: What you’re doing wrong in your marketing emails (according to an email expert)\nSchwedelson asked , “You always say 'create once, distribute forever' — what's one piece of content you've milked longer than anyone should reasonably admit? And why that one?”\n\"One piece of content I‘ve absolutely milked? A tweet I wrote in 2019 simply said ’Create Once, Distribute Forever‘ and it was a hit… It wasn’t even meant to be a flagship idea back then… Just a brain dump about repurposing strategy. But I kept referencing it in talks, turning it into a slide, a workshop, a tweet thread, the title of my book, a core framework for Foundation.\n“Why that one? Because the concept resonated deeply not just with marketers, but with entrepreneurs, creators, and executives who realized they were sitting on gold without mining it. It gave people permission to stop chasing new and start maximizing what they already had. That message stuck, and I've been doubling down ever since.”\nRead more: Trash AI content, experimental budgets, and TikTok for B2B: Ross Simmonds unfiltered\nSimmonds asked , “What's one marketing hill you'll die on… Even if the data or the trends say otherwise?”\n\"It‘s not about how big you are, it’s about how connected your audience feels.\n\"Buying followers is worse for your credibility than a small organic following. Avoiding events because they cost money robs you of essential customer interaction. Organic content and brand storytelling are what make conversion content work. I see so many brands get caught up in chasing an immediate conversion to scale as fast as possible.\n“To get big you have to get connected to an audience that will champion your growth, and that takes soft skills.”\nRead more: Make space for customers to see their business as part of yours\nWells asked , “What's one thing you learned in your first-ever job that remains core to the businessperson you are today?”\n“I learned that most people give 80% to their work and some give 100%. If you give 110%, you'll be the best.”\nRead more: 239% growth from… print mail?! Why you shouldn’t sleep on direct mail\nGendusa asked , “What's one marketing strategy you think will be obsolete in five years?”\n\"We‘re already seeing AI can generate ’good‘ content on demand (just spend 5 minutes on LinkedIn). What breaks through won’t be quality alone but distribution strategy, speed of iteration, strategic positioning and relevance. Your brilliant thought leadership won‘t matter if your buyer’s AI skips it for something faster, easier, or more emotionally compelling.\n“Marketers’ jobs will revolve less around creating and more around matchmaking.”\nGrossman asked , “What's a trend everyone's excited about that you think is overhyped or completely misunderstood?”\n“Unless there is a very obvious use case, I feel that this is a lazy implementation of AI. Most companies need to think much harder about their users' pain points before just slapping a chatbot onto their UI.”\nRead more: Memorable marketing, visible mistakes, and a faster horse\nLoury asked , “What is your favorite thing about marketing that can't be easily measured?”\n\"The emotional connection. I love the way marketing can make people feel something. It could be inspiration, motivation, curiosity, nostalgia, or just a moment of joy. For us it comes down to self-acceptance and belonging. That connection drives everything we do, no matter how impossible it is to quantify (although I'm sure AI is trying).\n“Helping even one person in our community feel seen and comfortable in their skin—I love so much about my work, but that's really what gives it all meaning.”\nRead more: Rare Beauty’s “anonymous insider” spills the tea on their new Substack\nKassab asked , “What's your least favorite part of your job, and how do you motivate yourself to get through it?”\n\"My least favorite part of the job is the constant need for growth and more content. Whenever a video drops, YouTube gives me a ranking of how the video is performing in comparison with the last 10 videos. If it‘s a 1 out of 10, it’s a good day; if it‘s a 10 out of 10, my whole day is spent asking why people didn’t like it as much.\n“The best way to motivate myself through that is remembering that I get to do what I love for a living — even on the tough days, that perspective keeps me going.\"\nRead more: Tasting marketing: What a viral YouTube star wishes marketers knew\nMiller asked , “Have you found AI making an impact on your work at Condé Nast? If so, has it been a net positive or net negative? In many ways, the proliferation of AI content is making creating quality content, especially educational content, more difficult so I'm always curious how this new technology is affecting other fields.”\n\"From a marketing and subscription standpoint, we're excited to explore how AI can help us deliver more dynamic, personalized experiences on our sites. That said, the human touch is still the heart of our strategy, especially when it comes to brand voice and creative direction.\n\"The rise of AI-generated content has actually made high-quality, thoughtful content even more valuable. It's easier than ever to pump out content, but much harder to build trust, credibility, and originality.\n“At Condé Nast, our unique edge is still our storytelling and editorial integrity. AI, to us, is a tool to scale our voices around that, not replace it. So overall, I'd say it can be a net positive when used with intention. But like anything, it depends on how thoughtfully it's integrated.”\nRead more: Condé Nast marketing leader shares her framework for destroying your imposter syndrome\nHakimian asked , “You've built an incredible reputation for understanding Gen Z behavior and creating authentic, community-first content. In a world that's constantly chasing virality, how do you balance consistency with creativity, and what advice would you give to brands trying to build genuine relationships over time, not JUST reach?”\n\"Remember that there‘s a difference between consistency and cadence. Oftentimes I feel, especially as it relates to building community on social, that there’s this mentality that the more content you pump out, the more you engage with people — and the more beneficial it is for your brand. And I disagree.\n\"I think what people are looking for is a sense of comfort, a sense of home, a sense of familiarity. And that‘s what you can accomplish through consistency. Consistency is less about how much and how often you’re putting content out and more about the feelings that your audience will associate with your brand.\n\"So it could literally be something as simple as the style and the tone in which you communicate or create your content. It could be the visuals you use. It can be how you greet your audience when you post — those are the things that really build community.\n“Think of it as like a relationship. You're not in a relationship with someone just because of the amount of things that they do for you, it's how they do it for you. That's the same way it should be for your community as it relates to brands.”\nRead more: Marketing without the cringe: Jayde Powell on Gen Z audiences\n\"Professionally, when you take a bet on something and it works.\n“Personally, being with family, friends, working out, and reading books.”\nRead more: Don’t just grow to grow: Real talk from a serial founder\nAtkinson asked , “If you could only invest in one tool to help your company grow for the next three years, what tool would it be?”\n“Email deliverability is a land of best practices. Do's and don'ts that we collectively tell people to stick to, but we can potentially become too complacent to stay within our lane, not challenge the status quo of how best to do something, whether it be connect with our audience or market a new product.”\nRead more: Here’s why your next newsletter isn’t going to spam\nIverson asked , “What's one email-sending habit or best practice you think we should collectively leave behind, and what would you replace it with?”\n\"Relying solely on last-click attribution for measuring the success of influencer marketing is a mistake. Sure, tracking links and promo codes show direct sales, but creators play a much bigger role in awareness, brand building, consideration, traffic, and more, all of which leads to purchases down the line, even if the link or code isn't used.\n“We need to measure the impact of creators more creatively and look at the full picture, including content performance, website traffic, brand follower growth, search lift, share of voice, brand and sales lift studies, post-campaign surveys, and other methods to capture the true impact of influencer campaigns, otherwise you're likely missing a ton.”\nRead more: Why creator marketing works for any business\nGamble asked , “What's a marketing strategy or trend that you think is widely overlooked but has high potential for impact right now?”\n“One strategy I think is often overlooked is using social media to drive exclusive offers directly within the community you've already built. For example, teasing a promotion through Instagram Close Friends can give you a sense of traction before launch. Tools like ManyChat also make it easy to create DM-only offers that feel special and personal.”\nSmithwrick asked , “What's a creative hot take that will make a marketer second guess how they work with creatives?”\n\"In my experience, the business side (i.e. product strategists, sales and marketing managers) bring in Creative too late...often treating creative as the shiny gift wrap around the product strategy—but in reality, the creative is the product strategy.\n\"If you involve us only at the end, you‘re not getting design, you’re just getting decoration. Every time you hand us a baked plan and ask us to ‘make it pop,’ you've already cut the legs out from under what could have been a more powerful marketing campaign.\n“Let creatives lead earlier! I always encourage working in groups: have early holistic campaign development conversations with key stakeholders from media, strategy, product, and creative. The future of marketing is all about experiences where creative execution is indistinguishable from brand strategy. If you still think of Creative as just a service department, you're already behind.”\nRead more: Why creative teams need the safety to fail, according to a senior director for Magic: The Gathering\nMickes asked , “As marketing shifts from communication and storytelling to creating authentic cultural experiences, how are you or your company rethinking the role of Creative?”\n\"At Clutch, we‘re making sure every content piece is supported by creative that feels rooted in real-life experiences. That means weaving in authentic perspectives from influencers and providers we quote, so the stories aren’t just polished narratives, they‘re reflections of what’s actually happening in the market.\n“Most recently, we've been testing more video content that's intentionally lighter-touch rather than investing in big, glossy productions. We're seeing that people consistently choose authenticity over stiffness. They want to hear directly from trusted experts in a way that feels conversational and relatable. For us, creative's role is to amplify real voices and experiences, not manufacture them.”\nRead more: Why you should build relationships backward (and how)\nLaxsav asked , “When it comes to building partnerships for CultureCon, how do you decide which people to collaborate with — whether that's speakers, creators, or community leaders — to make sure they authentically represent CultureCon's mission and resonate with your audience?”\n\"At CultureCon, data is paramount to everything we do. So, we‘re not making assumptions about our audience, we’re not just coming up with ideas. We're really letting that [data] inform everything that you see.\n\"So, the programming that you see being hyper-relevant? Our communities told us what they wanted, the brands that they like to engage with, the speakers they wanted to hear from, and we listened to them.\n“I think a lot of brands and communities are sometimes trying to go against the grain, trying to push something on their audience, and it's not what they want. We evolve and iterate [based on data], and that's why the brands and the community and the speakers can come out and have a great time.”\nBembury-Coakley asked , “I think nostalgia is something that's been overdone. I would love to know: What's a better way for brands to engage with communities or consumers that they want to connect with?”\n\"I agree, nostalgia has become the easy button for connection. But real community is built forward, not backward. The better path for brands is participatory storytelling: inviting people to co-create the narrative rather than simply consume it. Communities don‘t want to be reminded of who they were; they want to be seen in who they’re becoming.\n\"That requires marketers to move from campaigns to contexts, spaces where shared curiosity, lived experience, and emerging identity meet. Whether through localized storytelling, behind-the-build transparency, or platforming authentic user voices, brands can shift from ‘remember when’ to ‘imagine with us.’\n“Connection today isn't about familiarity; it's about alignment. The question isn't 'How do we tap into what people loved?' but 'How do we stand alongside what they're creating next?' That's where trust, loyalty, and modern belonging live.”\nCalloway asked , “As marketers, we often talk about authenticity and alignment but those words can become buzzwords fast. How do you ensure your team stays connected to real people and not just the performance of connection?”\n\"You absolutely must know what your customers care about and want from you. I think a lot of brands today want to be \"cool\" and that's contributing to the great flattening of brands and content across the ecosystem right now.\n\"At SurveyMonkey, we don't aspire to be cool. We want to be the lovable nerd who you want to partner with in your high school chem lab because you know we'll do all the work and make you look smart. This is how you differentiate today: know the value you provide in your customers' eyes and maximize it in everything you do.\"\nRead more: Why SurveyMonkey’s marketing leader says your foundation is broken\nMiserany asked , “Every leader must justify marketing and brand investment with hard numbers. How do you functionally bridge the gap between creative, intangible brand value and tangible financial outcomes, and how do you justify that brand investment to key stakeholders?”\n“In destination marketing, our work sits between numbers and imagination. We're here to drive economic value for residents and small businesses, so we measure everything: visitation, spending, seasonality, excise tax. But the way we get there is by creating a bit of fantasy. People don't visit because of data; they visit because they've been pulled into a story about a place. Our creative work builds that story, and when it works, you can see it in the numbers that follow.”\nRead more: Marketing is removing barriers: Lessons from a destination marketing expert\nJudge asked , “What's something your team does purely out of love for the user — not metrics, not growth, just because it feels right?”\n\"We offer the Atlassian Team Playbook , available free and un-gated, to make it easier for teams to collaborate. It's full of practical advice, exercises, and templates to help teams discover dependencies, run retros, and define roles and responsibilities.\n“We've also added some whimsical experiences to the product, like a Halloween-themed animation, or confetti when you move a task to 'done'. These make the day a little brighter for our users!”\nFaus asked , “What tactics are marketers using to make their messaging stand out in a show floor filled with booths about AI?”\n“The best way to get your booth to stand out against AI is to be human. Seems simple, but sometimes we forget that just building the booth doesn't mean attendees will come. People are craving human connection in this AI-driven time.”\n\"Make sure you have the best, most welcoming representatives at your booth. That means standing outside of the booth sometimes, making it clear to attendees passing by that you want to speak with them. Don't wait for them to come to you. 85% of consumers are likely to purchase from a brand that creates a positive, memorable experience.\n\"Make sure your booth‘s messaging is very clear. Not just your company’s name and logo — but what your company can help people with.\n“Incorporate play/experiential into your booth. Schedule live talks for attendees to stop by the booth and chat with an expert. Give intentional and meaningful swag. Not everything needs your logo blasted on it.”\nRead: 3 bitter truths all marketers need to hear right now\nOyolede asked , “If you could redesign the way creatives and marketing professionals work, what non-negotiables would you include?”\n“First, I‘d make work/life balance a structural expectation and not a personal responsibility. After working in marketing for ten years, I’ve seen the best output from every team not only when we‘re well rested, but we don’t feel anxious to ask for rest and use our PTO.\n“Structurally, I‘d include flexible work blocks, projected no-meeting windows, and half days on Fridays all year round. Additionally, I’d prioritize mental health literacy for managers. If marketing is an always-on industry, we need leaders who know how to recognize burnout, support employees through high-pressure seasons, and model boundaries themselves.”"
  }
]