[
  {
    "url": "https://martech.org/linkedin-the-marketers-guide/",
    "title": "Marketing on LinkedIn: What you need to know",
    "date": "2025-12-10T13:42:00+00:00",
    "content": "We’ve updated this guide with information on LinkedIn’s new reserved ad format and the personalization and AI ad creation tools .\nUsing LinkedIn personally is very different from using it for marketing. Fully understanding the business social media site can boost your marketing efforts, but there is a lot to learn. To help you, we’ve put together this guide.\nListen to an AI-generated deep dive of everything you need to know about marketing on LinkedIn.\nUse the form below to customize this content. Choose the appropriate job role and our MarTechBot will personalize the content on this page for you. If you’d rather not customize the content, simply keep scrolling.\nLinkedIn is the largest social network for businesses and business people and an essential site for B2B marketing.\nOn LinkedIn, people can connect with colleagues, industry peers and potential employers. Companies can showcase products and services, generate leads, build brand awareness and establish “thought leadership” within their industry. This professional focus makes it an ideal place to find the people who may be interested in purchasing your product.\nThese numbers are self-reported, and it’s wise to keep that in mind. For example, LinkedIn says it has more than 199 million users from the U.S. That’s two-thirds of the nation’s total population and four-fifths of all Americans between the ages of 18 and 64. Many of these accounts are businesses, not individuals, so the numbers aren’t crazy. However, all social media sites have a certain percentage of ghost accounts.\nThey must be doing something right: LinkedIn’s 2022 ad revenue was $5.91 billion, It is projected to reach $10.35 billion by 2027.\nCulture. Every social media site has its distinct culture and jargon. The site and its users put everything in the best possible light. As a result, many posts have all the liveliness and personality of a press release. This allows businesses and leaders with distinct personas to stand out. Think twice before directly dissing the competition, though. This is best done passive-aggressively: “It’s great to see [competitor] getting back up to speed. [Product] is their best work in years.”\nJargon. As with many products, LinkedIn’s descriptions can have confusing jargon. Consider these:\nEverything on LinkedIn is marketing. Ads, posts, conversations, messages, etc. are all part of your campaign and need to be focused on achieving a goal. Here are the tools the site provides.\nYour digital storefront on the platform. It’s where you showcase your brand, share company updates and connect with your audience.\nLinkedIn offers a variety of ad formats to reach your ideal customers and drive specific actions.\nAll of these can be targeted according to factors such as:\nLinkedIn Accelerate is a specialized campaign type designed to drive specific business outcomes, such as lead generation or website visits. It offers a streamlined setup process and pre-optimized targeting options, making it a more efficient choice for businesses with clear goals.\nAccelerate also has gen AI tools to generate images, videos and other content.\nNew campaign objectives are being added — including brand awareness, engagement, website conversions and video views. That said, standard LinkedIn campaigns have more customization options and the ability to handle complex objectives.\nSales Navigator helps sales professionals identify and engage with potential customers. Its key features and functionalities include:\nThis lets you measure the effectiveness of your marketing efforts. It has metrics and reports to help understand your audience, track content performance, measure campaign effectiveness and benchmark performance against industry standards.\nThese are similar to Instagram Stories and allow users to share short, ephemeral content directly with their network. They can include photos, videos, text, and GIFs. The key features and benefits include:\nThese are specialized company pages that highlight specific products, services,or brand initiatives. They offer a focused platform for businesses to tailor their content and messaging to a particular audience, increasing engagement and interaction. Showcase Pages can also help build brand awareness and credibility for your featured offering, ultimately driving leads and sales.\nAs an experienced B2B marketer, you already know the basics of LinkedIn marketing. Content marketing and social selling work the same everywhere. So, let’s look at things you may not be familiar with.\nThis is the site’s version of event marketing. It lets you connect with your audience in real time. You can do this through:\nLinkedIn Live is also useful for generating leads. You can get contact information by offering exclusive content to viewers who sign up for your email list. Contests or giveaways can also increase engagement and generate leads by offering prizes or discounts to people participating in the event or sharing it with others. And you can identify potential leads by seeing who has engaged with your content, asked questions or otherwise shown interest.\nEmployees can be a powerful force multiplier for marketing on LinkedIn. However, they need to know how to do it. Train them on best practices for LinkedIn usage and content sharing. Also, use a content calendar to ensure they share the right content at the right time. Of course, this means one more thing for them to do. So, recognize and reward employees who take the time to do this.\nThis has the additional benefit of encouraging employee ownership of the brand, which can contribute to a positive company culture. Furthermore, authentic comments from employees can build trust with potential customers and improve the company’s reputation.\nJoining and participating in relevant LinkedIn groups lets you build relationships, network and share your expertise. Look for groups that align with your target audience and industry. Regular participation is the best way to raise your profile.\nLinkedIn introduced a new feature for enhancing lead generation efforts. Users can now select “Lead Generation” as an objective when boosting posts on their LinkedIn feed. Previously, the quick boost option was limited to reach and engagement goals.\nThis simplified ad setup allows businesses to set a budget, target a specific audience, and attach a lead form template to their boosted post. The feature lets companies build their contact lists and gain valuable insights into their audience. And it can transform organic content into targeted ads that generate high-quality leads.\nBoosting LinkedIn posts can be a valuable tool for extending the reach of your top-performing content, while also serving as a data-gathering mechanism. This lightweight approach, however, lacks the granular targeting capabilities offered by LinkedIn’s Campaign Manager. For comprehensive campaign management, it’s essential to utilize the full suite of tools available within the platform.\nLinkedIn’s new Companies feature in Campaign Manager is designed to provide B2B marketers with deeper insights into account-based marketing (ABM) performance. It is a centralized hub for viewing company-level engagement data across organic and paid LinkedIn campaigns.\nWith Companies, B2B marketers should get valuable insights, refine their ABM strategies, and reach and engage audiences more successfully.\nLinkedIn has rolled out several updates focusing on enhancing video presentation and discovery. They include bringing the full-screen, vertical video display format to desktop to make it more like the mobile app. The platform is also testing a larger video display in mobile and an option to display a member’s video uploads in a profile mini-view. These updates aim to make video posts more prominent and improve video discoverability.\nDiscovery is also a key focus, with LinkedIn now surfacing more videos in search results through a swipeable carousel. Additionally, LinkedIn is launching new video analytics, providing data on average watch time to help users understand video performance. To help users maximize video content, LinkedIn has also launched new nano-learning courses covering topics such as crafting compelling video hooks, editing, repurposing, and collaborating on video content.\nThese updates are significant because video content is on the rise on LinkedIn, with a reported 36% increase in watch time year-over-year. LinkedIn is actively trying to attract video creators by launching a TikTok-style vertical feed and prioritizing video content in its algorithm. By improving video presentation, discoverability, and providing analytics and learning resources, LinkedIn aims to capitalize on the growing popularity of video and encourage more users to incorporate video into their LinkedIn strategy.\nLinkedIn updated its ad targeting and attribution features to help improve ad targeting and demonstrate return on investment. These updates include the Conversions API (CAPI) and Revenue Attribution Report (RAR) enhancements.\nLinkedIn is now a place for brands to leverage influencer marketing, according to The Sprout Social Index. The site offers a largely untapped opportunity for influencer marketing (only 12% of brands say LinkedIn is their preferred channel for influencers). Here’s why:\nExample: Brandon Smithwrick partnered with Typeform, an online form-building software, for a LinkedIn post about how the platform enhances efficiency. The video got 380 engagements (reactions, comments and reposts), according to Sprout.\n( The 2025 Sprout Social Index – registration required)\nLinkedIn updated its Campaign Manager, focusing on three key areas: campaign planning and strategy, campaign creation and measurement and optimization.\nThe updates include a new Media Planner for forecasting campaign results, an Ads Duplication feature to streamline campaign creation, Dynamic UTMs for improved tracking, a Marketing Overview dashboard for small businesses, enhanced Measurement Insights for detailed performance analysis and an AI-driven Campaign Performance Digest for quick understanding of results.\nPolls, the least used format on LinkedIn, are getting a lot of push from the site’s algorithm, according to Metricool’s “2025 LinkedIn Study.” The report also suggests that marketers should make more use of carousels and video.\nMetricool’s 2025 LinkedIn Study is based on an analysis of 47,735 accounts and 577,180 posts between January 2023 to January 202. It is available here . ( Registration required)\nLinkedIn’s new Qualified Leads Optimization feature helps advertisers target high-intent accounts by aligning ad delivery with lead quality. Businesses can define lead quality through LinkedIn’s system or a CRM like HubSpot or Salesforce. Once leads are identified, their data is sent to Campaign Manager, which matches and optimizes ad delivery based on similar high-quality profiles. The tool also offers deeper attribution for pipeline and revenue impact.\nLinkedIn recommends submitting at least five qualified leads every two weeks, within 30 days, for optimal results. The system takes two weeks to reach full performance. This feature applies to campaigns using the Lead Generation objective and works best for large-scale advertisers with an existing lead qualification process.\nIn early May 2025, Linked announced BrandLink, an expansion of what was formerly known as the Wire Program launched in 2024. BrandLink will offer video ad placements next to some of the LinkedIn platform’s most popular creator voices.\nWith the launch of BrandLink, LinkedIn continues to grow its investment in video. According to LinkedIn, 62% of B2B marketers believe video is most effective in reaching and influencing members of the buyer group.\nSince launching the Wire Program in June 2024, LinkedIn advertisers report:\nMore information on BrandLin is available on the LinkedIn website .\nDig deeper: Marketing on Reddit: What you need to know\nLinkedIn is adding more post analytics aimed at giving frequent posters and creators a clearer picture of how their content performs and what actions it drives. The new data shows things like how a post leads to profile visits or new followers. Premium members can also see how many people click their custom profile button, which is often used to send traffic to websites or newsletters.\nThe added metrics provide a better sense of how content performs in terms of visibility and outcomes. Data points like “followers gained from this post” help show growth over time, while “custom button interactions” give a clearer sense of how content leads to clicks—useful for anyone tracking conversions, especially in B2B. These also open the door for more targeted testing and content tweaks, giving users a better chance to see what works and what doesn’t. Marketers see this as a step toward stronger post-level attribution, which could make the platform more appealing for ad spend.\nAt the same time, LinkedIn quietly removed the basic hyperlink option from profiles on May 28. Now, the only way to add an external link is through a Premium-only custom button. That might nudge more people toward upgrading, though many top creators already have free access to Premium.\nAccording to LinkedIn, 91% of B2B marketers agree that grabbing audience attention is their biggest campaign worry. New product updates introduced in early June 2025 are designed to help.\nFirst-impression ads: New full-screen, vertical video format for single-day campaigns to maximize visibility during important moments. Marketers can exclusively reserve the first ad impression that a member sees on a given day, in a given country.\nReserved ads: Allowing advertisers to place other sponsored content, including Thought Leader Ads, Single Image Ads and Document Ads, as the first ad slot in the feed to increase attention, brand visibility, and share of voice.\nExpanded CTV ad capabilities: CTV Ads are generally available for customers to target buyers in the U.S. and Canada, and LinkedIn made additional enhancements to offer more premium reach, easier activation and sharper insights — all in one place. This includes: welcoming Paramount as the latest publisher for LinkedIn’s CTV Select offering, bringing VAST tag capabilities from Innovid to CTV Ads and more.\nLinkedIn is also teaming up with Adobe so marketers can design in Adobe Express and export directly to LinkedIn Ads.\nLinkedIn has introduced long-requested frequency capping controls for brand awareness campaigns, giving advertisers the ability to limit how often their ads are shown to individual member accounts. The new feature, detailed in documentation published three weeks ago, began rolling out on July 2, 2025.\nAdvertisers using Classic campaigns in LinkedIn Campaign Manager can now set frequency caps ranging from 3 to 30 impressions per member over a rolling seven-day period. The update covers placements in the LinkedIn feed, LinkedIn Audience Network, and Connected TV, with options to either apply default limits or customize caps for specific strategies.\nThis enhancement addresses a key gap in LinkedIn’s ad platform, which previously lacked manual frequency controls—a point of frustration for advertisers for years. One user in a 2021 Reddit thread described being told by LinkedIn support that such settings weren’t available.\nBy allowing marketers to manage ad exposure more precisely, LinkedIn aims to reduce ad fatigue and improve the effectiveness of B2B brand awareness efforts.\nLinkedIn is expanding its analytics capabilities with the rollout of two key updates to give marketers and professionals more actionable insights. First, the platform has launched Member Analytics APIs, which let individual users pull profile and post performance data—including follower growth, video views, and engagement metrics—into their preferred social media management tools. This API access was previously reserved for company pages but is now open to all members. Launch partners include major platforms like Hootsuite, Buffer, Sprinklr, and Zoho, with more integrations expected.\nThese APIs help users consolidate their performance tracking and make it easier to surface LinkedIn insights alongside other social data. Users must authenticate their LinkedIn accounts within each tool, and LinkedIn is actively seeking user feedback to guide further development. Early partners like Vista Social and SocialPilot have described the new functionality as filling a key gap in their analytics offerings.\nIn addition, LinkedIn has introduced Company Attribution in its Revenue Attribution Report. This new feature aims to give B2B marketers a more granular view of how marketing activities influence deal progression across buying committees. Marketers can track revenue influence at the account level by integrating CRM data from HubSpot, Salesforce or Microsoft Dynamics. The insights enable more targeted retargeting, campaign optimization, and pipeline acceleration when used with LinkedIn’s Companies Hub. The Company Attribution tool is now available globally.\nLinkedIn is rolling out Thought Leader Event Ads, letting marketers sponsor member posts that link directly to event pages. Building on the success of Thought Leader Ads — which see 1.6x higher engagement than single image ads — this new format helps brands amplify executives, employees, creators and industry experts around key moments.\nWhy now? Trust has become the currency of B2B marketing. LinkedIn’s 2025 Benchmark Report found 94% of marketers say trust is essential, and most agree people trust people more than brands. Thought Leader Event Ads allow marketers to tap into that credibility while driving visibility for conferences, webinars and campaign launches.\nGetting started is simple: find member posts tied to your event, request permission to promote them, and set it up in Campaign Manager. From there, track results with CTR, CPC and follower growth to see how trusted voices move the needle.\nLinkedIn is doubling down on video as its BrandLink program rapidly scales. Once limited to publishers, the initiative was rebranded in May to include creators and now counts more than 70 new partners—from Bloomberg and The Wall Street Journal to TED. The format: pre-rolls of roughly 15 seconds, paired with in-content branded placements.\nThe sponsors are enterprise giants like AT&T Business, IBM, SAP, and ServiceNow. The results: BrandLink revenue jumped nearly 200% quarter over quarter, while creator and publisher payouts have tripled yearly. Video uploads are up more than 20% and views are up 36%, with ad spend flowing in from multiple industries eager to reach decision-makers inside LinkedIn’s growing B2B video ecosystem.\nTHe increased emphasis on video is a response to changes in LinkedIn’s audience is shifting. More than half of its 1.77 billion monthly visits now come from 25–34-year-olds. Creator-led content and authentic storytelling carry more weight than traditional ads with Gen Z.\nLinkedIn has introduced the Company Intelligence API, a tool aimed at helping B2B marketers link campaign engagement more directly to pipeline and revenue.\nTraditional attribution models often fall short in complex B2B buying journeys, where early signals are overlooked and campaign impact is undervalued. LinkedIn’s new API addresses that gap by making company-level engagement data — including paid and organic impressions and clicks — available to analytics platforms.\nCertified partners such as Channel99, Octane11, Dreamdata, Factors.ai and Fibbler ingest this data alongside CRM outcomes and other channel inputs. The result: attributed metrics that connect LinkedIn activity to sales pipeline and ROI, giving marketers a clearer view of how campaigns influence accounts across the funnel.\nMarketers in the pilot highlighted the API’s ability to validate spend and improve alignment between sales and marketing. Some cited uncovering nearly double the influenced pipeline compared to previous reporting methods, while others noted that lower SQL costs provided compelling justification for increased budget allocation.\nThe Company Intelligence API is now available globally.\nLinkedIn is expanding its AI-driven advertising features to help small and mid-sized businesses (SMBs) simplify campaign setup and improve performance.\nA core update is Auto-Targeting, which automatically builds professional audiences based on signals such as a URL or customer list. To speed creative production, the new Draft with AI tool generates headlines, intro text and image suggestions using LinkedIn’s generative AI, Shutterstock assets and advertisers’ own media libraries.\nNew integrations with Canva and Adobe Express provide LinkedIn-optimized ad templates for images, videos and carousels, which can be exported directly into Campaign Manager.\nOn the optimization side, enhancements to the Recommendations tab offer data-driven performance suggestions. Advertisers can A/B test these changes with a small group before rolling them out platform-wide using a new 1-click apply option.\nFinally, LinkedIn is renaming parts of Campaign Manager to align with industry standards. “Campaign Groups” will now be labeled Campaigns, while “Campaigns” will be called Ad sets. The update has no functional impact but is designed to enhance the platform’s ease of navigation.\nLinkedIn now supports more precise measurement of campaign performance by enabling marketers to quantify incremental conversions —those outcomes attributable solely to paid media activity, not to business as usual. By running controlled lift studies or using randomized hold‑out groups, advertisers can separate the incremental effect of their campaigns from background conversion trends.\nThis approach aligns with LinkedIn’s push toward more transparent, outcome‑driven measurement. By incorporating incremental lift measurement into your LinkedIn strategy, you’ll gain a more accurate view of how your paid activity contributes to lasting business impact, not just short‑term interaction.\nLinkedIn has released three ad tools and is previewing one more. They are:"
  }
]