[
  {
    "url": "https://martech.org/companies-arent-looking-for-storytellers-theyre-looking-for-meaning/",
    "title": "Companies aren’t looking for storytellers. They’re looking for meaning.",
    "date": "2026-01-14T13:44:00+00:00",
    "content": "The Wall Street Journal ‘s recent story, “ Companies are Desperately Seeking Storytellers ,” lit up LinkedIn the day it was published. Marketer reactions were heated – and split right down the middle.\nSome argued that organizations already have storytellers and simply need to give them the freedom to exercise their skills. Others celebrated storytelling as a newly recognized strategic skill, essential in a world saturated with AI-generated content.\nBoth sides are partially correct, but both miss the deeper issue: What companies are struggling with isn’t storytelling. It’s sense-making.\nThe growing interest in storytelling roles isn’t just about telling tales around the campfire, creating brand myths or exercising creative flair. It’s not just that more marketers are adding storytelling skills to their resumes, or that more companies want marketers with those skills.\nRather, it’s a response to a more uncomfortable reality.\nMarketing for modern businesses has become fragmented. What we knew just 10 years ago largely doesn’t apply anymore, and we’re still learning how to deal with a host of new normals, like these:\nWhat’s scarce now isn’t content or attention. Its coherence with context.\nCustomers, employees and investors are swimming in information but struggling to understand what it all means. When meaning breaks down, trust exits the building.\nHiring storytellers is a proxy move. It’s a signal that something feels disconnected, but leaders can’t quite articulate what it is.\nOne popular response to the WSJ article argued that companies already employ capable storytellers. They just need to loosen their grip on the message. Storytellers need fewer constraints, fewer style guides and fewer approval layers.\nIn other words, back off and let us do what we do best. They aren’t wrong, either.\nCorporate environments are excellent at sanding the edges off anything human. But giving marketers permission to be more creative isn’t enough to create effective storytelling.\nBeing articulate or creative is important. But it doesn’t automatically mean someone can create compelling stories in a corporate environment. The skills are different. A storyteller must be able to create in a structured business environment with these requirements:\nFreedom helps marketers unleash their creativity. But it doesn’t replace the need to create understanding and context.\nThe other storytelling camp frames storytelling as a strategic business capability — something marketers can embed, scale and operationalize.\nAgain, not wrong. But this framing introduces a quieter danger.\nStorytelling can become performative when the creativity that fuels it gets hitched to business conventions. When storytelling becomes a department, a job title or a repeatable process whose worth is measured by irrelevant KPIs, it steals the magic that distinguishes storytelling from other business skills.\nDoes any of this sound familiar? It harkens back to the age-old tug of war between strategy and tactics. When we use storytelling to advance a strategy, we’re more likely to create meaningful stories. When we reduce it to a tactic, we take the magic out of the process.\nThe result is inevitable: Organizations create beautifully written narratives that feel hollow because they optimize for output rather than belief. Explanation replaces meaning. Polished stories replace trusted ones.\nThis is how brands end up talking at people instead of helping them understand.\nStories in a business context don’t work just because they’re entertaining. They work because they align with how humans process the world.\nOur brains are constantly asking questions like these:\nStories organize information into cause and effect. They help us resolve uncertainty and reduce cognitive load. They allow us to simulate outcomes without risk.\nIn other words, storytelling isn’t a creative flourish. It’s a cognitive tool.\nThat’s why it shows up everywhere — in leadership, product narratives, customer experience, marketing, and culture. It’s also why its absence feels so destabilizing.\nMost organizations don’t need more storytellers. Here’s what they do need:\nUntil those foundations are in place, storytelling efforts will feel forced, no matter how talented the people are.\nThis also explains the irony I saw running throughout the WSJ article.\nCompanies want the outcomes of storytelling — trust, clarity, connection — without accepting the uncertainty that real stories bring. They want narrative control without unpredictability. Humanity without ambiguity.\nBut that’s not how stories work. That leads me to my final point.\nThe current obsession with storytelling is a symptom, not a solution. Whether they realize it or not, businesses are really searching for meaning:\nWithout meaning in these forms, storytelling becomes self-indulgent decoration. It doesn’t build brand equity or trust."
  }
]