[
  {
    "url": "https://www.searchenginejournal.com/well-known-seo-explains-why-ai-agents-are-coming-for-you-what-to-do-now/562964/",
    "title": "Well-Known SEO Explains Why AI Agents Are Coming For You & What To Do Now via @sejournal, @theshelleywalsh",
    "date": "2025-12-11T14:00:23+00:00",
    "content": "I’m carefully watching the development of agentic SEO, as I believe over the next few years, as capabilities improve, agents will have a significant impact on the industry . I’m not suggesting this will be a seamless replacement of talent with a highly capable machine intelligence. There is going to be a lot of trial and error, but I do think we are going to see radical shifts in how the online space operates. Not unlike how automation transformed manufacturing.\nMarie Haynes has long been a well-known expert in the industry who shared her learnings on E-E-A-T and Google’s algorithm through her popular Search News You Can Use newsletter.\nA few years ago, Marie made the decision to retire her SEO agency and went all in on learning AI systems, as she believes we’re at the beginning of a profound transformation.\nMarie wrote a recent article , “Hype or not, should you be investing in AI agents?” about what SEOs need to understand about this rapidly developing space. So, I invited her to IMHO to dive more into this topic.\nMarie believes AI will radically change our world for the better, and she believes every business will have AI agents.\nYou can watch the full interview with Marie on the IMHO recording at the end, or continue reading the article summary.\n“The idea that we optimize for appearing as one of the 10 blue links on Google is already gone.”\nMarie’s practical advice for anyone wanting to understand agents is to start with Gems:\n“If you take one thing from this conversation, it’s to try to create some Gemini Gems ,” Marie emphasized. “Eventually I’m fairly certain that these gems will morph into agentic workflows.”\nTo illustrate, she shared a process she called her “originality Gem,” which contains a 500+ word prompt that captures how she evaluates content, along with examples of truly original content in its knowledge base.\n“We’re not far from the day where all of my processes that I do for SEO can be handled by agentic workflows that occasionally pull on me for some advice,” Marie said.\nThe next progression and real potential come from chaining agents together to create agentic workflows .\nThe power that this gives opportunity to is that we can use our knowledge and experience to teach AI like a team of assistants to do the work that can be automated.\nWe would then orchestrate the process and, like a conductor, sit and guide the agents to perform the work as we become the human-in-the-loop to review the output.\nOnce we have downloaded our knowledge to the agents, and the systems work, we can scale ourselves to handle exponential clients.\n“Instead of me handling just a small handful of clients, all of a sudden I could have a hundred clients and do the same work because it’s all going through my workflow,” Marie said.\nThe challenge here is the skill in prompting the agents and constructing them to achieve the desired output.\n“The future of our industry is not about optimizing for an engine, but about acting as the interface between businesses and technology, and we will be the human experts who teach, guide, and implement AI agents.”\nI asked Marie why she focuses on Gemini over ChatGPT, and her response was based on futureproofing: “The main reason why I use Gemini is not to accomplish things today, but to grow my skills in what’s coming tomorrow.”\nMarie went on to explain that “Google’s got a whole ecosystem that you can see it coming together like right now,” and she believes that Google will be the winner in the AI race.\n“I think that Google is going to win the game. I think it’s always been their game to win. So I make it a point to use Gemini as much as I can.”\nMarie’s prediction for the next few years is for workflows to become embedded. “ Sundar Pichai , CEO of Google, said this way back in March, that, in two to four years, every agentic workflow will be deeply embedded into our day-to-day work.”\nHowever, she thinks the real transformations will come when businesses start making money from agentic workflows.\n“It’s wild how many trillions of dollars are being spent on developing AI, yet there’s not a whole lot of financial output at this point,” Marie noted, referencing a McKinsey study showing 95% of businesses using AI aren’t making money from it yet [Editor’s note: McKinsey was 80%; MIT said 95% ].\n“It’s very similar to SEO. There was a day where there were just a small handful of people who figured out how to improve on Google. Once people started making good money from understanding SEO, there was a lot of attention. Tools were created and a whole industry popped up. I think that’s going to happen again. Will it be within the next 12 months? I don’t know. I feel like it might be a little bit longer.”\nOverwhelm is a real issue to be aware of, and with developments moving so quickly, there is a huge learning curve to essentially retrain. Even for those working on this full-time.\nMarie made a commitment when she went all in on AI research. “I made it my full-time job to stay on top of what’s happening, and even I get overwhelmed with all the stuff that’s happening with AI,” she explained.\nMarie’s advice is to keep learning, keep trying things, and experiment with writing prompts .\n“The next time you go to do a task, try to create an agent that would do this for you,” she suggested. Even if you don’t finish, you’ll learn skills for the next attempt.\nAlso, persevere instead of taking the first failure. “Try to figure out what they can do, instead of just telling everybody, ‘Oh, it can’t do this.’ Find ways you can use it.”\nFor development teams, she recommends vibe coding with tools like Google’s Anti Gravity or AI Studio . “You can deploy a whole website without even knowing any HTML,” Marie said.\nShe also advocates for deep research reports using either Gemini or ChatGPT to analyze how competitors are using AI, providing immediate value to clients while building skills.\nMarie referenced Sundar Pichai calling AI technology more profound than fire or electricity in its impact on society. Despite acknowledging her bias after investing significant time in understanding AI, she maintains there’s going to be societal disruption.\n“Being able to understand what’s happening in the world and distill it down to what’s important to your clients will be a superpower,” she said. Although, she does admit, there is still a lot of learning and grey areas to move through as we navigate the edge of technology.\n“If you’re feeling lost, you’re not alone because imagine right now we’re sort of at the forefront of all of these changes happening.”\nFor those who do persevere, there will be significant rewards. Eventually, business owners will be clamoring for people who can explain AI and implement it. The professionals who develop these skills now will be extremely valuable in the future.\n“The people who know how to use AI, know how to create agents, and know how to make money from AI are going to be extremely valuable in the future.”\nWatch the full video interview with Marie Haynes here:\nThank you to Marie Haynes for offering her insights and being my guest on IMHO .\nFeatured Image: Shelley Walsh/Search Engine Journal"
  },
  {
    "url": "https://martech.org/ga4s-advertising-snapshot-shows-why-last-click-attribution-no-longer-fits-ai-led-journeys/",
    "title": "GA4’s Advertising Snapshot shows why last-click attribution no longer fits AI-led journeys",
    "date": "2025-12-11T13:58:00+00:00",
    "content": "Many teams still judge channel performance based on last-click results. That once made sense in a simpler search world where users moved quickly from query to website to conversion. But that model no longer reflects today’s behavior, and GA4 makes that gap more visible as AI-led search, multiplatform browsing and multimodal decision-making reshape the user journey.\nChannels like SEO, content, social, email and even paid media influence users much earlier in the journey. Today’s users naturally switch between devices, platforms and surfaces as they explore ideas and refine decisions. They move from traditional search to AI chat, from retailer search to social proof, from product comparisons to brand queries and from AI summaries back to Google with clearer intent. They discover in one place, research in another and convert only once they’ve filtered the market.\nThis creates journeys that are both multimodal and multiplatform, where the final click doesn’t reflect the value of earlier touchpoints. Many reporting setups still reward only the last visible action, overlooking the channels that build understanding, confidence and intent.\nGA4’s Advertising Snapshot helps correct this by revealing how channels work together across the whole journey. It highlights the impact of organic channels and the increasing importance of AI-driven touchpoints. This view surfaces early and mid-funnel contributions hidden by last-click models and helps teams demonstrate that SEO and content still play a critical, evolving role in how people learn, compare and decide.\nThe Advertising Snapshot in GA4 offers a clear, consistent and accessible visualization of how all channels support the user journey. It’s not just a paid media report — it’s a customer journey report that reveals discovery, influence and decision support across all touchpoints, providing insights traditional dashboards often miss.\nDig deeper: How GA4 records traffic from Perplexity Comet and ChatGPT Atlas\nAI layers are now a natural part of research and discovery. They help people understand categories, reduce complexity and refine what they want.\nOrganic content powers AI Overviews, Gemini responses, Perplexity summaries and Copilot results. These surfaces may not always generate a measurable click, but they still influence how users perceive brands, what options they consider, and what paths they follow.\nAI tools support comparison, validation and idea testing before users are ready to visit a website or interact with a brand. These steps often fall outside traditional analytics visibility, yet they have a significant impact on outcomes. As a result, SEO now plays a role in more decision points than before.\nUsers who begin with AI exploration often return to Google with more specific needs and clearer intent. That may look like a simple organic or branded search, though the journey started much earlier. The Advertising Snapshot helps surface these patterns.\nDig deeper: Why it’s time to treat AI referrals as their own channel in GA4\nThe Snapshot provides strong evidence that organic contributes across the full journey not only through direct conversions or traffic volume.\nOrganic search frequently introduces users who are already aligned with the category or who are refining their needs. Some convert immediately, while others return through different channels. The Advertising Snapshot helps show how critical this early role is.\nOrganic shapes mid-funnel behavior by helping users refine queries, check brands and compare solutions. Many conversions that appear to come from direct, paid or email channels are actually assisted by organic. The Snapshot helps quantify this influence.\nUsers who begin research through AI summaries often return with higher intent and more specific needs. The Snapshot helps identify these patterns through repeat visits and assisted conversions, giving a clearer picture of the full path to purchase.\nDig deeper: How to set up GA4 cross-domain tracking for global and multi-brand sites\nSEO is often under-credited because its influence occurs early and mid-journey — stages that are hard to capture in last-click reports. The Advertising Snapshot helps correct this by quantifying value across every stage of the funnel.\nOne of its most significant benefits is revealing how organic contributes across early, mid and late touchpoints. It shows where organic enters the journey, how often it assists conversions and when it serves as the final step. This shifts SEO from an upper-funnel assumption to a measurable contributor across the full journey.\nUsers begin their journey with broad questions, comparisons and exploratory searches. The Snapshot helps surface how many new users are introduced by organic and how often discovery begins through search.\nThe mid-funnel is where organic does much of its hidden work. Users return with refined queries, brand checks and problem-solving needs. The Snapshot quantifies this through assisted conversions and return visits, showing how organic shapes consideration before users move to paid or direct channels.\nOrganic also contributes at the point of conversion. Many users return through branded and non-branded searches near the end of the journey. The Snapshot provides clean data on these visits, proving that organic supports the whole journey, not just discovery.\nThe key is to show organic’s influence across the journey clearly. Organic and AI-driven search shape decisions before users ever see a paid ad — and the Advertising Snapshot makes this visible.\nSearch and AI summaries depend on high-quality content that drives both discovery and conversion. The Snapshot shows how this content contributes to brand visibility, helping build early-stage awareness that often leads to direct or subscriber-driven conversions.\nThe GA4 Advertising Snapshot is one of the clearest tools for illustrating how all channels work together across the user journey. It reveals the early and mid-funnel impact of organic and AI-influenced touchpoints and shows why last-click models fall short of today’s reality.\nSEO remains critical in a complex, multimodal journey. It helps users learn, filter and decide — and the Snapshot helps teams make that influence visible and understandable to stakeholders."
  }
]