[
  {
    "url": "https://www.searchenginejournal.com/ai-search-seo/562147/",
    "title": "Pragmatic Approach To AI Search Visibility via @sejournal, @martinibuster",
    "date": "2025-12-01T11:15:46+00:00",
    "content": "Bing published a blog post about how clicks from AI Search are improving conversion rates, explaining that the entire research part of the consumer journey has moved into conversational AI search, which means that content must follow that shift in order to stay relevant.\n“Instead of sending users through multiple clicks and sources, the system embeds high-quality content within answers, summaries, and citations, highlighting key details like energy efficiency, noise level, and smart home compatibility. This creates clarity faster and builds confidence earlier in the journey, leading to stronger engagement with less friction.”\nBing sent me advance notice about their blog post and I read it multiple times. I had a hard time getting past the part about AI Search taking over the research phase of the consumer journey because it seemingly leaves informational publishers with zero clicks. Then I realized that’s not necessarily how it has to happen, as is explained further on.\n“It’s not that people are no longer clicking. They’re just clicking at later stages in the journey, and with far stronger intent.”\nSearch used to be the gateway to the Internet. Today the internet (lowercase) is seemingly the gateway to AI conversations. Nevertheless, people enjoy reading content and learning, so it’s not that the audience is going away.\nWhile AI can synthesize content, it cannot delight, engage, and surprise on the same level that a human can. This is our strength and it’s up to us to keep that in mind moving forward in what is becoming a less confusing future.\nBing’s blog post says that the priority is to create high-quality content:\n“The priority now is to understand user actions and guide people toward high-value outcomes, whether that is a subscription, an inquiry, a demo request, a purchase, or other meaningful engagement.”\nBut what’s the point in creating high-quality content for consumers if Bing is no longer “sending users through multiple clicks and sources” because AI Search is embedding that high-quality content in their answers?\nThe answer is that Bing is still linking out to sources. This provides an opportunity for brands to identify those sources to verify if they’re in there and if they’re missing they now know to do something about it. Informational sites need to review those sources and identify why they’re not in there, something that’s discussed below.\nEarlier this year at the Google Search Central Live event in New York City, a member of the audience told the assembled Googlers that their client’s clicks were declining due to AI Overviews and asked them, “what am I supposed to tell my clients?” The audience member expressed the frustration that many ecommerce stores, publishers, and SEOs are feeling.\nBing’s latest blog post attempts to answer that question by encouraging online publishers to focus on three signals.\n“…the most valuable signals are the ones connected to visibility. By tracking impressions, placement in AI answers, and citations, brands can see where content is being surfaced, trusted, and considered, even before a visit occurs. More importantly, these signals reveal where interest is forming and where optimization can create lift, helping teams double down on what works to improve visibility in the moments when decisions are being shaped.”\nBut what’s the point if people are no longer clicking except at the later stages of the consumer journey?  Bing makes it clear that the research stage happens “within one environment” but they are still linking out to websites. As will be shown a little further in this article, there are steps that publishers can take to ensure their articles are surfaced in the AI conversational environment.\n“In fewer steps than ever, the customer reaches a confident decision, guided by intent-aligned, multi-source content that reflects brand and third-party perspectives. This behavior shift, where discovery, research, and decision happen continuously within one environment, is redefining how site owners understand conversion.\n…As AI-powered search reshapes how people explore information, more of the journey now happens inside the experience itself.\n…Users now spend more of the journey inside AI experiences, shaping visibility and engagement in new ways. As a result, engagement is shifting upstream (pre-click) within summaries, comparisons, and conversational refinements, rather than through multiple outbound clicks.”\nThe change in which discovery, research, and decision making all happen inside the AI Search explains why traditional click-focused metrics are losing relevance. The customer journey is happening within the conversational AI environment, so the signals that are beginning to matter most are the ones generated before a user ever reaches a website. Visibility now depends on how well a brand’s information contributes to the summaries, comparisons, and conversational refinements that form the new upstream engagement layer.\nAI Search has enabled consumers to do deeper research and comparisons during the early and middle part of the buying cycle, a significant change in consumer behavior.\nIn a podcast from May of this year, Michael Bonfils ( LinkedIn profile ) touched on this change in consumer behavior and underlined the importance of obtaining the signals from the consideration stage of consumer purchases. Read: 30-Year SEO Pro Shows How To Adapt To Google’s Zero-Click Search\n“We have a funnel, …which is the awareness consideration phase …and then finally the purchase stage. The consideration stage is the critical side of our funnel. We’re not getting the data. How are we going to get the data?\nBut that’s very important information that I need because I need to know what that conversation is about. I need to know what two people are talking about… because my entire content strategy in the center of my funnel depends on that greatly.”\nMichael suggested that the keyword paradigm is inappropriate for the reality of AI Search and that rather than optimize for keywords, marketers and business people should be optimizing for the range of questions and comparisons that AI Search will be surfacing.\n“So let’s take the whole question, and as many questions as possible, that come up to whatever your product is, that whole FAQ and the answers, the question, and the answers become the keyword that we all optimize on moving forward.\nBecause that’s going to be part of the conversation.”\nBing’s blog post confirmed this aspect of consumer research and purchases, confirming that the click is happening more often on the conversion part of the consumer journey.\nBing recommends using their Webmaster Tools and Clarity services in order to gain more insights into how people are engaging in AI search.\n“Bing Webmaster Tools continues to evolve to help site owners, publishers, and SEOs understand how content is discovered and where it appears across traditional search results and emerging AI-driven experiences. Paired with Microsoft Clarity’s AI referral insights, these tools connect upstream visibility with on-site behavior, helping teams see how discovery inside summaries, answers, and comparisons translates into real engagement. As user journeys shift toward more conversational, zero-UI-style interactions, these combined signals give a clearer view of influence, readiness, and conversion potential.”\nThe emphasis for brands is to show up in review sites, build relationships with them, and try as much as possible to get in front of consumers and build positive word of mouth.\nFor news and informational sites, Bing recommends providing high-quality content that engages readers and providing an experience that will encourage readers to return.\n“Rather than focusing on product-driven actions, success may depend on signals such as read depth, article completion, returning reader patterns, recirculation into related stories, and newsletter sign-ups or registrations.\nAI search can surface authoritative reporting earlier in the journey, bringing in readers who are more inclined to engage deeply with coverage or return for follow-up stories. As these upstream interactions grow, publishers benefit from visibility into how their work appears across AI answers, summaries, and comparisons, even when user journeys are shorter or involve fewer clicks.”\nI have been a part of the SEO community for over twenty-five years and I have never seen a more challenging period for publishers than what we’re faced with today. The challenge is to build a brand, generate brand loyalty, focus on the long-term.\nHow AI Search Is Changing the Way Conversions are Measured"
  }
]