[
  {
    "url": "https://martech.org/3-strategies-for-killing-ai-slop-in-your-email-copy/",
    "title": "3 strategies for killing AI slop in your email copy",
    "date": "2026-01-16T13:19:00+00:00",
    "content": "Can you guess Merriam-Webster’s 2025 Word of the Year ? Yep, it’s slop — “digital content of low quality that is produced usually in quantity by means of artificial intelligence.”\nIf you spend any time on LinkedIn, you’ve probably seen it everywhere. And you’ve definitely seen people complaining about it. But AI slop isn’t just a social media problem. It’s quietly hurting trust, engagement and conversions in the inbox.\nJay Schwedelson recently shared data suggesting that AI-sounding language negatively impacts email engagement rates . That’s the trade-off many teams are making right now. Use LLMs without strong editing and QA systems, and you risk damaging engagement, sender reputation and brand trust.\nAnd if this feels like one of those “it won’t happen to us” scenarios, keep reading. Odds are you’ll find at least one fix you can apply immediately.\nThere are three strategies that can help teams eliminate AI slop without giving up speed. None of them is flashy, but they work.\nThe first step in improving and humanizing your email campaigns is a better brief. I’m serious.\nStrong messaging briefs provide strategy, structure and a persuasive sales or marketing argument for every email you send. They help align the offer with the audience, the audience’s stage of awareness and the campaign’s business goals.\nA solid brief supports stronger engagement and better results. It also helps humanize your content. That matters because one of the biggest reasons people dislike AI slop is that it feels thoughtless and irrelevant, relying on vague, generic claims and promises.\nA good brief protects the intent, relevance and substance of every email. If you don’t already have an email messaging brief, you can use mine .\nEditing is a skill. It’s also a process you can and should train your team on, especially if you’re using LLMs to help produce email campaigns. A basic editing workflow would look like this:\nThis is where a strong brief saves time and prevents adverse outcomes. A quick scan of the messaging brief helps confirm whether the copy meets its core objectives:\nNext, confirm that each email uses a structure that supports the intended objective or target metric.\nThe core principle is simple. The copy structure should match the outcome you want the email to drive. If the target segment is in contact or lead status, or top of funnel, emails tend to perform better with an attention-interest-desire-action structure.\nFor mid-funnel segments, starting with the problem and using a problem-agitation-solution structure is often more effective. Ideally, structure guidance is built directly into your messaging brief and copy workflow.\nI’ve previously covered the copy cascade of angles, hooks and copy structure in a MarTech article on event emails for readers who want to go deeper.\nFinally, it’s time to polish and humanize the copy at the individual line level using editing sweeps or editing passes. I’m pulling these sweeps from the outstanding work of Chris Silvestri and Joanna Wiebe of Copyhackers (she’s done work for Intuit and Shopify, among others). The sweeps are: ​\nIn this final step, you review the email copy to ensure it passes the sweeps outlined above. Yes, it’s a lot of steps. Yes, it’s rigorous. But that’s how excellent content is made. It doesn’t take as long as you think, either. Silvestri has a solid guide to turning this into a GPT if you’re interested.\nIf you can’t be the person creating briefs and running edits and sweeps, assign or train someone on your team to do it and build systems around the work. You can also outsource the job or the system building to an expert.\nNo matter how you approach it, LLM-generated content needs a skilled human to review and vet every output before it goes live. When anyone can generate an email campaign in seconds, LLMs alone are not a differentiator. Making sure the offer, message and copy are positioned to perform in the inbox is."
  }
]