[
  {
    "url": "https://www.searchenginejournal.com/december-core-update-more-brands-win-best-of-queries/564313/",
    "title": "December Core Update: More Brands Win “Best Of” Queries via @sejournal, @MattGSouthern",
    "date": "2026-01-05T16:00:01+00:00",
    "content": "Google’s December core update ran from December 11 to December 29. Early analysis shared after the rollout points to a familiar pattern. Sites with narrower, category-specific strength appear to be gaining ground against broader, generalist pages in several verticals.\nAleyda Solís, International SEO Consultant and Founder at Orainti, published an analysis on LinkedIn breaking down the update’s impact across publications, ecommerce, and SaaS categories.\nBased on the examples Solís shared, the update appears to reward pages that match the query with direct category expertise. The effect shows up most clearly on “best of” and mid-funnel product terms.\nPublication sites lost rankings for “best of” and broader queries that Google had previously treated as informational. Brands and commercial sites with direct product authority now rank better for these terms.\nSolís cited Games Radar guides dropping for queries like “Best Steam Deck Games,” “Best Coop Games,” and “Upcoming Video Games.” Nintendo and Epic Games catalog pages increased for the same queries.\nBroader retailers lost ground on mid-funnel product queries to specialized retailers and brands showing specific authority in product categories.\nMacy’s decreased for “winter boots women,” “winter coats,” and “men’s cologne.” Columbia, The North Face, and Fragrance Market increased for those same terms.\nNon-specialized SaaS platforms and publications dropped for software-related queries. More specialized software sites gained with targeted landing pages and resource content.\nZapier, Adobe, and CNBC decreased for queries like “Accounting Software for Small business” and “sole trader accounting software.” Freshbooks and Xero increased with dedicated landing pages.\nSolís called the update “yet another iteration to reward specialization, expertise and showcase more commercially oriented content from brands or specialized retailers, rather than generic ecommerce platforms or publications.”\nNews publishers saw heavy volatility during the update.\nWill Flannigan, Senior SEO Editor for The Wall Street Journal, shared SISTRIX data showing India-based news publishers lost visibility on U.S. search results. Hindustan Times, India Times, and Indian Express all showed downward trajectories.\nGlenn Gabe, President of G-Squared Interactive, tracked movement across news sites throughout the rollout. He noted impacts across Discover, Google News, and Top Stories.\n“There was a ton of volatility with news publishers with the December broad core update,” Gabe wrote on LinkedIn . “And it’s not just India-based publishers… it’s news publishers across many countries (including a number of large publishers here in the US dropping or surging heavily).”\nDuring the rollout, some publishers reported steep Discover declines. Glenn Gabe wrote that publishers he spoke with “lost a ton of Discover visibility/traffic.”\nFor news specifically, this is worth tracking alongside Google’s Topic Authority system . That system surfaces expert sources for certain “newsy” queries in specialized topic areas.\nWe covered Topic Authority when it launched . The December volatility suggests Google continues to lean into depth signals for news, even if the mechanics differ by surface and query type.\nThis update adds to a trend generalist sites have felt for years. Holding broad, non-specialized rankings gets harder when brands and specialist sites publish pages that map cleanly to the product category.\nIn NewzDash data shared by John Shehata , Google Web Search’s share of traffic from Google surfaces to news publishers fell from about 51% to about 27% over two years, while Discover’s share increased.\nThat doesn’t explain why Google made changes, but it helps explain why Discover volatility hits harder when a core update rolls through.\nAdditionally, the pattern suggests Google may be reclassifying “best of” queries as having commercial rather than informational intent.\nIn ecommerce, specialized retailers are outranking larger platforms in mid-funnel queries because they demonstrate category authority. For publishers creating product recommendation content, you now face direct competition from the brands themselves.\nFor news publishers, the volatility in Discover creates a planning problem. When updates hit this channel, the traffic loss can be swift for publishers who lack a specific niche focus.\nThe December core update completed on December 29 after an 18-day rollout.\nSites affected by the update can review Google’s guidance on core updates . For sites hit by the specialization tilt, the path forward likely involves showing deeper expertise in narrower topic areas rather than competing on breadth."
  }
]