[
  {
    "url": "https://blog.hubspot.com/marketing/3-bitter-truths-all-marketers-need-to-hear-right-now",
    "title": "3 bitter truths all marketers need to hear right now",
    "date": "2025-12-02T16:40:18+00:00",
    "content": "When I saw a LinkedIn post from today’s master declaring, “Marketing’s job is not to drive revenue,” I did a little shimmy and thought, “ She gets it! ”\nWe struck up a conversation, and I discovered an entire pharmacopeia of tough pills to swallow. “I love talking smack about marketing!” she grinned.\nI asked for three of the bitterest truths that marketers need to hear. And, folks… it’s time to take your medicine.\nEvery CMO in the audience just reflexively jerked towards the “unsubscribe” button. Stick with us here.\n“The problem with being focused on revenue is that your marketing feels like you’re just throwing spaghetti at the wall,” says Oloyede. “You just chase leads all day. ‘They didn’t click my email, let me move on to the next topic, and see if that works. And you jump and jump and jump.’ ”\nShe points out that the instant gratification within digital marketing has raised a generation of marketers who have never been given the fundamentals. Which works until it doesn’t.\n“I was raised in the digital marketing space. I didn’t know a time before that. And when I went to grad school, I realized: We’re not actually doing marketing. We’re sending out content and getting leads. But we’re not building relationships, communicating effectively, and trying to build affinity.”\n“You can’t serve two masters. If I serve the CEO, that’s revenue. If I’m going to serve the customer, I have to slow down. I have to have patience.”\n“The word ‘strategy’ gets thrown around a lot and it is bastardized to hell. Demand gen is not a strategy. Demand gen is the execution of a strategy.”\n“A typical marketing campaign is: Let’s pick a topic, create content around that topic, then collect leads and just email the crap outta them until they die. That’s not a strategy.”\n“Juxtapose that against the Dove Real Beauty campaign. A multi-year, consistent story based on the consumer psychology of women not feeling beautiful in their bodies due to beauty standards. That’s a strategy.”\nInstead of one-off pieces of content that jump from topic to topic, all marketing efforts — whether lead gen, demand gen, or brand awareness — fed back to Dove’s core message.\nAnd that message didn’t come from Dove simply throwing spaghetti at the wall until they found the noodle that stuck.\nOloyede lays out the process: “I’m hearing my audience say they’re scared to move forward with new software. They’re worried about lack of resources. This is my campaign to combat that messaging. These are the activities that support that campaign. We’re going to run it for a year. Our baseline metrics are going to be trials. I need six months to get X amount of trials. If we’re missing the mark, here’s what I’m going to adjust. If we hit the mark, you give me X more dollars to expand. Agree? Agree. THEN you go execute.”\nIt’s slow. It’s hard. It’s laborious. And as AI allows competitors to flood every channel with self-same slop, it’s the only thing that will stand out.\n“Technology is not going to fix your marketing problems,” Oloyede says. “People think I’m an anti-technologist. I’m not. [The technology is] just out of order.”\nWhether it’s AI, analytics software, or even (gulp) your CRM, it’s important to realize that these are tools that do tasks. The why behind those tasks has to come first.\n“Technology is only going to execute, manage, and operationalize. That’s it. It works when it’s supporting good, foundational marketing principles. So if you don’t understand your market, if you’re not confident in your message, if you don’t understand your audience psychologically, emotionally, culturally, then you have to go back to the drawing board.”\nAnd once you’ve got all that, you can set your tools on autopilot, right? Not quite.\n“We need to add in those human touches to all those digital tactics. [Currently,] we send leads to a 10-touch automated nurture campaign and then over to Sales to see if there’s a buying intent. And then discard them if they’re not ready to buy.”\n“What if, instead, you invited them to a small, intimate focus group? Or a premiere event? Some kind of human touch where they saw you face-to-face. How much more likely are they to open your email?”\nAnd here we rediscover that ancient marketing wisdom nearly lost to the ages:\n“People buy from people. People buy from people they like, they trust, they have a connection with. The more you do that, the more you’re going to be successful.”"
  }
]