[
  {
    "url": "https://www.searchenginejournal.com/scoring-my-2025-predictions/562959/",
    "title": "Scoring My 2025 Predictions via @sejournal, @Kevin_Indig",
    "date": "2025-12-10T14:30:44+00:00",
    "content": "Boost your skills with Growth Memo’s weekly expert insights. Subscribe for free !\nEvery year, I hold myself accountable for my previous predictions by scoring them.\nThis year, I got three misses, two mixed results, and five hits:\nThought Process : When I made this prediction, I assumed that once models improved at reasoning, usage would shift from chat to action, and agents would become the obvious next step.\nReality: While general LLM usage (like Gemini and ChatGPT) cleared +800 million weekly users, true autonomous agent adoption, where the AI performs complex actions like “buying a product” without oversight, remained a niche power-user feature with very wonky performance.\nI over-weighted the speed of productization and user trust, and under-weighted how slow people are to let software spend their money or act without supervision.\nThought Process : Here, I zoomed out from early signals like Chegg and Stack Overflow and treated them as the first visible cracks in a broader margin collapse. My bet was that whenever AI sits between buyers and a labor-intensive industry, the middle layer will feel the pain first.\nReality : By Q3 2025, major call center outsourcing firms faced a crisis as enterprise clients switched to “AI Voice First” support layers. Translation services continued to shrink as browser-based, real-time AI translation became native to OS updates.\nThought Process : This call came from watching clients quietly stitch together AirOps, Make, Zapier, and custom scripts while headcount stayed flat or shrank. I expected economic pressure plus better tooling to push marketing toward “systems thinking,” where workflows matter more than channels.\nReality : “System building” became the primary skill on marketing job descriptions in 2025.\nWith marketing budgets remaining tight, the reliance on “Team of One” structures powered by automation chains (Make, Zapier, custom AI workflows) became the industry standard.\nThought Process : I read AI Overviews as an experiment, not a finished product, and assumed Google would iterate toward more personalized, richer SERP formats once multimodal models matured. The underlying belief was that Google had to change the page itself to defend its moat against standalone LLMs.\nReality: Google tested its Web Guide SERP layout extensively as of November. For me (opted into SGE, Search Generative Experience), it’s still the default. Instead of a standard list of blue links or a single AI answer at the top, “Web Guide” breaks the entire search result page into AI-generated “buckets” or headlines.\nThought Process : I assumed that once Reddit showed up for everything from product searches to troubleshooting, marketers would have no choice but to treat it like a core performance channel, not a side project. When you compare ad revenue from Meta and Alphabet platforms with how visible they are in Search, Reddit’s upside becomes clear.\nReality : Reddit had a banner year in 2025. Ad revenue grew 61% YoY Q1 2025 – and then another +68% in Q3 (to $585M). With Google Search continuing to prioritize forum discussions, Reddit became an unavoidable placement for advertisers seeking high-intent traffic.\nThought Process : I expected especially B2B sites to move tactically and fast by feeding bots a cleaner, more structured version of their sites once it became clear LLMs rewarded that pattern. Underneath sat the assumption that people would quietly bend the rules if there was upside and no obvious penalty.\nReality : The “Bot-Only Web” did not emerge via cloaking; it emerged via APIs and paywalls. Instead of creating optimized versions for bots (cloaking), most major publishers aggressively blocked bots via robots.txt and lawsuits (e.g., The New York Times vs. OpenAI continuing saga).\nThought Process : I treated the Shopping tab as Google’s sandbox for a future Amazon competitor, similar to how past tab experiments leaked into the main SERP. The core belief was that Google would push harder on shoppable, personalized results in the face of AI pressure and ecommerce growth needs.\nReality : Google kept the main search tab distinct. While the Shopping experience became more personalized and AI-driven (often resembling a feed), Google did not replace the default search experience with the Shopping tab interface for commercial queries.\nThought Process : Here, I connected the dots between rapidly improving generative tools and the constant pressure on creators to ship more content with the same or less budget. I assumed that once tools like Sora, Veo, and ElevenLabs crossed a basic quality bar, they would seep into production pipelines even if audiences could still tell something was synthetic.\nReality : 2025 was the year of the “Synthetic Creator.” YouTube had to update its partner program policies in July 2025 specifically to manage the flood of AI-generated content. Despite the crackdown on “AI slop,” high-quality AI-generated B-roll and voiceovers became standard for millions of creators.\nThought Process : I read the DOJ case as a structural threat to Google’s distribution deals and assumed judges would eventually push on the default search arrangements. My framing was that even a partial unwind of exclusivity could shift how search power is negotiated, without instantly changing who “wins” search. Judge Mehta’s first conclusion sounded a lot like he would take a hard stance on remedies.\nReality : The DOJ remedy ruling in September 2025 was disappointing. A toothless tiger. The court prohibited Google from paying for default exclusivity on browsers (Chrome/Safari) and devices, but:\nSo, was it really a divorce or a forced transition to an open marriage?\nThought Process : This prediction came from treating smart glasses as the logical next hardware surface for AI assistants, especially with Meta gaining traction. I assumed that OpenAI plus Jony Ive, or Apple’s need for a new device story, would pull a prototype into the public eye even if real adoption stayed years out.\nReality : On November 24, 2025, OpenAI CEO Sam Altman and designer Jony Ive officially confirmed that their joint hardware venture (under the startup “LoveFrom”) had a finished prototype during an interview hosted by Laurene Powell Jobs. The device was described as “screen-free” and “less intrusive than a phone,” aligning with the “smart glasses” or “AI Pin” form factor predictions.\nHowever, it’s not yet proven that OpenAI will publish glasses. It might also be some sort of necklace device. Meanwhile, Apple did not announce a new product and is dealing with leadership issues instead. And then, just before I hit publish on this Memo, Google announced new smart glasses for 2026.\nFor those of us in tech and digital marketing, we’re going to remember 2025 as the year the AI-driven “pilot programs” ended and official “deployment” began.\nNot only internally across our teams, workflows, and tech stacks, but we also watched classic search habits (informed by decades of human + search engine behavior) transform right in front of us.\nWe didn’t get the sci-fi future of agents buying our groceries (Pred No. 1) or widespread smart glasses (Pred No. 10) just yet.\nInstead, we got something more pragmatically disruptive: A world where marketing teams are half the size but twice as technical, where BPO industries (business process outsourcing) are collapsing, and where “Googling it” increasingly means “Reading a Reddit thread summarized by an AI.”"
  }
]