[
  {
    "url": "https://www.searchenginejournal.com/google-reveals-the-top-searches-of-2025/563738/",
    "title": "Google Reveals The Top Searches Of 2025 via @sejournal, @MattGSouthern",
    "date": "2025-12-23T14:00:25+00:00",
    "content": "In 2025, Google’s AI tool Gemini topped global searches. People tracked cricket matches between India and England, looked up details on the new Pope, and searched for information about Iran and the TikTok ban. They followed LA fires and government shutdowns.\nBut between the headlines, they also looked up Pedro Pascal and Mikey Madison. They wanted to make hot honey and marry me chicken. They planned trips to Prague and Edinburgh. They searched for bookstores from Livraria Lello in Porto to Powell’s in Portland.\nGoogle’s Year in Search tracks what spiked. These lists show queries that grew the fastest relative to 2024, ranging from breaking news to entertainment, sports, and lifestyle. Together, they present a picture of what captured attention throughout the year.\nGoogle’s AI assistant Gemini became the top trending search globally, showing how widely AI tools were embraced throughout the year. The rest of the top 10 was filled with sports, with cricket matches between India and England, the Club World Cup, and the Asia Cup capturing a lot of public interest.\nThe US list reflected different priorities and diverged from global trends, with Charlie Kirk at the top and entertainment properties ranking highly. KPop Demon Hunters secured the second position.\nNatural disasters and political events shaped what news topics people were searching for. The LA Fires, Hurricane Melissa, and the TikTok ban drew worldwide interest, while in the US, folks were most often searching about topics like the One Big Beautiful Bill Act and the government shutdown.\nAI-generated content captured everyone’s attention in the US, with AI-created images and characters popping up all over different categories. The viral AI Barbie, AI action figures, and Ghibli-style AI art topped this year’s trends.\nMusic artists and political figures were among the most searched people worldwide. d4vd, Kendrick Lamar, and the newly elected Pope Leo XIV attracted the most international attention. In the US, searches mainly centered on political appointees such as Zohran Mamdani and Karoline Leavitt.\nBreakthrough performances drove increased actor searches. Mikey Madison saw a spike in global searches after her acclaimed role in Anora, while Pedro Pascal led searches in the US.\nExpected franchise entries and original films topped movie searches. Anora was the top globally, while KPop Demon Hunters gained US popularity, alongside major releases such as The Minecraft Movie and Thunderbolts.\nContemporary romance and classic literature were the most searched genres. Colleen Hoover’s “Regretting You” and Rebecca Yarros’s “Onyx Storm” topped both global and US charts, while George Orwell’s “Animal Farm” and “1984” saw a resurgence in popularity.\nPodcast searches were driven by political commentary and celebrity-hosted shows. The Charlie Kirk Show ranked first both worldwide and in the US, while sports podcast New Heights and Michelle Obama’s “IMO” gained attention in the US.\nInternational soccer tournaments attracted the most global sports searches. The FIFA Club World Cup, Asia Cup, and ICC Champions Trophy were the top interests worldwide, while in the US, searches centered on domestic events like the Ryder Cup and UFC championships.\nAnticipated game releases led search trends. Arc Raiders was the most-searched title globally, while Clair Obscur: Expedition 33 was the top search in the US, alongside popular titles such as Battlefield 6 and Hollow Knight: Silksong.\nEmerging artists and well-known musicians drove music searches. d4vd led in musician searches, whereas Taylor Swift led song rankings with various tracks, including “Wood” and “The Fate of Ophelia.”\nMajor cities and popular European destinations drove travel itinerary searches. Boston, Seattle, and Tokyo led domestic travel plans, while Prague and Edinburgh were notably popular for European trips.\nGoogle Maps data represents the most-searched locations on Maps in 2025.\nHistoric and iconic bookstores drew worldwide attention on Google Maps. Portugal’s Livraria Lello and Tokyo’s Animate Ikebukuro were the most searched internationally, while Powell’s City of Books in Portland ranked highest in US bookstore interest.\nThat’s what caught attention in 2025. People searched for breaking news about natural disasters and political changes. They tracked sports tournaments and looked up new AI tools. They followed major world events.\nAnd between those searches, they looked up actors after breakthrough performances, found recipes they saw on social feeds, and planned trips to places they’d been thinking about for years.\nThe trends don’t tell you what mattered most. They tell you what people were curious about when they had a spare moment, whether that was understanding a major news event or finding the perfect travel itinerary.\nYou can watch the full Google Year In Search video below:\nThe full Year in Search data is at trends.withgoogle.com/year-in-search/2025 ."
  }
]