[
  {
    "url": "https://www.searchenginejournal.com/seo-pulse-ai-mode-hits-75m-users-gemini-3-flash-launches/563725/",
    "title": "SEO Pulse: AI Mode Hits 75M Users, Gemini 3 Flash Launches via @sejournal, @MattGSouthern",
    "date": "2025-12-19T14:00:13+00:00",
    "content": "In this week’s Pulse: updates include AI Mode’s growth and missing features, what Google’s latest model brings to search, and what drives citations across different AI experiences.\nGoogle’s Nick Fox confirmed that AI Mode has reached 75 million daily active users, but the personal context features promised at I/O are still in internal testing.\nGoogle launched Gemini 3 Flash with improved speed and performance. Ahrefs research showed AI Mode and AI Overviews cite different URLs.\nHere’s what matters for you that happened this week.\nGoogle’s Nick Fox confirmed AI Mode has grown to 75 million daily active users worldwide, but acknowledged personal context features announced at I/O seven months ago remain in internal testing.\nIn an interview on the AI Inside podcast , Fox said personal context features that would connect AI Mode to Gmail and other Google apps are “still to come” with no public timeline.\nAI Mode queries run two to three times longer than traditional searches. Google rolled out a preferred sources feature globally and announced improvements to links within AI experiences.\nThe personal context delay affects how you should think about AI Mode optimization. If you’ve been preparing for a world where AI Mode knows users’ email confirmations and calendar entries, that world isn’t arriving soon. Currently, users manually add context to longer queries.\nThat changes what you prioritize. Content still needs to answer the longer, more specific questions users are asking. But the automated personalization layer that might have made some informational queries feel self-contained inside Google’s interface isn’t active yet.\nThe 75 million daily active user figure matters for traffic planning. AI Mode is no longer a small experiment. It’s a significant channel that’s still evolving. The query length data (two to three times longer than traditional searches) suggests users are having conversations rather than making quick lookups, which affects what content formats and depth work best.\nAI Inside shared additional highlights on LinkedIn:\n“Nick Fox suggests that optimizing for Google’s AI experiences mirrors the approach for traditional search: building a great site with great content\n… focus on building for users and creating content that resonates with human readers.”\nRead our full coverage: Google’s AI Mode Personal Context Features “Still To Come”\nGoogle launched Gemini 3 Flash, its latest AI model focused on speed and efficiency, and immediately shipped it in search products.\nGemini 3 Flash delivers improved performance across benchmarks while maintaining faster response times than previous models. It’s now the default model in the Gemini app, and AI Mode for Search.\nGoogle’s shipping speed for Gemini 3 Flash suggests how AI model updates might flow into search products going forward. Rather than waiting months between model releases and search integration, you’re now dealing with immediate deployment of new models that can change how AI features behave.\nFaster performance matters for user experience in AI Mode and AI Overviews, where latency affects whether people continue using it or switch to traditional results. Faster models make longer multi-turn interactions more practical, potentially leading to more search sessions.\nRobby Stein, SVP of Product for Google Search, posted about the rollout on LinkedIn:\n“3 Flash brings the incredible reasoning capabilities of Gemini 3 Pro, at the speed you expect of Search. So AI Mode better interprets your toughest, multi-layered questions – considering each of your constraints or requirements – and provides a visually digestible response along with helpful links to dive deeper on the web.”\nRhiannon Bell, VP of user experience for Google Search, noted that this update brings Gemini 3 Pro to more users. Bell highlights the ability of 3 Pro to redesign search results:\n“My team is constantly thinking about what “helpful” design means, and Gemini 3 Pro is allowing us to fundamentally re-architect what a helpful Search response looks like.\nHema Budaraju, vice president of product management for Search at Google, highlighted the “speed and smarts”:\n“As product builders, we often need to balance speed and smarts. Today, we’re bringing that even closer together: Gemini 3 Flash is rolling out globally in Search as the new default model for AI Mode… We’re also putting our Pro models in more hands. Gemini 3 Pro is now available to everyone in the U.S\nRead our full coverage: Google Gemini 3 Flash Becomes Default In Gemini App & AI Mode\nAhrefs analyzed 730,000 query pairs and found AI Mode and AI Overviews reach semantically similar conclusions 86% of the time, but cite the same specific URLs just 13.7% of the time.\nAhrefs compared AI Mode and AI Overview responses across identical queries. While both experiences frequently agree on general information, they’re pulling that information from different sources.\nYou’re dealing with a split optimization target. Getting cited in AI Overviews doesn’t automatically get you cited in AI Mode, even when both systems are answering the same query with similar information. These are two separate citation engines, not one system with different interfaces.\nIf you track which AI experience appears for your target queries, you can focus citation efforts accordingly. For queries where AI Mode dominates, publishing frequency and content freshness may matter more. For queries where AI Overviews appear, authority signals and deep resource coverage may matter more.\nThe 13.7% overlap suggests many sites will see uneven results across surfaces. You might do well in one experience without automatically carrying that visibility into the other.\nDespina Gavoyannis, senior SEO specialist at Ahrefs, summarized the results on LinkedIn :\n“Only 13.7% citation overlap … 86% semantic similarity … In short, 9 out of 10 times, AI Mode and AI Overviews agreed on what to say; they just said it differently and cited different sources.”\nRead our full coverage: Google AI Mode & AI Overviews Cite Different URLs, Per Ahrefs Report\nEach story this week shows AI search moving from promise to operational reality.\nAI Mode’s 75 million daily users and immediate Gemini 3 Flash deployment reveal Google’s AI features are production systems at scale, not experimental labs. The personal context delay shows the gap between what was announced and what’s shipping. The citation study quantifies how these systems work differently despite appearing similar.\nFor you, this week’s about treating AI search as current infrastructure rather than future speculation. Optimize for how AI Mode and AI Overviews work today, longer manual queries without personal context, immediate model updates that can change behavior, and separate optimization targets for each experience.\nThe features Google promised at I/O aren’t here yet, but 75 million people are using what is here."
  }
]