[
  {
    "url": "https://www.searchenginejournal.com/google-how-to-rank-in-ai/563620/",
    "title": "Google Explains How To Rank In AI Search via @sejournal, @martinibuster",
    "date": "2025-12-18T10:17:11+00:00",
    "content": "Google’s John Mueller and Danny Sullivan discussed their thoughts on AI search and what SEOs and creators should be doing to make sure their content is surfaced. Danny showed some concern for folks who were relying on commodity content that is widely available.\nJohn Mueller asked Danny Sullivan what publishers should be focusing on right now that’s specific to AI. Danny answered by explaining what kind of content you should not focus on and what kind of content creators should be focusing on.\nHe explained that the kind of content that creators should not focus on is commodity content. Commodity content is web content that consists of information that’s widely available and offers no unique value, no perspective, and requires no expertise. It is the kind of content that’s virtually interchangeable with any other site’s content because they are all essentially generic.\nWhile Danny Sullivan did not mention recipe sites, his discussion about commodity content immediately brought recipe sites to mind because those kinds of sites seemingly go out of their way to present themselves as generically as possible, from the way the sites look, the “I’m just a mom of two kids” bio, and the recipes they provide. In my opinion, what Danny Sullivan said should make creators consider what they bring to the web that makes them notable.\nTo explain what he meant by commodity content, Danny used the example of publishers who used to optimize a web page for the time that the Super Bowl game began. His description of the long preamble they wrote before giving the generic answer of what time the Super Bowl starts reminded me again of recipe sites.\nAt about the twelve minute mark John Mueller asked Danny:\n“So what would you say web creators should focus on nowadays with all of the AI?”\n“A key thing is to really focus on is the original aspect. Not a new thing.\nThese are not new things beyond search, but if you’re really trying to reframe your mind about what’s important, I think that on one hand, there’s a lot of content that is just kind of commodity content, factual information, and I think that the… LLM, AI systems are doing a good job of presenting that sort of stuff.\nSo the classic example, as you know, will make people laugh, …but every year we have this little American football thing called the Super Bowl, which is our big event.\n…But no one ever can seem to remember what time it’s on.\n…Multiple places would then all write their “what time does the Super Bowl start in 2011?” post. And then they would write these giant long things.\n…So, you know, and then at some point, we could see enough information and we have data feeds and everything else that we just kind of said, you do a search and …the Super Bowl is going to be at 3:30.\n…I think the vast majority of people say, that’s a good thing. Thank you for just telling me the time of the Super Bowl.\nNext Danny considered some of the content people are publishing today, encouraging them to think  about the generic nature of their content and to give some thought to how they can share something more original and unique.\n“I think that is a thing people need to understand, is that more of this sort of commodity stuff, it isn’t going to necessarily be your strength.\nAnd I do worry that some people, even with traditional SEO, focus on it too much.\nThere are a number of sites I know from the research and things that I’ve done that get a huge amount of traffic for the answer to various popular online word-solving games.\nIt’s just every day I’m going to give you the answer to it. …and that is great. Until the system shifts or whatever, and it’s common enough, or we’re pulling it from a feed or whatever, and now it’s like, here’s the answer.”\nDanny next suggested that people who are concerned about showing up in AI should start exploring how to express their authentic experience or expertise. He said this advice is not just for text content but also to video and podcast content as well.\n“Your original voice is that thing that only you can provide. It’s your particular take.\nAnd so that’s what we think was our number one thing when we’re telling people is like, this is what we think your strength is going to be.\nAs we go into this new world, is already what you should be doing, but this is what your strength that you should be doing is focus on that original content.\nI think related to that is this idea that people are also seeking original content that’s, …authentic to them, which typically means it’s a video, it’s a podcast…\n…And you’ve seen that in the search we’ve already done, where we brought in more social, more experiential content.  Not to take away from the expert takes, it’s just that people want that.\nSometimes you’re just wanting to know someone’s firsthand experience alongside some expert take on it as well.\nBut if you are providing those expert takes, you’re doing reviews or whatever, and you’ve done that in the written form, you still have the opportunity to be doing those in videos and podcasts and so on.  Those are other opportunities.\nSo those are things that, again, it’s not unique to the AI formats, but they just may be, as you’re thinking about, how do I reevaluate what I’m doing overall in this era, that these are things you may want to be considering with it from there.”\nJohn Mueller agreed that it makes sense to bring your unique voice to content in order to make it stand out. Danny’s point treats visibility in AI driven search as a matter of differentiation rather than optimization. The emphasis is not on adapting content to a new format, but on creating a recognizable voice and perspective with which to stand out.  Given that AI Search is still classic search under the hood, it makes sense to stand out from competitors with unique content that people will recognize and recommend."
  }
]