[
  {
    "url": "https://www.searchenginejournal.com/google-year-in-search-2025-gemini-deepseek-top-trending-lists/562440/",
    "title": "Google Year In Search 2025: Gemini, DeepSeek Top Trending Lists via @sejournal, @MattGSouthern",
    "date": "2025-12-04T08:01:25+00:00",
    "content": "Google released its Year in Search data, revealing the queries that saw the largest spikes in search interest.\nAI tools featured prominently in the global list, with Gemini ranking as the top trending search worldwide and DeepSeek also appearing in the top 10.\nThe annual report tracks searches with the highest sustained traffic spikes in 2025 compared to 2024, rather than total search volume.\nGemini topped the global trending searches list, reflecting the growth of Google’s AI assistant throughout 2025.\nDeepSeek, the Chinese AI company that drew attention earlier this year, appeared in both the global (#6) and US (#7) trending lists.\nThe US list diverged from global trends, with Charlie Kirk leading and entertainment properties ranking high. KPop Demon Hunters claimed the second spot.\nA dedicated “Trends” category in the US data showed AI content creation drove search interest throughout 2025.\nThe Ghibli entry likely reflects the viral AI-generated images mimicking Studio Ghibli’s animation style that circulated on social media platforms.\nNews-related trending searches reflected the year’s developments. Globally, the top trending news searches included the LA Fires, Hurricane Melissa, TikTok ban, and the selection of a new pope.\nUS news trends focused on domestic policy, with the One Big Beautiful Bill Act and tariffs appearing alongside the government shutdown and Los Angeles fires.\nThis data shows where user interest spiked throughout 2025. The presence of AI tools at the top of global trends confirms continued growth in AI-related search behavior.\nThe split between global and US lists also shows regional differences in trending topics. Cricket matches dominated global sports interest while US searches leaned toward entertainment and policy.\nGoogle’s Year in Search data is available on the company’s trends site.\nComparing this year’s trending topics against your content calendar can reveal gaps in coverage or opportunities for timely updates to existing content."
  }
]