[
  {
    "url": "https://www.searchenginejournal.com/so-you-want-to-paywall/562878/",
    "title": "So You Want To Paywall?",
    "date": "2025-12-09T14:30:06+00:00",
    "content": "There are three inevitabilities in life. Death, taxes, and big tech companies dumping on the little guy. As zero-click searches reach an all-time high and content is stolen and repurposed for the gain of the almighty tech loser, there’s only one viable solution.\nTo create a value exchange that reduces reliance on third-party platforms. To become as self-sufficient as possible. Like an off-grid cabin or your mum’s basement, a paywall gives you a sense of security you just cannot put a price on.\nAs we’re all finding, any kind of reliance on these guys doesn’t put us in a good position. They do not want to send us traffic .\nYour traffic will decline. But guess what? You’re already hemorrhaging clicks and have been for some time. And traffic doesn’t pay the bills.\nThe only way to sustain rankings over time is with high-quality engagement data. Navboost stores and uses 13 months of data to identify good vs bad clicks, click quality, the last longest click, and on-page interactions to establish the most relevant content. All at a query level.\nPaywalls are not your friend when it comes to user engagement . Not for the masses. But for a small cohort of people who like you enough to pay, your engagement data will be excellent.\nIn an ultra-personalized world, you will still do well to the people who really matter.\nWe have data that pretty perfectly highlights the impact of a paywall on rankings. Over the course of three to four months in traditional search, your rankings start to steadily drop before settling in severe mediocrity. You’ve got to fight for every click. With great content, marketing, savviness. Everything.\nIn Google Discover – a highly personalized, click and engagement driven platform – this is even more pronounced. While Discover’s clickless traffic is lower quality, there will be a small cohort of highly engaged users that develop over time, you can target with a paywall.\nUnpaywall for the masses, build your owned channels, and paywall for the highly engaged. The platform will take care of the personalization for you.\nSo, maximize your value exchange with ads and email signups for most users, but don’t neglect those with a high return rate.\nThere’s some psychology involved in all of this. When a brand becomes widely known for paywalling, I suspect the likelihood of a click goes down as users know what to expect. Or maybe what not to expect.\nThis likely perpetuates over time, so you should clarify what articles are free to air.\nTo nail SEO bingo, it depends. It depends on what your value is in the market. There is a lot of free stuff out there already. But broadly rubbish. So as long as the bar keeps dropping, we’ll all be fine.\nI am old-ish. I like words. Writing great content isn’t easy and is usurped in many cases by richer, more visually striking content. Content that satisfies all types of users. Scanners, deep readers, listeners and get the answer and go-ers.\nIn some ways, you can satisfy all types of users more effectively than ever. I think you have to hit three of the four Es of content creation . Make it resonate , be consistent, and understand your audience . Whatever you create stands a chance.\nBut that doesn’t mean creating great stuff is any easier. If you work for a traditional publisher, the chances are you’ve brought a spoon to a gun fight. The war for attention is being fought on all fronts, and straight words are losing.\nFortunately, not every subscription model relies on the quality of the prose. It might be that you have unique data, granular insights into a specific market, or are just a bloody good laugh.\nUltimately, it comes down to your market, marketing, positioning and your USP. You have to know and speak to your audience and you have to stand out. As Barry would say, if you’re forgettable, you’re doomed .\nWhen it comes to paying for news, some markets are far more “advance” than others. The Scandinavian market is light-years ahead of almost everyone else when it comes to paying for news. You have to do your research to understand:\nWhile it doesn’t align perfectly, it’s not surprising that those most likely to pay for news have higher income levels . Higher disposable income tends to create an environment where people buy more stuff.\nBut that doesn’t tell the whole story. Norwegian news outlets have (apparently) a long history of trust with their audience and have never had access to free multi-day newspapers . Ditto other Scandinavian countries. In an age of rubbish and spin, trust and E-E-A-T are more important than ever.\nAnd while the UK sits in a pretty shocking-looking position, almost 24 million of us pay for a BBC license fee . That is, in essence, paying for news. Insert joke about BBC bias and woke cultural agendas here.\nCultural and societal factors really matter. As does your understanding of the market.\nImportant to note that according to Richard Reeves (AOP Director), Subscriptions have overtaken display advertising as the core source of digital revenue.\n“Most heartening is what this represents as the wider information ecosystem fractures: audiences recognise the value of professional journalism and are willing to pay for it.”\nIn an era of slop, paying for something good is not a bad thing.\nYou can only control what you can control. But you shouldn’t dismiss the wider climate.\nIn the UK and arguably globally, there is a cost-of-living crisis . Globally, there have been a number of very significant geopolitical issues that affect the wider economy. Money doesn’t go as far as it once did, and most subscriptions are a luxury purchase.\nIs a £20 or £30 monthly subscription more valuable than a £10 Netflix one? Or Spotify? These are questions you need to ask. Why would someone subscribe and stick around? How far your money goes has been declining for some time… (Image Credit: Harry Clarkson-Bennett)\nAnd we aren’t just competing with other publishers. While screen time and content consumption are at an all-time high, video consumption and the creator economy are booming.\nIt is quite literally a near half a trillion dollar market .\nNot strengths for traditional publishers. While there have been some very good success stories in recent times (see Wired turning their journalists into individual subscription machines ), legacy publishers need to adapt.\nSo your pricing strategy, customer service, and overall experience are hugely important. You are almost certainly going to be a nice-to-have. So make sure your customer journey and path to conversion are premium, and your audience feel listened to.\nYou need to speak to your audience. You don’t have to go into this blind. Forging real connections with people is not impossible and making them feel listened to will go a long way.\nYou can try to figure out what they really value, how much they’re willing to spend and what’s stopping them.\nNo. Content is designed to do different things, and not everything is a premium product. Whatever journalists will tell you. If you shut down your site entirely, you become too closed off an ecosystem in my opinion.\nLLMs do not respect paywalls. As it turns out, neither does Google .\nAs of just a few months ago, the search giant asked that publishers with paywalls change the way they block content to help Google out. The lighter touch paywall solution (a JavaScript-based one) includes the full content in the server response.\n“…Some JavaScript paywall solutions include the full content in the server response, then use JavaScript to hide it until subscription status is confirmed.\nThis isn’t a reliable way to limit access to the content. Make sure your paywall only provides the full content once the subscription status is confirmed.”\nAccording to Google, they are struggling to determine the difference. So the problem is on us, not them. They (and I strongly suspect other LLMs) are ingesting this content and training their models on us whether we like it or not.\nFor those of you who haven’t heard of Common Crawl , it stores a corpus of open web data accessible to “researchers.” By researchers, we now mean tech bros who don’t want to pay for, surprisingly, anything.\n“If you didn’t want your content on the internet, you shouldn’t have put your content on the internet.”\nIt doesn’t stop there either. Even if you block all non-whitelisted bots from accessing your site at a CDN level, you may have syndication partnerships in place. If so, it’s likely your content is making it out into the wider world.\nThe internet is not exactly a leakproof vessel. If you’re setting one up now, try to implement a server-side option .\nI have written about the types of paywall available to you and the pros and cons of each. Generally, I think a metered or dynamic paywall is the best option for most publishers. At the very least, a freemium model. Something that gives people enough to draw them in.\nAnd you can’t exactly draw them in if you just hard paywall everything.\nYou have to think of this as a full-blown marketing strategy. You need to know where people come from. How much of your content they have consumed. Whether it’s better to show them a newsletter signup as opposed to a paywall.\nIt is absolutely worth knowing that over time, a strong email database will convert far more effectively than a hard paywall.\nSo encouraging free signups and taking a longer-term view to conversions (you’ll need a good customer journey here) may be far more effective.\nThere are a number of paywall management options out there for publishers. Leaky Paywall, Zephr, Piano. There are plenty.\nThe best ones integrate with your existing tech stacks, have excellent personalization and customization options, deploy ad-blocking strategies, and run flexible gating strategies.\nLarger publishers tend to go with enterprise-level options with deep analytics and CRM integrations. Smaller publishers can work with lighter touch, cheaper operators. You really just need to scope out what will work best for you.\nParticularly when it comes to monthly costs and revenue share options.\nFocusing on Customer LTV shifts marketing from chasing traffic to profitable, loyal audience relationships. It makes businesses understand that not all audiences or subscriptions are created equal.\nYou generate more subs through paid media because the net is larger. But lots slip through the net. So you need a quality product (in both a product and marketing sense) alongside UX and customer service that reduces friction.\nSearch and owned channels are smaller, but far more likely to pay because they have taken an action to find you. In some cases, they actually want you in their inbox. The quality is higher, but the overall returns are lower.\nSubscriber revenue is so valuable because it’s predictable. Subscription business models have boomed for that very reason. A pound of subscriber revenue is far more valuable than almost anything else, and it should be the focus of your business.\nBut that doesn’t mean you put all your eggs in one basket. You can have multiple subscription types on your website, and that can help you become habitual with all types of users. But you need to add value to their lives every day.\nPuzzles, recipes, short and long-form videos, et al.\nBusinesses make money in many ways. A diverse business is resilient. Resilient to macro and micro factors that will decimate some publishers over the next few years. So talk to your audience, trial new ways of adding value, and commit when one works. Become habitual.\nAnd, shock horror, people want to belong to something. So while the digital experience is crucial, making an effort to connect with people IRL matters.\nThis post was originally published on Leadership in SEO ."
  }
]