[
  {
    "url": "https://www.searchenginejournal.com/social-channel-insights-in-search-console-what-it-means-for-social-search/564307/",
    "title": "Social Channel Insights In Search Console: What It Means For Social & Search via @sejournal, @rio_seo",
    "date": "2026-01-28T13:30:17+00:00",
    "content": "Google has been testing Social Channel Insights inside Google Search Console (GSC). This update may appear small, but it’s more than meets the eye. In the search landscape, these new social insights translate to a bigger shift happening behind the scenes, where search and social data converge to improve visibility.\nThe official announcement from Google highlighted the growth of businesses managing their digital presence on popular social media sites. The integration makes sense as social media continues to become a popular method for search discovery and information, with 15% of consumers believing social media to be the most accurate/current source to find up-to-date business details.\nThe expansion of the social report feature showcases performance for accounts Google associates with a website, allowing businesses a centralized location for reviewing key search and discoverability metrics. This update signifies just how intertwined search and social are becoming. Search and social should no longer be treated as disparate functions, but rather integral counterparts that must communicate and coordinate to improve online visibility and discovery.\nWhen digging into Google Search Console Insights to ascertain what exactly these new social metrics entail, we see a plethora of new information has been added. It appears as though this feature isn’t readily available to all, but is only showing up for some websites where Google was able to locate their social media channels. Of those who have seen the new social media report features, they’re seeing:\nRight now, it appears as though the social media metrics measured focus mostly on referral insights. This isn’t merely a slight tweak to the user experience. It could be seen as a strategic convergence of data, meant to shine a spotlight on how social goes hand in hand with search performance.\nGoogle doesn’t typically make updates for fun or convenience. Each update is a signal for what they plan to evaluate next as part of their never-ending quest to maintain dominancy in the search engine landscape.\nEven though Google hasn’t explicitly stated that social engagement metrics have direct influence, this could be an acknowledgement that discovery is increasingly happening on other channels, such as AI platforms and social media.\nSearch has fractured with other players joining the race, and Google is clearly noticing and adapting. In fact, a study found nearly a quarter ( 24% ) of U.S. adults use social media as their primary search method, while another 24% use search primarily but also social media occasionally. 78% of global internet users leverage social media to research brands and products, and over 60% of Gen Z consumers have purchased a product they’ve found on social media.\nSearch engines are no longer the sole place consumers start their sales journey. Users use AI to research and ask questions, or seek out online reviews and testimonies on social media channels. Search engines are becoming more of a validation layer, where users go after they research all the options to confirm information, or seek additional information, and then move to the transaction stage.\nWhen it comes to social, evaluating performance in the past may have looked like chasing more likes and comments. Engagement, of course, still matters, but Google is telling us what other insights we should consider, right inside your GSC dashboard.\nSocial referral insights give social media marketers visibility into how their content performs in the search discovery journey. Writing social posts to meet an arbitrary number or goal isn’t the end game. It’s about finding the posts that have the influence.\nFor social campaigns, social insights can help you:\nInstead of considering traditional social media metrics (such as comments, shares, or likes), social teams can use these new Social Channel Insights in GSC to increase online visibility.\nGoogle, if you’re reading this, here’s what we’d love to see beyond referral behavior to help marketers provide even more strategic value.\nSocial insights that could meaningfully support discovery-focused strategies include:\nBy adding the aforementioned signals, SEOs would be able to anticipate intent shifts earlier and inform content and social teams to draft meaningful and relevant content right away, not after the hype dies down. It’s a win for all teams as your time investment will lead to actual results.\nEven though this is a limited test and hasn’t impacted every business (yet),  it would be a good idea for marketers to review their social media channels and strategy to provide an exceptional experience across every channel customers find you.\nGoogle’s rollout of Social Channel Insights in GSC may seem like a minor advancement, but it’s more than just additional metrics to track for marketers. It signifies how Google is considering how the two disciplines share insights.\nSearch engines are factoring in the rise of discovery and influence taking place on social media channels. By bridging the gap, and working more closely together, social media marketers and SEOs should see each other as partners rather than once in a while collaborators. The result? Better workflows, collaboration, visibility, and business impact.\nMarketers who embrace a cross-collaboration mentality with SEOs will be better poised to appear in the moments that matter, being discovered and chosen."
  },
  {
    "url": "https://www.searchenginejournal.com/what-if-user-satisfaction-is-the-most-important-factor-in-seo/565933/",
    "title": "What If User Satisfaction Is The Most Important Factor In SEO? via @sejournal, @marie_haynes",
    "date": "2026-01-28T13:00:35+00:00",
    "content": "I’ve shared a bunch in this video and summarized my thoughts in the article below. Also, this is the second blog post I’ve written on this topic in the last week. There is much more information on user data and how Google uses it in my previous blog post.\nWe learned in the DOJ vs Google trial that Google’s ranking process involves three main components:\nThe DOJ vs. Google lawsuit talked extensively about how Google’s massive advantage stems from the large amounts of user data it uses. In its appeal , Google said that it does not want to comply with the judge’s mandate to hand over user data to competitors. It listed two ways it uses user data – in a system called Glue, a system which incorporates Navboost that looks at what users click on and engage with, and also in the RankEmbed model.\nRankEmbed is fascinating. It embeds the user’s query into a vector space. Content that is likely to be relevant to that query will be found nearby. RankEmbed is fine-tuned by two things:\n1. Ratings from the Quality Raters. They are given two sets of results – “Frozen” Google results and “Retrained” results – or, in other words, the results of the newly trained and refined AI-driven search algorithms. Their scores help Google’s systems understand whether the retrained algorithms are producing higher-quality search results.\n2. Real-world live experiments where a small percentage of real searchers are shown results from the old vs. retrained algorithms. Their clicks and actions help fine-tune the system.\nThe ultimate goal of these systems is to continually improve on producing rankings that satisfy the searcher.\nI’ve realized that Google’s live user tests aren’t just about gathering data on specific pages. They are about training the system to recognize patterns . Google isn’t necessarily tracking every single user interaction to rank that one specific URL. Instead, it is using that data to teach its AI what “helpful” looks like. The system learns to identify the types of content that satisfy user intent, then predicts whether your site fits that successful mold.\nIt will continue to evolve its process in predicting which content is likely to be helpful. It definitely extends far beyond simple vector search. Google is continually finding new ways to understand user intent and how to meet it.\nIf you’re ranking in the top few pages of search, you have convinced the traditional ranking systems to put you in the ranking auction.\nOnce there, a multitude of AI systems work to predict which of the top results truly is the best for the searcher. This is even more important now that Google is starting to use “ Personal Intelligence ” in Gemini and AI Mode . My top search results will be tailored specifically for what Google’s systems think I will find helpful.\nOnce you start understanding how AI systems do search, which is primarily vector search, it can be tempting to work to reverse engineer these. If you’re optimizing by using a deep understanding of what vector search rewards (including using cosine similarity), you’re working to look good to the AI systems. I’d caution against diving in too deeply here .\nGiven that the systems are fine-tuned to continually improve upon producing results that are the most satisfying for the searcher, looking good to AI is nowhere near as important as truly being the result that is the most helpful. I would argue that optimizing for vector search can do more harm than good unless you truly do have the type of content that users go on to find more helpful than the other options they have. Otherwise, there’s a good chance you’re training the AI systems to not favor you.\nMy advice is to optimize loosely for vector search . What I mean by this is to not obsess over keywords and cosine similarity, but instead to understand what it is your audience wants and be sure that your pages meet the specific needs they have. Is using a knowledge of Google’s Query Fan-Out helpful here? To some degree, yes, as it is helpful to know what questions users generally tend to have surrounding a query. But, I think that my same fears apply here as well. If you look really good to the AI systems trying to find content to satisfy the query fan-out, but users don’t tend to agree, or if you’re lacking other characteristics associated with helpfulness compared to competitors, you might train Google’s systems to favor you less.\nMake use of headings – not for the AI systems to see, but to help your readers understand that the things they are looking for are on your page.\nLook at the pages that Google is ranking for queries that should lead to your page, and truly ask yourself what it is about these pages that searchers are finding helpful . Look at how well they answer specific questions, whether they use good imagery, tables, or other graphics, and how easy it is for the page to be skimmed and navigated. Work to figure out why this page was chosen as among the most likely to be helpful in satisfying the needs of searchers.\nInstead of obsessing over keywords, work to improve the actual user experience. If you make your page more engaging, focusing more on metrics like scrolls and session duration, rankings should naturally improve.\nAnd mostly, obsess over helpfulness. It can be helpful to have an external party look at your content and share why it may or may not be helpful.\nI have found that even though I have this understanding that search is built to continually learn and improve upon showing searchers pages they are likely to find helpful, I still find myself fighting the urge to optimize for machines rather than users. It is a hard habit to break! Given that Google’s deep learning systems are working tirelessly on one goal – predicting which pages are likely to be helpful to the searcher – that should be our goal as well. As Google’s documentation on helpful content suggests , the type of content that people tend to find helpful is content that is original, insightful, and provides substantial value when compared to other pages in the search results.\nThis post was originally published on Marie Haynes Consulting ."
  }
]