[
  {
    "url": "https://www.searchenginejournal.com/google-isnt-going-anywhere-ahref-ambassador-on-llm-inclusion-relationships-still-win/561772/",
    "title": "Google Isn’t Going Anywhere: Ahrefs Ambassador On LLM Inclusion & Why Relationships Still Win via @sejournal, @theshelleywalsh",
    "date": "2025-11-25T13:00:23+00:00",
    "content": "There’s a divided line in the industry between those who think optimizing for AI is separate from SEO and those who think LLM discovery is just SEO. But, this is an unproductive argument, because whatever you think, LLM inclusion is now part of SEO discovery .\nSo, let’s just focus on how the search journey works now and where you can find real business value.\nTo discuss inclusion in LLMs, I invited Patrick Stox to the latest edition of IMHO to find out what he thinks. As product advisor, technical SEO, and brand ambassador at Ahrefs, Patrick has plenty of data to work with and insights into what’s actually working for LLM inclusion right now.\nIn the face of the AI takeover, Patrick’s take is that Google isn’t going anywhere, and he still thinks human relationships are critical.\nYou can watch the full interview with Patrick on IMHO below.\nWith the industry obsessing over ChatGPT, AI Overviews, and AI Mode , it’s easy to assume that traditional search really is dead. However, Patrick was quick to say, “I’m not betting against Google.”\n“Google is still everything for most people … Most of the people that are using [LLMs] are tech forward, but the majority of folks are still just Googling things”\nRecent Ahrefs data estimated that Google owns an estimated 40% of all traffic to websites, with LLM referrals still a fraction by comparison. Although Google’s share of traffic may be down a couple of percent this year, it still dominates.\nAfter experimenting with ChatGPT and Claude when they first launched, Patrick found himself returning to Google’s AI Mode and Gemini, and thinks others will do the same. “Even I just went back to Google,” he admitted. “I think we’re going to see more of that as they improve their systems.”\nGoogle continues releasing competitive AI innovations, and Patrick predicts these will pull many users back into Google’s ecosystem.\n“I’m not betting against Google,” he says. “They’ve got more data than anyone, and they’re still on the bleeding edge.”\nEven though sites are seeing growing referrals from LLMs, establishing attribution to any real value from LLM traffic is a challenge right now. We can talk about brand awareness, but C-Suite is only interested in business value.\nPatrick agreed that while you can count mentions and citations in AI answers, that doesn’t easily translate into board-level reporting.\n“You can measure how often you’re mentioned versus competitors … but going back to a business, I can’t report on that stuff. It’s all secondary, tertiary metrics.”\nFor Patrick, revenue and revenue-adjacent metrics still matter. That said, Ahrefs has had some signals from AI search traffic.\n“We did track the signups. When I first looked at this data back in July, all the traffic from AI search was half a percent of our traffic total. But at the time, it was 12.1% of our total conversions.” He explained.\nThis has now dropped below 10%, while the traffic share has grown slightly.\nI asked if Ahrefs is actively investing in LLM inclusion, and Patrick said they are trying a number of different things, and the two fundamental approaches that determine LLM visibility are repetition and differentiation.\n“Whatever the internet says, that’s kind of what’s being returned in these systems,”\nRepetition means ensuring consistent messaging across multiple websites. LLMs synthesize what “the internet says,” so if you want to be recognized for something, that narrative needs to exist broadly. For Ahrefs, this has meant actively spreading the message that they have evolved beyond just SEO tools into a comprehensive digital marketing platform.\nDifferentiation through original data works alongside the repetition to stand out. Ahrefs has invested heavily in unique data studies throughout the year, including non-English language research. “This data is being heavily cited, heavily returned in these systems because there’s nothing else out there like it,” Patrick explained.\nThe more surprising tactic that is also currently working is listicles.\n“I hate to say it, but listicles … they work right now. I don’t think it’s future-proof at all, but at the same time, I don’t want to just not be there.”\nI then asked about agentic AI and systems, and does Patrick have concerns about systems becoming closed.\nAs LLM agents begin booking travel , making purchases, or accessing APIs directly, most likely they would rely on a small set of partners from big brands.\n“ChatGPT isn’t going to make deals with unknown companies,” Stox says. “If they book flights, they’ll use major providers. If they use a dictionary, they’ll pick one dictionary.”\nThis would be the real threat to smaller businesses. “If an agent decides ‘we only check out through Amazon,’ a lot of stores lose sales overnight,” Patrick warns. There is no guaranteed defense. The only strategy we can follow right now is to grow your brand and footprint.\n“What was the thing they used to say for Google? Make them embarrassed to not have you included.”\nPatrick emphasized a point that’s possibly been forgotten in the AI hype: “It’s not ChatGPT that’s the second largest search engine , it’s still YouTube by far.”\nYouTube has been a hugely successful referral platform for Ahrefs, and the company invested heavily in video. Patrick recommends both long and short-form , for brand discovery.\nCommunity participation on platforms such as Reddit , Slack, and Discord also offers substantial value, but only when companies genuinely participate rather than spam.\nWhile many brands have tried to brute-force Reddit with spam, Patrick says there can be huge value in genuine participation, especially when employees are allowed to represent the company authentically.\n“You have literally a paid workforce of advocates who work for your company. Let them go out and talk to people … answer questions, basically advertise for you. They want to do it already. So let them.”\nAs a final question, I asked Patrick where he’d invest if launching a startup today; he did not hesitate to say relationships.\n“If I launched a startup, the first thing I’d invest in is relationships. That’s still the most powerful channel … I think if I did do something like that, I’d probably grow it pretty fast. More from my connections than anything else,” he said.\nAfter relationships, he’d focus on YouTube, website content creation, and telling friends about the product. In other words, “just normal marketing.”\n“We’ve gone through this tech revolution, and now we’re realizing everything still comes back to direct connections with people.”\nAnd that may be the most important insight of all. In an era of AI-driven discovery, the brands that win are the ones that remain unmistakably human.\nWatch the full video interview with Patrick Stox here:\nThank you to Patrick Stox for offering his insights and being my guest on IMHO .\nFeatured Image: Shelley Walsh/Search Engine Journal"
  }
]