[
  {
    "url": "https://blog.hubspot.com/marketing/forget-b2b-or-b2c-its-time-for-b2h",
    "title": "Forget B2B or B2C: It’s time for B2H",
    "date": "2025-11-26T02:22:28+00:00",
    "content": "This pains me greatly to say, but: That typo in your last campaign may have made your audience more engaged.\nThat’s because in a world where you don’t always know what’s real and what’s AI — and trust in general is in rapid decline — a little tyop indicates that a real human wrote it (see what I did there?).\n“We’ve been taught to think about B2B or B2C,” says today’s marketing master, “but I’m actually interested in B2H — there’s a human on the other side.”\nClaim to fame: Calloway isn’t anti-AI by any means — her company has just produced the MVP of IDA , an AI tool that helps people tell their stories within systems that may have been built without them in mind. “AI is a really great tool to scale your strategy,” she says. “Not replace it.”\n“I always say to start with emotional resonance,” Calloway tells me. “Literally, if you’re building a four-sentence story, start with emotion.”\nTo find that point of connection, ask yourself: “What did you feel? What did you see? What did you hear?” And don’t underestimate humor — “if you can get your audience to laugh, you have already bypassed the part of the brain that‘s like, ‘I don’t trust this.’”\nNow you want to support that emotion with something logical, she says. “That’s a data point, a proof point. It’s something that solidifies the emotion so that the brain can hold onto it.”\n“We like emotional resonance, but I need something tangible so that my trust can be solidified,” Calloway explains. And it’s not until you’ve provided an emotional connection and the data or proof points that you’ve earned the right to a product explanation.\nThe emotion + logic equation works across any channel, Calloway says — “if you combine emotion and logic in any sort of format, you will have exponentially increased engagement with your content.”\nSo, back to that four sentence story: 1. Emotional resonance. 2. Data or proof point. 3. Product explanation. 4. CTA. Boom .\nOkay, so there’s a little bit of a caveat to the first lesson.\nEmotion + logic should always be your storytelling guardrails, but the ratio may vary from platform to platform. And that’s where Calloway’s 85/15 rule comes into play.\n“85% of what you do should be templatized, refined — checking the boxes of your strategic marketing plan,” she says. “And if you're a marketing leader, you should give your team 15% of that work to play with.” (Cue: Everybody forwarding this to their bosses.)\nThe point of this is “to be a little faster — a little messier in the output, a little stripped back,” says Calloway. “A little less, ‘Did this person sign off?’” A little more fun, more experimental.\nThat flexibility to play gives you a way to test and to explore, and then — this part is important — to adapt what you learn to your next campaign .\n“ The learnings can‘t come when we’re just mass producing the same templatized thing that we've done for the last two years. Let somebody experiment in a safe place.”\nThe best part of all of this? It “restores the joy of marketing to marketers,” Calloway says. The reason most of us get into marketing is that “we want to tell amazing stories about amazing products to humans.”\n“If something is ambiguous, my brain is going to fill in the gaps based on what I know, right?” says Calloway.\nAnd if you don’t know a lot, suddenly your brain becomes a fiction writer.\nIf you describe “an AI-powered solution,” let’s say, your audience will fill in the gaps based on whether they think AI is a net good, a force of evil, or somewhere in between.\nAnd that’s why storytelling is so important. Because the more stories that you share, “the more context and nuance you‘re giving folks, which means that they’re able to fill in the gaps with more accurate information,” not something they saw online or read in that one book 10 years ago.\n“If you’re working with a product that feels unfamiliar,” Calloway says, “try building out a narrative that helps to fill in the gaps of who you are, the value that you bring, and how that relates to the humans that are in the shared space with you.”\nAnd “that’s really the beauty of storytelling,” she says. “If I’m telling stories about who I am as a person, all of a sudden I want to participate in that with you.”\nYour Monday move: Go tell some great stories. You only need four sentences.\nI think nostalgia is something that‘s been overdone. I would love to know: What’s a better way for brands to engage with communities or consumers that they want to connect with? — Shareese Bembury-Coakley , VP of business development and partnerships, CultureCon\nCalloway : I agree, nostalgia has become the easy button for connection. But real community is built forward, not backward. The better path for brands is participatory storytelling: inviting people to co-create the narrative rather than simply consume it. Communities don’t want to be reminded of who they were; they want to be seen in who they’re becoming.\nThat requires marketers to move from campaigns to contexts, spaces where shared curiosity, lived experience, and emerging identity meet. Whether through localized storytelling, behind-the-build transparency, or platforming authentic user voices, brands can shift from “remember when” to “imagine with us.”\nConnection today isn’t about familiarity; it’s about alignment. The question isn’t “How do we tap into what people loved?” but “How do we stand alongside what they’re creating next?” That’s where trust, loyalty, and modern belonging live.\nCalloway asks: As marketers, we often talk about authenticity and alignment but those words can become buzzwords fast. How do you ensure your team stays connected to real people and not just the performance of connection?"
  }
]