[
  {
    "url": "https://www.searchenginejournal.com/google-expands-preferred-sources-publisher-ai-partnerships/563062/",
    "title": "Google Expands Preferred Sources & Publisher AI Partnerships via @sejournal, @MattGSouthern",
    "date": "2025-12-10T18:42:55+00:00",
    "content": "Google is expanding its Preferred Sources feature to English-language users worldwide and launching a pilot program to test AI-powered features with major news publishers.\nThe announcement includes updates to how links appear in AI Mode and a new feature that will highlight content from users’ news subscriptions.\nPreferred Sources in Search lets users customize Top Stories to see more from their favorite outlets. Google is now rolling it out globally for English-language users, with all supported languages following early next year.\nGoogle shared usage data from the feature’s initial rollout. Nearly 90,000 unique sources have been selected by users, ranging from local blogs to global news outlets. Users who pick a preferred source click to that site twice as often on average.\nA new feature will highlight links from users’ paid news subscriptions in search results. Google will also prioritize links from subscribed publications and show them in a dedicated carousel.\nThe feature launches first in the Gemini app in the coming weeks. AI Overviews and AI Mode will follow, though Google didn’t provide a timeline.\nGoogle is increasing the number of inline links in AI Mode and updating their design. The company is also adding contextual introductions to embedded links. These are short statements explaining why a particular link might be useful.\nWeb Guide, which organizes links into topic groups using AI, is now twice as fast and appearing on more searches for users opted into the experiment.\nGoogle announced a commercial partnership pilot with publishers including Der Spiegel, El País, Folha de S. Paulo, Infobae, Kompas, The Guardian, The Times of India, The Washington Examiner, and The Washington Post.\nThe pilot will test AI-powered features in Google News. These include article overviews on participating publications’ Google News pages and audio briefings for those who prefer listening. Google says these features will include attribution and link to articles.\nSeparate partnerships with Estadão, Antara, Yonhap, and The Associated Press will provide real-time information for the Gemini app.\nGoogle says it has partnered with over 3,000 publications, platforms, and content providers in more than 50 countries in the last few years.\nIf you’ve been watching how Google handles publisher relationships in the AI era, this announcement outlines their current approach. The Preferred Sources data suggests users who customize their sources engage more with those sites.\nThe subscription highlighting feature could affect how your subscribed audiences find your content across Google’s surfaces.\nPreferred Sources is available now for English-language users globally. Full language support arrives early 2026.\nThe subscription highlighting feature starts in the Gemini app in the coming weeks. The publisher AI pilot has begun with participating publications in Google News. Google didn’t provide timelines for when AI Mode and AI Overviews will get subscription highlighting."
  },
  {
    "url": "https://sproutsocial.com/insights/social-media-center-of-excellence/",
    "title": "Unlocking org-wide impact: The benefits of a social media center of excellence",
    "date": "2025-12-10T16:09:23+00:00",
    "content": "Social media center of excellence (CoE) frameworks are fast becoming essential as brands face rising consumer expectations and increasingly complex social channels. As marketing teams become increasingly distributed, the need for a unified, scalable approach to social has never been clearer. Especially with enterprise organizations, social media has outgrown its roots as a marketing channel and is now a core intelligence system that shapes brand reputation, customer experience, product strategy and executive visibility.\nA social media CoE provides structure and clarity, enabling teams to work from a shared, scalable foundation. It centralizes expertise, sets consistent standards, accelerates cross-functional collaboration and ensures social insights are integrated in the entire organization , flowing into the parts of the business that need them.\nAs social data, real-time decision-making and AI-powered workflows transform how enterprises operate, brands that build a strong Social CoE aren’t just managing social; they’re turning it into a competitive advantage.\nIn this comprehensive guide, we dive into what it means for brands to have a social media CoE and how to build one that’s truly impactful and sustainable.\nWe also bring you insights from industry experts: Kristi Daraban , Head of Social Media & Influencers, Centre of Excellence Leader at TAG – The Aspen Group. Kristi has helped enterprises like Disney, Nestlé and Abercrombie & Fitch scale worldwide through sophisticated, integrated social media strategies; And Ava Witthauer, Sr. Manager, Social Media Operations & Enablement at TAG , where she leads three enterprise-wide CoEs across seven brands and 42+ channels, supporting 20+ team members. In her role, she also oversees enterprise-wide community engagement, analytics and paid social.\nA social media center of excellence (CoE) is a centralized function that sets the vision, standards and best practices for how a brand uses social. It provides a unified strategy, governance and tools that help the entire business operate consistently and efficiently. It serves as the hub for expertise and offers guidance on content, community management, analytics, social customer care , brand voice, risk management and emerging trends.\nA social media CoE typically comprises cross-functional leaders and experts. These may include social strategists, content and creative teams, community managers, customer care teams, data and analytics specialists, paid media professionals and governance/compliance teams.\n“Social is not just posts on a channel, it’s platform management, community engagement, crisis monitoring, listening, marketing technology and much more. I liken a social CoE to that of an entire marcom organization,” Daraban highlights.\nBy consolidating knowledge and shifting social beyond a single department, a social media CoE ensures that insights, workflows and decisions are aligned across the company, enabling social to drive stronger business outcomes.\nA social media CoE matters now more than ever because the traditional social media manager role has become impossibly broad. Brands can’t rely on one person to master every platform, create standout content, manage influencers, protect reputation, interpret analytics and stay ahead of nonstop updates.\nAccording to Witthauer, “The ‘social media manager’ title is outdated and, honestly, unfair. Social is one of the only fields where one person is expected to be an expert in almost every specialty. You’re supposed to run multiple platforms, create high-performing content, understand how LLMs influence discovery, manage influencers, protect brand reputation, write contracts, read GA dashboards, report analytics, know paid strategy and keep up with platform updates that change every five minutes. It is not possible for one person to do all of that well.”\nA CoE transforms social from a one-person catch-all into a scalable system that helps the entire organization move faster and smarter. It also helps career development because it gives teams structure and valuable shared knowledge.\n“A Social CoE gives teams the resources and structure they need. It creates room for specialization and growth. One person can be a creative star, another can live in analytics and attribution, while another can focus on community or paid. That specialization makes the work better and faster. It also means learnings get shared across the org instead of sitting with one overworked person,” she explains.\n“A true CoE turns social from a ‘one person does everything’ job into an actual system that supports career paths, quality control and scalable impact,” she underscores.\nA Social CoE is necessary for enterprise organizations that want to remain relevant and competitive in today’s quick-paced digital world, where the need to be agile is constant and the expectations on social teams grow by the day. It ensures brands have the structure, specialization and cross-functional alignment required to keep up, innovate and consistently deliver meaningful impact.\nAs Daraban says, “The speed at which social media and culture are moving, it’s critical to have a group that is on the pulse but can also provide strategic thinking, creative ideas and operational efficiency. This is especially important when social is part of an integrated marketing or comms function, as it may not get the attention it needs”, she adds.\nHere’s a quick breakdown of the key benefits of having a social media CoE:\nA strong social media CoE thrives when its foundational elements work together: governance, training and education, cross-functional collaboration, tech infrastructure, performance metrics and a future-proof strategy. Drawing on expert insights, this section explores how these pillars collectively empower a CoE to drive consistent, scalable impact.\nGovernance and risk management play a critical role in ensuring a social media center of excellence is successful. Guidelines and policies need to be developed to achieve consistency and accountability in social media activities across the organization, especially for departments like HR or sales that contribute to social initiatives but may not necessarily be social experts.\n“When you have clear processes, point people and guidebooks, leadership feels more confident and informed. We have decision trees, risk maps, and process docs that make it easy to move quickly because we’ve already considered the risks and benefits. You do not need to reinvent the wheel every time.” Witthauer asserts.\nGovernance includes setting clear social media policies , brand safety standards and now, increasingly, AI usage guidelines that define how teams can responsibly use AI tools.\n“Governance also helps with the small but important things. Every brand or channel calculates engagement rate differently. These teams standardize how we report, what we measure, which tools we use and where the data comes from. That consistency makes social easier for stakeholders to understand and gives us better benchmarking for goal setting,” Witthauer observes.\nIT plays a crucial role as well, by enforcing least-privilege access, monitoring usage patterns and ensuring compliance with internal and regulatory requirements. This also mirrors concerns consumers share about AI usage and personal data, according to the Q3 2025 Pulse Survey . The top being, brands posting AI-generated content without disclosure, mishandling personal data, sharing social and political content that’s not aligned with consumers’ views, or even being on networks with poor content moderation policies.\nEducation and training are foundational to a high-performing social CoE. It ensures every team, from social teams to peripheral contributors like customer care or product teams, understands the brand’s standards, tools, governance requirements and evolving best practices.\n“Everyone has ideas about social. Everyone uses social. That means everyone wants to have a say! A CoE provides a single source of truth. Instead of noise and random requests, people know exactly who to go to and where to find playbooks, policies and kits. It also creates alignment. If five different people are asked the same question, they will give the same answer because the CoE sets the standards,” Witthauer remarks.\nThis is especially true for large organizations, where several different departments touch social in some way. Ongoing training is what keeps everyone on the same page and working to the same high standard.\nA strong CoE needs to have continuous learning programs that cover everything from platform updates and creative guidelines to social listening insights, AI usage policies and crisis escalation protocols. This goes a long way in making teams feel confident about using social intelligence and ensures they show up consistently, without putting the brand at risk.\nCross-functional collaboration is essential in setting up a successful social media center of excellence. There’s no hard and fast rule as to how this collaboration should look. Per the 2025 Impact of Social Media Marketing report , even setting up a standing 30-minute sync with a cross-functional partner each month to share findings and build relationships can be immensely helpful.\nWitthauer shares, “We keep a shared testing sheet that all brands contribute to. Each month, someone picks a test, like CTA variations, hashtags vs no hashtags, or collabs vs tags. Once results come in, every team can replicate what worked. One test becomes a system-wide improvement, saving countless hours and approval processes.”\nBy aligning various departments and business units, a CoE breaks down silos. It centralizes social strategies and turns social from a series of isolated activities into a coordinated engine that supports broader business goals. This includes zeroing in on ideal target audiences, relevant content themes and key performance indicators (KPIs).\nCollaboration also ensures that social insights don’t stay trapped within one team. By regularly sharing data, learnings and campaign results across departments, a social CoE creates a shared understanding of what’s working and what’s not. This cross-pollination drives smarter decision-making and helps teams move faster, avoid duplicated efforts, and respond more effectively to opportunities or potential issues.\n“Defined processes also free up time to focus on higher-impact projects. When a community mentions a recurring pain point, we can partner with Web or CRM to build resources or fix the problem at the source. Social becomes a connector instead of an island,” Witthauer contends.\nCoE team members are decision-makers who assess and adopt tools for the marketing team’s martech stack , working closely with IT to ensure security, compliance and seamless integration across the enterprise. Their goal is to select social media management tools that streamline processes, automate tasks, surface vital social insights and connect smoothly with other systems.\nThink of a CoE as a tech-buying steering committee of sorts. The team defines tool requirements, evaluates vendors, and partners with IT to address governance and access before reporting back to leadership with a single, strategic recommendation.\nBeyond selection, the social media center of excellence also establishes best practices for how teams use these tools, tracks adoption and continuously evaluates emerging technologies to keep the enterprise ahead in an ever-evolving social landscape.\nCoE teams establish frameworks for tracking, measuring and reporting social performance insights, ensuring that these insights are meaningful and actionable for the entire organization.\n“Social listening, performance measurement and data analysis in a social media center of excellence is beneficial due to the timely access of data but also because of its ability to see and hear what competitors and consumers are doing/saying,” Daraban says.\nAs social intelligence becomes increasingly critical, the social CoE also focuses on executive reporting, translating metrics into clear narratives that demonstrate social media value . This includes the impact on brand reputation, customer experience and business outcomes.\nBy effectively communicating the value of social, the social media CoE helps leaders make informed decisions and, in effect, positions social as a strategic driver across the enterprise.\nWhile this may take a while to perfect, it’s well worth the effort.\n“Tailoring the data to each audience can be tricky, but once you understand what is important to an executive, creating templates and automated delivery becomes simple,” she notes.\nTo start, use our organic social media ROI template to connect social performance to real business impact. In it, you’ll find frameworks and formulas to calculate, communicate and amplify the impact of your social efforts.\nA strong social media center of excellence removes the guesswork from planning and keeps teams ready for what’s next. For example, this could mean a research arm that uses social listening data and media monitoring to get contextualized audience and industry insights.\nAt the same time, standardized processes make forecasting and goal-setting faster and more consistent, turning a traditionally painful task into a streamlined, collaborative exercise. And by distributing ownership of platforms and tools across the team, the CoE ensures continuous learning.\n“KPI projections and goal setting are something most marketers dread. When you standardize your formulas, cadence and templates, something that used to take days becomes a one-hour collaborative session. We also build quarterly and monthly learning cycles into our CoE. Each person takes ownership of a platform or a new tool and brings insights back to the team. This keeps everyone informed without burning out one person who feels responsible for knowing everything at all times,” Witthauer reflects.\nA sustainable and impactful CoE needs this kind of strategic approach to ensure everyone stays ahead of emerging trends and capabilities, building a system that stays adaptable, informed and resilient over time.\nWhile powerful, building a social media CoE in an enterprise can come with a few challenges. Roles can be unclear, stakeholders may be misaligned and resources often stay too lean for the workload. On top of that, an unstable economy only heightens expectations to prove value.\nWe break down these obstacles and outline practical solutions for you.\nOne of the most common challenges of a social media center of excellence is cross-functional collaboration. A social CoE only works if the adoption is org-wide and everyone understands its role and responsibilities.\nAs Daraban says, “CoEs need to be widely adapted by the enterprise to be utilized properly.”\nOnce the boundaries between strategy, execution and accountability are clear across teams like brand, legal, HR and compliance, the CoE can operate smoothly and deliver real value to the business.\nThis is especially important when, according to the 2025 Impact of Social report, leaders say they want teams other than just digital marketing to use social insights to drive their decisions; teams like customer experience and success, customer care and support and business development.\nEstablish clear roles, communication channels, foster a culture of collaboration and promote knowledge sharing to overcome these sticking points. This will also enhance your brand’s social media maturity . Regular meetings, training sessions and shared documentation are important regular rituals to promote visibility.\nAccording to Daraban, “The role of the Social CoE should be clearly defined to provide the best partnership with brand teams, legal, HR, compliance and other crucial stakeholders that social must interact with.”\n“There can be some blurred lines between strategic roles, executional roles and accountability. However, once this is aligned, the social center of excellence can work exceptionally well to the benefit of the enterprise,” she adds.\nHaving sufficient budget, staff and technology are ongoing challenges for most brands, especially in the face of an unstable economy . Using the resources companies do have wisely is a consistent challenge for CoE teams. With so many stakeholders involved, deciding whose initiatives are the most important can be daunting.\nSocial media CoEs are often understaffed, and people wrongly assume they can keep absorbing more work just because they’re efficient. This becomes especially problematic when supporting many brands or business units.\n“I’ve seen very lean COEs that don’t grow in tandem with the workload. The assumption that the COE staff can absorb more because of their nature to drive efficiency is a misconception. This especially rings true when you’re dealing with multiple lines of business, brands or companies,” Daraban notes.\nSimilarly, proving value may look different to different stakeholders, ranging from content performance to efficiency, scalability, audience sentiment and brand health.\n“Proving value can be defined differently based on the stakeholder and scope of the CoE. Content and channel performance may be necessary to measure efficiency, scalability, sentiment and reputation or even crisis mitigation,” Daraban adds.\nA sustainable solution is to resource the social media center of excellence in line with the true scale and complexity of the business, rather than assuming it can continually absorb more work. This starts with clearly defining the CoE’s scope, setting realistic expectations with stakeholders and establishing capacity limits.\nIn a tight economy with limited budgets and headcount, priorities still have to be met. Tackling the challenge from a new angle may be necessary.\n“This is a universal challenge,” Witthauer points out. “The best starting point is adding a contractor and proving value through clear KPIs. More posts, more appointments, more sales, new programs. Use trackable links, document productivity and write business cases that compare what you can do now vs what you could do with more resources,” she suggests.\n“As for one-person social teams, the advice is simple: start saying no. Be your own advocate. Share results often, and always tie them to business objectives. Use UTMs, web activity, sentiment tracking and program outcomes to make the case. Data is your best friend when you need to unlock headcount or investment,” she adds.\nShared KPIs create consistent ways to measure impact across teams, strengthening the case for social’s value. Regular reviews of workload, tools and cross-functional needs help the social media CoE stay flexible and focused, enabling it to remain efficient and resilient, even in a tighter economic climate.\nSocial media crises can pop up quickly, meaning your team must spring into action immediately. With so many decision-makers involved, it might be harder to gain approval on your proposed response and act rapidly.\nDaraban comments, “The main challenge with crises is having an agreed-upon plan when one occurs and executing it quickly. Defining what a crisis is, is the first step, as many companies can see this differently. It can be assumed as speed of virality/traction, depth or negativity of the issue, media attraction or operational impact. Once defined, knowing who can make a decision and how many need to make the decision will help with speed. This is where governance and a social CoE can really help.”\nHave a clear social media crisis management plan in place, including a pre-approved response protocol and designated spokespeople. Plus, determine which CoE stakeholders need to grant approvals in your plan. This will help you respond as quickly as needed. Staying on the pulse of trending conversations through social listening can also help identify potential issues before they escalate, providing valuable foresight.\nPer Witthauer, “Crisis management comes down to having the right tools and strong internal relationships. We set up listening spikes, defined roles and scheduled check-ins so we are never reacting blindly. We have a crisis program with a standardized format so everyone knows exactly what to do and who to notify.”\nEven with the challenge, this very aspect underscores the importance of a social CoE in crisis management, especially in terms of resourcing in a high-stress situation.\n“Most teams do not realize one crisis can take an entire day or an entire week of a social associate’s time. If you only have one social person, that takes them away from content creation, engagement, reporting and everything else. A CoE distributes that load and keeps the system functioning even in high-pressure moments,” she emphasizes.\nSprout Social has tools for managing an effective center of excellence.\nHere’s a roundup of some of the most important tools you should have in your social media center of excellence tech stack.\nPublishing, collaboration and approval tools empower the social media center of excellence team to work in a more organized and efficient manner. For instance, a central social media management platform like Sprout Social streamlines content creation, scheduling and approvals.\nIn Sprout, you can visualize posts from all your networks and profiles within a single, shared calendar. These publishing tools reinforce team governance by granting permissions based on a team member’s role, and ensure content is always approved and on-brand with internal and external approval features. No more emailing spreadsheets back and forth to collaborate.\nAnalytics and reporting tools that integrate with customer relationship management (CRM) systems allow the CoE team to leverage data from various sources and have a holistic view of their brand’s operations. With Sprout’s analytics tools , you can speed up and automate data collection so your team can focus more energy on monitoring important KPIs, informing strategy and proving ROI.\nThrough Sprout’s integration with Salesforce , companies can enrich customer CRM profiles with social data and provide teams with a 360-degree view of customer interactions. It also enables you to customize marketing journeys for your audience and take action across channels faster and scale efficiently.\nSprout’s Tableau Business Intelligence (BI) Connector takes it a step further by combining social data in an omnichannel view, customized with the visuals and aggregated metrics leadership teams need. This delivers customizable visualizations that give users a complete view of their customers, without requiring time-consuming work.\nSocial listening tools empower the social media center of excellence team to monitor social conversations in near real time, enabling them to stay updated on trends related to their brand or industry. This way, they’re able to proactively identify emerging issues, stay informed about relevant topics, manage brand reputation and keep a pulse on customer insights and feedback.\nSprout’s enterprise-ready social listening solution , built on intuitive workflows and proprietary AI technology, sifts through billions of data points to zero in on the trends, insights and key learnings you need to guide your future strategy. Teams can gain business-critical learnings from thousands of unfiltered thoughts, opinions and feedback for a proactive social strategy.\nSimilarly, our media monitoring agentic AI tool, NewsWhip by Sprout Social , continuously monitors news sources for brand mentions and emerging signals in real time. This enables the Social CoE to enhance its current strategy and guide future action by considering all relevant industry events.\nMedia monitoring is a critical tool for a Social CoE because it acts as an early-alert system, helping teams keep tabs on mentions across news channels, blogs and other networks as they happen. It’s essential for crisis readiness because it enables brand communications to spot emerging issues, understand public sentiment and identify the voices shaping the narrative.\nTools like NewsWhip automate this important function by using real-time engagement signals to predict which stories are likely to accelerate. With that level of foresight, a social media center of excellence can respond quickly and strategically, often preventing a minor issue from escalating into a full crisis.\nBuilding a social media center of excellence enables you to unify your social strategy with enterprise-wide goals and fully unlock social’s value as a brand, intelligence and customer experience engine. And while challenges will surface, especially in complex structures and unstable economies, they can be overcome with clear governance, cross-functional alignment, realistic resourcing and the right technology to power scalable, integrated workflows.\nDive deeper into how social insights can influence your customer journey and entire organization. Download the 2025 Impact of Social report today."
  }
]