[
  {
    "url": "https://www.searchenginejournal.com/seo-pulse-december-core-update-preferred-sources-social-data/563139/",
    "title": "SEO Pulse: December Core Update, Preferred Sources & Social Data via @sejournal, @MattGSouthern",
    "date": "2025-12-12T13:04:45+00:00",
    "content": "The December 2025 core update is the main story this week.\nGoogle confirmed a new broad ranking update, clarified how often core changes happen, expanded Preferred Sources in Top Stories, and started testing social performance data in Search Console Insights.\nGoogle has released the December 2025 core update, its third core update of the year.\nThe rollout started on December 11, and Google says it may take up to three weeks to complete. This follows the March and June core updates and comes two days after Google refreshed its core updates documentation to explain smaller, ongoing changes.\nIf you see big swings in rankings or traffic over the next few weeks, this update is probably the cause.\nCore updates are broad changes to how Google evaluates content. Pages can move up or down even if you haven’t changed anything on the site, because Google is reassessing your content against everything else in the index.\nThe timing matters. Earlier in the week, Google reminded everyone that smaller core updates happen all the time. The December core update sits on top of that layer. You’re dealing with both a visible event and quieter, continuous adjustments running underneath.\nRight now, the best move is to watch your data rather than panic. Mark the rollout dates in your reporting. Track when things start to move for your key sections. Compare this behavior with what you saw during the March and June updates. That helps you separate core-update effects from seasonality, technical issues, or campaign changes.\nOver the longer term, this is another nudge toward content that shows clear expertise, purpose, and useful detail. The documentation change earlier in the week suggests those improvements can be recognized over time, not only when Google names a new core update.\nReactions on X focused on timing, expectations, and the kind of content that might come out ahead.\nSome SEO professionals leaned into the holiday angle, joking that Google’s “Christmas update” could either deliver a gift or push sites “off a cliff” right before peak season. Others used the announcement to talk about human-written work, saying they hope this is the update where stronger, human-generated content gets more visibility.\nThere were also practical reads. A few people tied the update to recent delays in Search Console data, saying the backlog now makes more sense. Others pointed out that this is the third broad update in a year where Google is also investing heavily in AI systems, and that core updates now sit inside a bigger stack of changes rather than defining everything on their own.\nRead our full coverage: Google Releases December 2025 Core Update\nEarlier in the week, Google updated its core updates documentation to spell out that ranking changes can happen between the named core updates.\nThe documentation now says Google makes smaller core updates on an ongoing basis, alongside the larger core updates it announces a few times a year. Google explained that this change is meant to clarify that sites can see ranking gains after making improvements without waiting for the next big announcement.\nSmaller core updates were mentioned in a 2019 blog post, but this is the first time the concept appears directly in the core updates documentation.\nThis answers a question that has been hanging over SEO for years. Recovery isn’t limited to moments when Google announces a core update. The new wording confirms that Google can reward improvements at any time as smaller updates roll out in the background.\nIf you’ve been holding back on site fixes or content work until “the next core update,” this is a good time to drop that pattern. You can ship improvements now, knowing there’s more than one window where Google might reassess your content.\nThe timing is interesting given this year’s release pattern. Until this week, the only named core updates in 2025 were the March and June releases, with several months between them. For sites hit early in the year, those gaps made it hard to know when changes might start to pay off. The December update adds another obvious checkpoint, but the documentation makes it clear that it isn’t the only one.\nFor reporting and communication, this supports a change from “wait for the next update” to “improve steadily and monitor continuously.” You still don’t need to chase every drop, but you can be more confident that sustained work has more than one chance to show up in the data.\nFormer Google search team member Pedro Dias summed up one common read, saying he thinks Google has finally reached a place where it doesn’t need to announce every core update separately. Others have connected the change to Google’s move toward layered ranking systems, where visible events are only one part of an ongoing stream of tweaks.\nFor you, that supports a slower, steadier approach. Instead of waiting for one moment to “fix” everything, you can keep tuning content and UX, and treat named core updates as checkpoints rather than the only chance to move.\nRead our full coverage: Google Confirms Smaller Core Updates Happen Continuously\nGoogle is expanding Preferred Sources globally for English-language users, giving people more control over which outlets show up in Top Stories and similar news surfaces.\nPreferred Sources lets people pick specific outlets they want to see more often when they browse news in Google Search. The feature is now rolling out to English-language users worldwide, with other supported languages planned for early next year. Google says people have already selected close to 90,000 different sources, from local blogs to large international publishers, and that users who mark a site as preferred tend to click through to it about twice as often.\nPreferred Sources gives you a direct way to turn casual readers into regulars inside Google’s own interfaces. If your site publishes timely coverage, you can now build a segment of people who have chosen to see more of your work in Top Stories.\nThat makes “choose us as a preferred source” another call to action you can test alongside email sign-ups and follow buttons. Some publishers are already creating simple guides that show readers how to add them and what changes once they do. You can take a similar approach, especially if you already have a loyal audience on site or through newsletters.\nIt’s also a signal that Google wants users to have more say in which outlets they see. For you, that means brand perception, clarity of coverage, and consistency matter a bit more, because people are deciding which sources they want in their feed instead of relying on a default mix.\nOn LinkedIn, several SEO professionals and content strategists pointed out that Preferred Sources mostly reinforces behavior that already exists.\nGarrett Sussman notes that people tend to stick with outlets they trust. This feature simply makes that choice more visible and gives publishers another growth lever inside Google’s ecosystem.\nIf you work on news or frequently updated content, you can start treating Preferred Sources selection as its own metric. Watch how often people choose you, which articles tend to drive that choice, and how those readers behave over time.\nRead our full coverage: Google Expands Preferred Sources & Publisher AI Partnerships\nSearch Console is testing a feature that shows how your social channels perform in Google Search results.\nGoogle announced a new experimental feature in Search Console that adds social performance data to the Search Console Insights report. It covers social profiles that Google has automatically associated with your site. For each connected profile, you can see clicks, impressions, top queries, trending content, and audience location.\nThe experiment is limited to a small set of properties, and you can’t manually add profiles. The feature only appears if Search Console detects your channels and prompts you to link them.\nUp to now, you’ve probably watched search performance for your site and your social channels in separate tools. This experiment pulls both into one place, which can save time and make it easier to see how people move between your website and your social profiles.\nThe new data shows which queries lead people to your social profiles, which posts tend to surface in search, and which markets use Google to find you on social platforms. That’s useful if you run campaigns where organic search, social content, and creator work all overlap.\nThe main limitation is access. If you don’t see a prompt in Search Console Insights asking you to connect detected social channels, your site isn’t in the initial test group. Still, it’s worth logging as a feature to watch, especially if you already spend time explaining how social content shows up for branded and navigational queries.\nReactions on LinkedIn focused on two main points. People liked the idea of a single view of website and social performance, and they quickly started asking when similar data might be available for AI Overviews, AI Mode, and other search experiences.\nOthers raised questions about coverage. Some practitioners want to know whether this data will stay limited to Google-owned properties or expand to platforms like Instagram, LinkedIn, and X. There’s also curiosity about how Google detects and links social profiles in the first place, and whether structured data or Knowledge Graph entities play a role.\nRead our full coverage: Google Tests Social Channel Insights In Search Console\nThe common thread this week is movement at two speeds.\nAt one speed, you have the December 2025 core update. It’s a visible event with a clear start date, a multi-week rollout, and a lot of attention. At the other speed, you have the quieter changes around it.\nGoogle has now said directly that smaller core updates happen all the time. Preferred Sources gives users more control over which outlets they see. Social insights start to connect website and social performance in one view.\nFor you, this means there’s no single moment when everything gets decided. Core updates still matter and can cause sharp movements, but they sit inside an environment where improvements can pay off gradually and where readers are making more explicit choices about who they want to hear from.\nThe practical response is to treat this as an ongoing feedback loop. Keep improving content and UX. Watch how those changes behave during calm periods and during core updates. Encourage your most engaged readers to mark you as a preferred source where they can. Keep an eye on how search and social interact for your brand. That way, you’re ready for both speeds."
  },
  {
    "url": "https://martech.org/marketers-are-drowning-in-data-but-starving-for-insight/",
    "title": "Marketers are drowning in data but starving for insight",
    "date": "2025-12-12T14:02:00+00:00",
    "content": "Marketers have more data than ever and an expanding suite of tools to work with — yet many are still flying blind. According to “ The 2026 Marketing Intelligence Report ” ( registration required) from marketing intelligence platform Funnel and Ravn Research, 72% of in-house marketers and 55% of agency marketers say they’re overwhelmed by the data they collect and find it difficult to turn it into usable insight. Even more — 86% of in-house and 79% of agency teams — say they can’t cut through the noise to identify what’s really driving performance.\nThat disconnect is evident in the dashboards that many teams rely on. They may look impressive, but they often stop short of answering the question marketers care about most: what do we do next? Instead of surfacing actionable insights, too many dashboards serve up vanity metrics — clicks, impressions, followers — that aren’t tied to actual business outcomes.\nPart of the problem is the sheer complexity of modern marketing. Campaigns span dozens of channels and devices, and visibility often lags. Sixty-eight percent of in-house marketers report a lack of up-to-date visibility into performance across channels. And when it comes time to report results, 41% say they don’t analyze what caused the outcomes or suggest next steps. That’s especially concerning given that agency teams, who face more external accountability, report lower rates of that same issue.\nContributing authors are invited to create content for MarTech and are chosen for their expertise and contribution to the martech community. Our contributors work under the oversight of the editorial staff and contributions are checked for quality and relevance to our readers. MarTech is owned by Semrush . Contributor was not asked to make any direct or indirect mentions of Semrush . The opinions they express are their own.\nI am the first generative AI chatbot for marketers and marketing technologists. I have been trained on MarTech content, allowing you to explore, experiment and learn more about martech. I am BETA software powered by AI. I will make mistakes, errors and sometimes even invent things."
  }
]