[
  {
    "url": "https://www.searchenginejournal.com/google-says-ranking-systems-reward-content-made-for-humans/563774/",
    "title": "Google Says Ranking Systems Reward Content Made For Humans via @sejournal, @martinibuster",
    "date": "2025-12-19T10:17:01+00:00",
    "content": "Google’s Danny Sullivan discussed SEO and AI where they observed that their ranking systems are tuned for one thing, regardless if it’s classic search or AI search. What he talked about was optimizing for people, which is something I suspect the search marketing industry will increasingly be talking about.\nThe first thing Danny Sullivan discussed was that despite there being new search experiences powered by AI there isn’t anything new that they need to be doing.\n“So everything kind of around AI, or is this really a new thing? It feels like these fads come and go. Is AI in fad? How do you think?”\n“Oh gosh, my favorite thing is that we should be calling it LMNOPEO because there’s just so many acronyms for it. It’s GEO for generative engine optimization or AEO for answer engine optimization and AIEO. I don’t know. There’s so many different names for it.\nI used to write about SEO and search. I did that for like 20 years. And part of me is just so relieved. I don’t have to do that aspect of it anymore to try to keep up with everything that people are wondering about.\nAnd on the other hand, you still have to kind of keep up on it because we still try to explain to people what’s going on. And I think the good news is like, There’s not a lot you actually really need to be worrying about.\nIt’s understandable. I think people keep having these questions, right? I mean, you see search formats changing, you see all sorts of things happening and you wonder, well, is there something new I should be doing? Totally get that.\nAnd remember, we, John and I and others, we all came together because we had this blog post we did in May, which we’ll drop a link to or we’ll point you to somehow to it, but it was… we were getting asked again and again, well, what should we be doing? What should we be thinking about?\nAnd we all put our heads together and we talked with the engineers and everything else. So we came up with nothing really that different.”\nDanny Sullivan next turned to discussing what Google’s systems are designed to rank, which is content that satisfies humans. Robbie Stein, currently Vice President of Product for Google Search, recently discussed the signals Google uses to identify helpful content , discussing how human feedback contributes to helping ranking systems understand what helpful content looks like.\nWhile Danny didn’t get into exact details about the helpfulness signals the way Stein did, Danny’s comments confirmed the underlying point that Robbie Stein was making about how their systems are tuned to identify content that satisfies humans.\nDanny continued explaining what SEOs and creators should know about Google’s ranking systems. He began by acknowledging that it’s reasonable that people see a different search experience and conclude that they must be doing something different.\n“…I think people really see stuff and they think they want to be doing something different. …It is the natural reaction you have, but we talk about sort of this North Star or the point that you should be heading to.”\nNext he explained how all of Google’s ranking systems are engineered to rank content that was made for humans and specifically calls out content that is created for search engines as examples of what not to do.\n“And when it comes to all of our ranking systems, it’s about how are we trying to reward content that we think is great for people, that it was written for human beings in mind, not written for search algorithms, not written for LLMs, not written for LMNO, PEO, whatever you want to call it.\nIt’s that everything we do and all the things that we tailor and all the things that we try to improve, it’s all about how do we reward content that human beings find satisfying and say, that was what I was looking for, that’s what I needed. So if all of our systems are lining up with that, it’s that thing about you’re going to be ahead of it if you’re already doing that.\nTo whereas the more you’re trying to… Optimize or GEO or whatever you think it is for a specific kind of system, the more you’re potentially going to get away from the main goal, especially if those systems improve and get better, then you’re kind of having to shift and play a lot of catch up.\nSo, you know, we’re going to talk about some of that stuff here with the big caveat, we’re only talking about Google, right? That’s who we work for. So we don’t say what, anybody else’s AI search, chat search, whatever you want to kind of deal with and kind of go with it from there. But we’ll talk about how we look at things and how it works.”\nWhat Danny is clearly saying is that Google is tuned to rank content that’s written for humans and that optimizing for specific LLMs sets up a situation where it could backfire.\nAlthough Danny didn’t mention it, this is the right moment to point out that OpenAI, Perplexity, and Claude together have a total traffic referral volume of less than 1%. So it’s clearly a mistake to optimize content for LLMs at the risk of losing significant traffic from search engines.\nContent that is genuinely satisfying to people remains aligned with what Google’s systems are built to reward.\nGoogle’s insistence that their algorithms are tuned toward user satisfaction is not new. They have been saying it for over two decades, and over the years it has been a given that Google was overstating their technology. That is no longer the case.\nArguably, since at least 2018’s Medic broad core update, Google has been making genuine strides toward actually delivering search results that are influenced by user behavior signals that guide Google’s machines toward understanding what kind of content people like, plus AI and neural networks that are better able to match content to a search query.\nIf there is any doubt about this, check out the interview with Robbie Stein , where he explains exactly how human feedback, in aggregate, influences the search results.\nSo now we are at a point where links no longer are the top ranking criteria. Google’s systems have the ability to understand queries and content and match one to the other. User behavior data, which has been a part of Google’s algorithms since at least 2004, plays a strong role in helping Google understand what kinds of content satisfy users.\nIt may be well past time for SEOs and creators to let go of the old SEO playbooks and start focusing on optimizing their websites for humans."
  }
]