[
  {
    "url": "https://www.searchenginejournal.com/segment-organic-traffic-data/561082/",
    "title": "Why Is Organic Traffic Down? Here’s How To Segment The Data via @sejournal, @torylynne",
    "date": "2025-12-09T14:00:44+00:00",
    "content": "As an SEO, there are few things that stoke panic like seeing a considerable decline in organic traffic. People are going to expect answers if they don’t already.\nGetting to those answers isn’t always straightforward or simple, because SEO is neither of those things.\nThe success of an SEO investigation hinges on the ability to dig into the data , identify where exactly the performance decline is happening, and connect the dots to why it’s happening.\nIt’s a little bit like an actual investigation: Before you can catch the culprit or understand the motive, you have to gather evidence. In an SEO investigation, that’s a matter of segmenting data.\nIn this article, I’ll share some different ways to slice and dice performance data for valuable evidence that can help further your investigation.\nJust because organic traffic is down doesn’t inherently mean that it’s an SEO problem.\nSo, before we dissect data to narrow down problem areas, the first thing we need to do is determine whether there’s actually an SEO issue at play.\nAfter all, it could be something else altogether. In which case, we’re wasting unnecessary resources chasing a problem that doesn’t exist.\nIn many cases, what looks like a big traffic drop is just an issue with tracking on the site.\nTo determine whether tracking is functioning correctly, there are a couple of things we need to look for in the data.\nZoom out of organic search and see what’s happening in other sources and channels.\nIf you’re seeing meaningful drops across email, paid, etc., that are consistent with organic search, then it’s more than likely that tracking isn’t working correctly.\nThe other thing we’re looking for here is inconsistencies between internal data and Google Search Console.\nOf course, there’s always a bit of inconsistency between first-party data and GSC-reported organic traffic. But if those differences are significantly more pronounced for the time period in question, that hints at a tracking problem.\nOrganic search traffic from Google falls into two primary camps:\nNon-brand traffic is directly affected by SEO work. Whereas, brand traffic is mostly impacted by the work that happens in other channels.\nWhen a user includes the brand in their search, they’re already brand-aware. They’re a return user or they’ve encountered the brand through marketing efforts in channels like PR, paid social, etc.\nWhen marketing efforts in other channels are scaled back, the brand reaches fewer users. Since fewer people see the brand, fewer people search for it.\nOr, if customers sour on the brand, there are fewer people using search to come back to the site.\nEither way, it’s not an SEO problem. But in order to confirm that, we need to filter the data down.\nGo to Performance in Google Search Console and exclude any queries that include your brand. Then compare the data against a previous period – usually YoY if you need to account for seasonality. Do the same for queries that don’t include the brand name.\nIf non-brand traffic has stayed consistent, while brand traffic has dropped, then this is a brand issue.\nTip: Account for users misspelling your brand name by filtering queries using fragments. For example, at Gray Dot Co, we get a lot of brand searches for things like “Gray Company” and “Grey Dot Company.” By using the simple regex expression “gray|grey” I can catch brand search activity that would otherwise fall through the cracks.\nThe most obvious example of seasonal demand is holiday shopping on ecommerce sites.\nThink about something like jewelry. Most people don’t buy jewelry every day; they buy it for special occasions. We can confirm that seasonality by looking at Google Trends.\nZooming out to the past five years of interest in “jewelry,” it clearly peaks in November and December.\nAs a site that sells jewelry, of course, traffic in Q1 is going to be down from Q4.\nI use a pretty extreme example here to make my point, but in reality, seasonality is widespread and often more subtle. It impacts businesses where you might not expect much seasonality at all.\nThe best way to understand its impact is to look at organic search data year-over-year. Do the peaks and valleys follow the same patterns?\nIf so, then we need to compare data YoY to get a true sense of whether there’s a potential SEO problem.\nSEOs need to keep tabs on not just what’s happening internally, but also what’s going on externally . A big piece of that is checking the pulse of organic demand for the topics and products that are central to the brand.\nProducts fall out of vogue, technologies become obsolete, and consumer behavior changes – that’s just the reality of business. When there are fewer potential customers in the landscape, there are fewer clicks to win, and fewer sessions to drive.\nTake cameras, for instance. As the cameras on our phones got more sophisticated, digital cameras became less popular. And as they became less popular, searches for cameras dwindled.\nNow, they’re making a comeback with younger generations. More people searching, more traffic to win.\nYou can see all of this at play in the search landscape by turning to Google Trends. The downtrend in interest caused by advances in technology, AND the uptrend boosted by shifts in societal trends.\nWhen there are drops in industry, product, or topic demand within the landscape, we need to ask ourselves whether the brand’s organic traffic loss is proportional to the overall loss in demand.\nEven if a URL on the site ranks well in organic results, ads are still higher on the SERP. So, if a site is running an ad for the same query it already ranks for, then the ad is going to get more clicks by nature.\nWhen businesses give their PPC budgets a boost, there’s potential for this to happen across multiple, key SERPs.\nLet’s say a site drives a significant chunk of its organic traffic from four or five product landing pages. If the brand introduces ads to those SERPs, clicks that used to go to the organic result start going to the ad.\nThat can have a significant impact on organic traffic numbers. But search users are still getting to the same URLs using the same queries.\nTo confirm, pull sessions by landing pages from both sources. Then, compare the data from before the paid search changes to the period following the change.\nIf major landing pages consistently show a positive delta that cancels out the negative delta in organic search, you’re not losing organic traffic; you’re lending it.\nOnce we have confirmation that the organic traffic declines point to an SEO issue, we can start zooming in.\nSegmenting data in different ways helps pinpoint problem areas and find patterns. Only then can we trace those issues to the cause and craft a strategy for recovery.\nMost SEOs are going to filter their organic traffic down by URL. It lets us see which pages are struggling and analyze those pages for potential improvements.\nIt also helps find patterns across pages that make it easier to isolate the cause of more widespread issues. For example, if the site is losing traffic across its product listing pages, it could signal that there’s a problem with the template for that page.\nBut segmenting by URL also helps us answer a very important question when we pair it with conversion data.\nClicks are only helpful if they help drive business-valuable user interactions like conversions or ad views. For some sites, like online publications, traffic is valuable in and of itself because users coming to the site are going to see ads. The site still makes money.\nBut for brands looking to drive conversions, it could just be empty traffic if it’s not helping drive that primary key performance indicator (KPI).\nA top-of-funnel blog post might drive a lot of traffic because it ranks for very high-volume keywords. If that same blog post is a top traffic-driving organic landing page, a slip in rankings means a considerable organic traffic drop.\nBut the users entering those high-volume keywords might not be very qualified potential customers.\nLooking at conversions by landing page can help brands understand whether the traffic loss is ultimately hurting the bottom line.\nThe best way to understand is to turn to attribution .\nFirst-touch attribution quantifies an organic landing page’s value in terms of the conversions it helps drive down the line. For most businesses, someone isn’t likely to convert the first time they visit the site. They usually come back and purchase.\nWhereas, last-touch attribution shows the organic landing pages that people come to when they’re ready to make a purchase. Both are valuable!\nFiltering performance by query can help understand which terms or topic areas to focus improvements on. That’s not new news.\nSometimes, it’s as easy as doing a period-over-period comparison in GSC, ordering by clicks lost, and looking for obvious patterns, i.e., are the queries with the most decline just subtle variants of one another?\nIf there aren’t obvious patterns and the queries in decline are more widespread, that’s where topic clustering can come into the mix.\nUsing AI for topic clustering helps quickly identify any potential relationships between queries that are seeing performance dips.\nGo to GSC and filter performance by query, looking for any YoY declines in clicks and average position.\nThen export this list of queries and use your favorite ML script to group the keywords into topic clusters .\nThe resulting list of semantic groupings can provide an idea of topics where a site’s authority is slipping in search.\nIn turn, it helps narrow the area of focus for content improvements and other optimizations to potentially build authority for the topics or products in question.\nWhen users search using specific terms, the type of content they’re looking for – and their objective – differs based on the query. These user expectations can be broken out into four different high-level categories:\nBy leveraging user intent , we identify user objectives for which the site or pages on the site are falling short. It gives us a lens into performance decline, making it easier to identify possible causes from the perspective of user experience.\nIf the majority of queries losing clicks and positionality are informational, it could signal shortcomings in the site’s blog content. If the queries are consistently commercial, it might call for an investigation into how the site approaches product detail and/or listing pages.\nGSC doesn’t provide user intent in its reporting, so this is where a third-party SEO tool can come into play. If you have position tracking set up and GSC connected, you can use the tool’s rankings report to identify queries in decline and their user intent.\nIf not, you can still get the data you need by using a mix of GSC and a tool like Ahrefs.\nThis view of performance data is pretty simple, but it’s equally easy to overlook!\nWhen the large majority of performance declines are attributed to ONLY desktop or mobile, device data helps identify potential tech or UX issues within the mobile or desktop experience.\nThe important thing to remember is that any declines need to be considered proportionally. Take the metrics for the site below…\nAt first glance, the data makes it look like there might be an issue with the desktop experience. But we need to look at things in terms of percentages.\nWhile desktop shows a much larger decline in terms of click count, the percentage of decline YoY is fairly similar across both desktop and mobile. So we’re probably not looking for anything device-specific in this scenario.\nRich results and SERP features are an opportunity to stand out on the SERP and drive more traffic through enhanced results. Using the search appearance filter in Google Search Console, you can see traffic from different types of rich results and SERP features:\nThis is the full list of possible features with rich results ( courtesy of SchemaApp ), though you’ll only see filters for search appearances where the domain is currently positioned.\nIn most cases, Google is able to generate these types of results because there is structured data on pages. The notable exceptions are Q&A, translated results, and video.\nSo when there are significant traffic drops coming from a specific type of search appearance, it signals that there’s potentially a problem with the structured data that enables that search feature.\nYou can investigate structured data issues in the Enhancements reports in GSC. The exception is product snippets, which nest under the Shopping menu. Either way, the reports only show up in your left-hand nav if Google is aware of relevant data on the site.\nFor example, the product snippets report shows why some snippets are invalid, as well as ways to potentially improve valid results.\nThis context is valuable as you begin to investigate the technical causes of traffic drops from specific search features. In this case, it’s clear that Google is able to crawl and utilize product schema on most pages – but there are some opportunities to improve that schema with additional data.\nWhen featured snippets originally came on the scene, it was a major change to the SERP structure that resulted in a serious hit to traditional organic results.\nToday, AI Overviews are doing the same. In fact, research from Seer shows that CTR has dropped 61% for queries that now include an AI overview ( 21% of searches ). And that impact is outsized for informational queries.\nIn cases where rankings have remained relatively static, but traffic is dropping, there’s good reason to investigate whether this type of SERP change is a driver of loss.\nWhile Google Search Console doesn’t report on featured snippets (example: PAA questions) and AI Overviews, third-party tools do.\nIn the third-party tool Semrush, you can use the Domain Overview report to check for featured snippet availability across keywords where the site ranks.\nDo the keywords where you’re losing traffic have AI overviews? If you’re not cited, it’s time to start thinking about how you’re going to win that placement.\nSearch type is another way to filter GSC data, where you’re seeing traffic declines despite healthy and consistent rankings.\nAfter all, web search is just one prong of Google Search. Think about it: How often do you use Google Image search? At least in my case, that’s fairly often.\nFilter performance data by each of these search types to understand which one(s) are having the biggest impact on performance decline. Then use that insight to start connecting the dots to the cause.\nImages are a great example. One simple line in the robots.txt can block Google from crawling a subfolder that hosts multitudes of images. As those images disappear from image search results, any clicks from those results disappear in tandem.\nWe don’t know to look for this issue until we slice the data accordingly!\nIf the business operates physically in specific cities and states, then it likely already has geo-specific performance tracking set up through a tool.\nBut domains for online-only businesses shouldn’t dismiss geographic data – even at the city/state level! Declines are still a trigger to check geo-specific performance data.\nJust because the brand only sells and operates in one country doesn’t mean that’s where all the domain’s traffic is coming from. Drilling down by country in GSC allows you to see whether declines are coming from the country the brand is focused on or, potentially, another country altogether.\nIf it’s another country, it’s time to decide whether that matters. If the site is a publisher, it probably cares more about that traffic than an ecommerce brand that’s more focused on purchases in its country of operation.\nWhen tools are reporting positionality at the country level, then rankings shifts in specific markets fly under the radar. It certainly happens, and major markets can have major traffic impact!\nTools like BrightLocal, Whitespark, and Semrush let you analyze SERP rankings one level deeper than GSC, providing data down to the city.\nChecking for rankings discrepancies across cities is possible by checking a small sample of keywords with the greatest declines in clicks.\nIf I’m an SEO at the University of Phoenix, which is an online university, I’m probably pretty excited about ranking #1 in the United States for “online business degree.”\nBut if I drill down further, I might be a little distraught to find that the domain isn’t in the top five SERP results for users in Denver, CO…\nData segmentation is an important piece of any traffic drop investigation, because humans can see patterns in data that bots don’t.\nHowever, the opposite is true too. With anomaly detection tooling, you get the best of both worlds.\nWhen combined with monitoring and alert notifications, anomaly detection makes it possible to find and fix issues faster. Plus, it enables you to find data patterns in any after-the-impact investigations\nAll of this helps ensure that your analysis is comprehensive, and might even point out gaps for further investigation.\nThis Colab tool from Sam Torres can help get your site set up!\nAs Sherlock Holmes would say about an investigation, “It is a capital mistake to theorize before one has data.” With the right data in hand, the culprits start to reveal themselves.\nData segmentation empowers SEOs to uncover leads that point to possible causes. By narrowing it down based on the evidence, we ensure more accuracy, less work, faster answers, and quicker recovery.\nAnd while leadership might not love a traffic drop, they’re sure to love that."
  },
  {
    "url": "https://www.searchenginejournal.com/ask-an-seo-digital-pr-or-traditional-link-building-which-is-better/553879/",
    "title": "Ask An SEO: Digital PR Or Traditional Link Building, Which Is Better? via @sejournal, @rollerblader",
    "date": "2025-12-09T13:30:27+00:00",
    "content": "“Should SEOs be focusing more on digital PR than traditional link building?”\nDigital PR is synonymous with link building at this point as SEO’s needed a new way to package and resell the same service. Actual PR work will always be more valuable than link building because PR, whether digital or traditional, focuses on a core audience of customers and reaching specific demographics. This adds value to a business and drives revenue.\nWith that said, here’s how I’d define digital PR vs. link building if a client asked what the difference is.\nDigital PR is always going to be better than link building because you’re treating the technique as a business and not a scheme to try and game the rankings. Link building became a bad practice years ago as links became less relevant, they are still important, so I want to ensure that isn’t taken out of context, and we stopped doing link building completely. Quality content attracts links naturally, including media mentions. When this happens in a natural way, the website will begin rising as the site has a lot of value for users, and search engines can tell when the site is quality.\nIf you’re building links without evaluating the impact they have traffic and sales-wise, you’re likely setting your site up for failure. Getting a ton of links, just like creating content in mass with AI/LLMs or article spinners, can grow a site quickly. That URL/domain can then burn to the ground equally as fast.\nThat’s why when we purchase a link, an advertorial, or we’re doing a partnership, we always ask ourselves the following questions:\nIf the answer is yes to these four, then we’re good to go with the link. The active audience on the website and people returning by brand name means there is an audience that trusts them for information. If the readership, visitors, or customers are similar or the same demographics as our user base, then it makes sense we’d want to be in front of them where they go for information.\nWe may have knowledge that is helpful to the user, but if it is not on topic within the post, there is no reason for them to come through and use our services, buy our products, or subscribe to our newsletters. Instead, we’ll wait until there is a fit, so there is a direct “link” between the content we’re contributing, or being an expert on, and our website.\nFor the last question, our goal is always traffic and customer acquisition, not getting a link. The website owner controls this, and if they want to follow Google’s best practices (which we obviously recommend doing), we will still be happy if they mark it as sponsored or nofollow. This is the most important of the questions. Building links to game the SERPs is a bad idea; building a brand that people search for by name will overpower any link any day of the week. This is always our goal when it comes to Digital PR and link building. Driving that branded search.\nSo, that begs the question, where do we go for digital PR?\nWhen we’re about to start a Digital PR campaign, we create lists of the following targets to reach out to.\nLink building is not dead by any means; links still matter. You just don’t need to build them anymore. Focus on quality where an active audience is and where you have a chance at getting traffic and revenue. This is what will move the needle for the long run and help you grow in SERPs that matter."
  },
  {
    "url": "https://www.blogdigital.fr/centraliser-donnees-dispersees-pour-obtenir-vision-unifiee-clients/",
    "title": "Comment centraliser vos données dispersées pour obtenir une vision unifiée de vos clients ?",
    "date": "2025-12-09T12:44:52+00:00",
    "content": "Dans les entreprises françaises comme à l’étranger, la multiplication des outils métiers crée souvent un paysage beaucoup trop fragmenté.\nAvec un logiciel pour la relation client, un autre outil pour les campagnes marketing, et même un troisième pour le support, toutes les données sont dispersées et très difficiles à exploiter.\nLa multiplication des outils pour gérer votre entreprise au quotidien n’est malheureusement pas sans effets néfastes. Aujourd’hui, les différentes équipes peinent même à comprendre le « récit » complet du client. Pourtant, l’enjeu n’est plus seulement de collecter des données, mais bien de les rendre pleinement cohérentes, fiables et surtout activables pour transformer des leads en clients.\nEt pourtant, des solutions existent sur le marché, et restent bien plus accessibles qu’on ne pourrait l’imaginer, à commencer par HubSpot. Avec une solution comme celle-ci, vous pouvez centraliser toutes vos informations pour permettre à vos équipes marketing, commerciales et à votre service client de partager très exactement la même connaissance. Cela a aussi pour effet de faciliter l’ajustement des actions à réaliser et d’ offrir une expérience plus fluide tout au long du parcours de vos contacts.\nPar exemple, avec le Data Hub de HubSpot, cette démarche peut se structurer très facilement, en plus d’être facilement accessible grâce à l’automatisation et à l’IA intégrées à la plateforme. Vous pouvez d’ailleurs créer un compte gratuit sur HubSpot en quelques minutes sur le site de la plateforme, afin de tester au plus tôt la centralisation de vos données avec vos collaborateurs.\nS’il existe bien d’autres solutions sur le marché, dès qu’une entreprise cherche à relier ses sources d’information pour y voir plus clair, HubSpot s’impose comme un allié qui vient naturellement. Et parmi les différents hubs proposés par HubSpot, le DataHub ressort le plus souvent comme une solution privilégiée.\nDans les faits, le Data Hub est une solution de HubSpot qui a pour mission d’ unifier les données de votre CRM , de corriger toutes leurs incohérences qui peuvent s’accumuler au fil des années, mais surtout alimenter l’ensemble du CRM . A moyen terme, cela permet de faire en sorte que chaque interaction repose sur une information vraiment fiable.\nActuellement, après une étude menée par la plateforme, il apparaît que plus de 67% des clients de HubSpot affirment que l’outil parvient à réunir l’ensemble de leurs données en un seul outil de manière efficace, ce qui permet au passage d’éviter les nombreuses divergences entre vos services en interne.\nEt si HubSpot a réussi à se placer comme un outil incontournable dans le domaine, c’est surtout parce que son écosystème repose sur trois piliers…\nGrâce à des intégrations parmi les outils les plus populaires du marché, des outils de niches, des connecteurs bidirectionnels dans le cloud, et une synchronisation qui peut même être réalisée en temps réel, HubSpot simplifie l’interopérabilité entre les outils.\nPour les PME et les grands groupes qui utilisent plusieurs outils pour communiquer ou retrouver des informations, cette centralisation peut faire gagner un temps considérable.\nSi nous n’avons jamais collecté autant de données qu’aujourd’hui, ces dernières ne sont malheureusement pas toujours de bonne qualité, quand elles ne nuisent pas à la prise de décision dans certaines organisations.\nDans le cas de HubSpot, le Data Hub intervient très en amont pour nettoyer automatiquement les valeurs incorrectes de votre CRM, détecter les champs obsolètes, et même normaliser les informations pour faciliter leur lecture.\nEnfin, le Marketing Hub intégré à HubSpot permet d’ exploiter l’ensemble de ces données dans une seule et même interface pour vous permettre de déclencher des workflows, d’enrichir les rapports personnalisés, ou de personnaliser les messages envoyés en interne ou à vos contacts.\nAfin de délivrer une expérience sans aucune friction, la donnée qui est à votre disposition doit pouvoir circuler librement entre vos équipes.\nA ce titre, le Data Hub de HubSpot a été justement été conçu pour supprimer les obstacles organisationnels et techniques qui pourraient empêcher cette fluidité, surtout pour les profils les moins avancés dans votre organisation.\nEn rendant les données accessibles à grande échelle , HubSpot permet aux équipes marketing de créer des campagnes vraiment reliées à la réalité du terrain. Les erreurs les plus classiques, comme des e-mails mal ciblés, des personnalisations incorrectes, ou des doublons non-identifiés dans votre base CRM, sont progressivement éliminées au fil des semaines.\nSelon les chiffres avancés par HubSpot, les utilisateurs de la plateforme qui ont fait l’effort de bien utiliser l’outil affirment que cela a permis d’unifier leurs données, en plus de constater une forte montée en performance, notamment sur la qualité des leads.\nDans HubSpot, les interactions, quel que soit le canal, sont enregistrées dans une fiche unique.\nGrâce à cette vue consolidée , les équipes de votre organisation peuvent anticiper les besoins, repérer tous les signaux de désengagement, et surtout intervenir au bon moment.\nAu passage, de nombreuses entreprises notent un impact direct sur leurs revenus, et certains clients de HubSpot rapportent que les expériences personnalisées génèrent des ventes supplémentaires, et que les interactions restent entièrement harmonisées à chaque étape du processus.\nPour les équipes en interne, le fait d’unifier des données dans HubSpot permet de réduire les tâches d’import/export, de supprimer les manipulations manuelles et même de sécuriser l’ensemble des traitements.\nL’interface est d’ailleurs très intuitive, et accompagne ce mouvement. Même pour les personnes qui n’ont pas de compétences techniques, il est tout à fait possible d’ajuster les règles de normalisation, de créer des automatismes et de surveiller l’état général des données sur HubSpot.\nDésormais, le Data Hub se présente comme une véritable extension naturelle du CRM de HubSpot.\nMais si sa mission est de relier les outils, de fiabiliser les données et d’offrir des capacités avancées d’automatisation, comment ces fonctionnalités fonctionnent concrètement ?\nPour commencer, notons que HubSpot s’appuie sur une logique similaire à celle des plateformes d’automatisation entre les outils, à la différence que intégrée nativement à HubSpot.\nDans le cadre de l’organisation de la donnée de vos clients, HubSpot apporte une synchronisation bidirectionnelle qui permet de maintenir l’alignement avec les applications métiers, en plus de faire gagner du temps.\nPour y parvenir, il est possible de mettre en place à la fois des mappages automatiques pour les propriétés natives et des mappages personnalisés pour des schémas spécifiques.\nAvec une synchronisation de l’historique qui peut garantir la cohérence des données existantes, cela permet au centre de contrôle de la donnée intégré à HubSpot de détecter les anomalies et d’anticiper les dérives potentielles.\nL’un des plus grands avantages que l’on retrouve dans HubSpot reste l’association du Data Hub avec les workflows HubSpot . Quand ces deux outils sont bien configurés, cela permet de créer un véritable moteur d’automatisation complet.\nPour cela, HubSpot va jusqu’à proposer une automatisation programmable basée sur JavaScript pour des cas complexes, des bots et des automatisations contextuelles pour ajuster les actions selon le parcours client, une intégration directe avec Slack, Asana , et d’autres outils collaboratifs, et gestion fine des permissions pour que chaque équipe accède au bon niveau d’information.\nUne fois mise en place, cette synergie permet d’industrialiser vos processus internes et de faire circuler les données au bon rythme.\nLe Data Hub de HubSpot permet d’accélérer la création de rapports personnalisés qui visent à exploiter des volumes importants de données.\nIl est notamment possible d’utiliser des datasets pour structurer des collections de données prêtes à être analysées, un partage avec Snowflake pour synchroniser la donnée dans un environnement Data Cloud moderne, et des rapports sur mesure qui se basent sur les objets du CRM, comme les comportements, les transactions, et bien d’autres données présentes dans HubSpot.\nGrâce à l’ensemble de ces fonctionnalités, vos équipes en interne peuvent suivre la performance commerciale, la santé du pipeline ou les comportements des audiences d’un simple coup d’oeil. Par la suite, elles peuvent également formuler des décisions fondées sur des tendances réelles plutôt que sur une simple intuition.\nDans le CRM de HubSpot, chaque fiche contact, entreprise ou transaction centralise l’ensemble des événements, comme les pages visitées, les e-mails ouverts, les réunions enregistrées, les échanges sur WhatsApp ou Slack, et même les tickets créés…\nCette chronologie partagée garantit que chaque acteur, du marketing en passant par les ventes, dispose exactement du même niveau d’information avant d’interagir avec un client.\nLes équipes gagnent alors en précision, réduisent les doublons et s’appuient sur une vue 360° pour améliorer leurs réponses. Enfin, les organisations qui combinent le Marketing Hub et le Data Hub peuvent activer plusieurs dizaines de workflows supplémentaires, ce qui améliore grandement la cohérence sur l’ensemble du parcours."
  },
  {
    "url": "https://martech.org/a-marketers-guide-to-reddit/",
    "title": "Marketing on Reddit: What you need to know",
    "date": "2025-12-09T13:27:00+00:00",
    "content": "Thanks in part to its 2024 IPO, the social media platform Reddit is a hot topic in many circles, including marketing. That’s quite the accomplishment for a company that’s been around for 20 years, which in internet terms is the equivalent of having lived when dinosaurs roamed.\nTo help you understand the platform and determine if it’s a good channel for you, here is our marketer’s guide to Reddit.\nWe’ve updated the guide with information about Reddit’s new B2B audience segmentation capabilities .\nUse the form below and MarTechBot will add content to this page specific to your role in your organization. If you’d rather not customize the content, just keep reading.\nReddit is a social news aggregation, content rating, and discussion website where users post content — links, text posts, images and videos —  which can be voted up or down by other members. Content is organized into user-created boards called “Subreddits,” which focus on particular topics. It is known for its engaged community and is the 11th most-visited website in the world and 6th in the U.S.\nIt has more than 100,000 Subreddits. These are moderated by volunteer users, so the quality of posts can vary. Many, like r/askscience (25 million subscribers) and r/askhistorians (2 million subscribers), are widely respected forums where experts respond to questions. That said, plenty are as bad as the internet can get. Fortunately, because Subreddits are topic-specific, it is easy for brands to avoid those.\nIts most popular feature is the Ask Me Anything (AMA) events which have starred luminaries like President Obama and Bill Gates, as well as actors, musicians, astronauts and more. While those are the top draws in terms of numbers, AMAs with topic experts can draw very well within a particular Subreddit.\nIn December 2023, Reddit hosted more than 1 billion posts and more than 16 billion comments in total.\nDig deeper: Reddit testing new tools to help brands boost engagement\nThere are several different ad types on Reddit, including promoted posts, takeovers, dynamic product ads and lead generation ads .\nPromoted posts appear in Redditors’ feeds and look like native posts. There are six different formats, which can be mixed and matched as needs and budgets allow:\nA takeover is when your brand’s advertising is the first thing seen on certain parts of Reddit for 24 hours. There are four different types:\nThe keyword for marketing on Reddit is engagement — the more you do, the more response you will get. Many businesses run image and video ads and leave it at that, but here’s what the moderator of the company-run r/Redditmarketing says is the best practice.\nReddit is a quirky site and each community has its own do’s and don’ts (helpfully posted at the top of each Subreddit). For example, no advertising is allowed on r/advertising.\nLaura Schiele , head of paid acquisition at Jordan Digital Marketing, says overall you need to have a humanistic brand voice and sound willing to poke fun at yourself. The more you know your audience, the better you will do — a real plus for B2B marketers.\n“We have some companies where the audience is specifically engineers and we’ve had success with that,” she told MarTech. “If you have a community you want to get in front of, you can get them on Reddit.”\nShe also emphasizes that quality, tailored creatives are important on Reddit. It’s good to use or refer to the site’s jargon or activities, but it has to be done in a low-key way.\nThe user base appreciates expertise and informed comment — two of B2B marketing’s strengths. Doing an AMA with the appropriate community and responding to other people’s posts and questions in a Subreddit will go a long way toward building credibility.\nThat’s especially important because many people go to Reddit to get product recommendations from other users. These can sometimes be early indicators of good or bad news. For example, the Subreddit r/buyitforlife is about the most durable, highest-quality consumer goods. Over the years I’ve seen early signs of brands’ rising as they get discovered and falling as their quality has declined.\nBecause Reddit is a platform where people gather to discuss particular topics they’re interested in, it can have an outsized impact on brand reputation. You will find people passionate about whatever area your brand operates in. Of course, their passions can run both positive and negative, so it is essential to monitor the site. Your brand’s engagement will be appreciated by users as long as you focus on sharing expertise and information. Company-initiated hype doesn’t go over well there.\nThe first thing to do is have a brand profile with the brand’s name. People like to know they are getting info straight from the source. Next, be sure to obey the overall rules of Reddit and any specific to the Subreddit you’re posting in. Develop a Reddit-specific strategy and be consistent in your posting.\nIt’s important to remember that Reddit doesn’t arbitrate disputes. It suggests posting the correct information on Reddit to counteract any false information. “The Reddit community is usually very supportive of such a response and will likely vote to give the correction greater prominence than the original post,” reads Reddit’s FAQ.\nWhen it comes to the specifics of advertising it’s important to know that 75% of the global Reddit audience accesses the site via mobile, so be sure to optimize for phones and tablets.\nBecause Reddit is all about finding the right audience it’s good to know there are several third-party analysis apps available. Additionally, the platform has updated Reddit Ads Manager with tools that help generate ad copy, edit assets, optimize campaign results, manage budgets and more .\nReddit has added Dynamic Product Ads to its suite of tools for marketers. It combines shopping signals with machine learning and advertiser product catalogs to serve the most relevant products to the users with the highest likelihood of purchasing.\nFeatures include instant campaign creation as the ads auto-populate in real-time with the latest images, pricing and product images from an advertiser’s catalog. It also has two new targeting options. Retargeting serves ads to people based on products they’ve previously engaged with on the advertiser’s site. Prospecting serves ads for the most relevant products based on what people engage with on Reddit or advertiser sites. The company says this provides support across the purchase journey with feed and conversation placement and single image or carousel format ads reaching Reddit users in the discovery, consideration or decision-making mindset.\nDynamic Product Ads is now in public beta and available to all Reddit advertisers globally. English, German, Spanish, French, Italian and Portuguese are supported via the Reddit Ads Manager.\nReddit has launched Lead Generation Ads in public beta, available globally for advertisers working directly with the platform.\nThe new ad format, an integration with Zapier, allows advertisers to collect user information directly on the platform, potentially improving lead quality and campaign performance for businesses across various industries.\nReddit’s new ad format , combined with its engaged user base and Zapier integration, could make it a more attractive platform for businesses looking to generate high-quality leads efficiently. This represents a significant step in bridging the gap between user engagement and advertiser needs, potentially reshaping how businesses approach lead acquisition in online communities.\nReddit has purchased Memorable AI, a creative testing company that optimizes ad creative based on previous campaign KPIs. The move is designed to put its ability to enhance campaign performance on equal footing with Google, Meta, Amazon and TikTok.\n“Memorable AI has a proven track record for optimizing ad creative to drive the best possible results before advertisers run a single ad,” Reddit Chief Operating Officer Jen Wong said in a blog post . “This acquisition allows Reddit to accelerate our work in optimizing, generating, and selecting ad creative to deliver even better results for advertisers. We are thrilled to welcome the Memorable AI team to Reddit.”\nMemorable AI’s technology analyzes reactions to visual content so advertisements can be better targeted and creatively optimized. It suggests ways advertisers can tweak creative to drive their chosen metrics by analyzing past campaign data derived from ad platforms, DSPs and ad servers. The company’s tools will be integrated into Reddit’s ad stack and available to all advertisers.\nThese are the top Subreddits for marketers, ranked by number of users and a brief description.\nAs with every popular social media site, Reddit can feel like junior high school. There are unspoken rules about what’s cool and what isn’t. There are popular kids and cliques. What appeals to one group may make another roll its collective eyes.\nGet it right and you win, according to Reddit , which found that the CPAs of ads using “Redditisms” were 70% lower than those that didn’t. Likewise, ads mentioning a specific Subreddit are 1.3 more likely to increase awareness.\nTo help marketers get it this right, the company added the “Reddit ads inspiration library” to its Ads Manager.\nIt provides a large selection of the site’s best-performing ads in various verticals. You can filter search results by keyword, vertical, ad budget, format, placement and objective.\nIn October 2024, Reddit reported its first-ever profit last quarter thanks largely to a 56% growth in advertising revenue YOY.\nOverall, third-quarter revenue jumped 68% to $348.4 million from $207.5 million at the same time in 2023. The company had a net income of $29.9 million, compared with a net loss of $7.4 million for the third quarter of 2023. Total U.S. revenue grew 70% year over year, while international revenue grew 57%, the fastest growth rate in over two years.\nAdvertising revenue was $315.1 million for the quarter. It was primarily driven by increases in impressions delivered from higher user growth, more efficient ad load and expansion of conversation placement ads, while pricing was consistent with the prior period, according to COO Janet Wong.\n“In Q3, advertising revenue growth was across the funnel,” the company said in its letter to investors. “We launched new conversion API (“CAPI”) integration partnerships and CAPI adoption grew over 2x from Q2.”\nWorth noting: Ad revenue grew in the quarter even before Reddit’s new ad products, including generative AI creative tools and in-comment ads, were fully integrated into its platform.\nReddit launched two significant products for marketers in early January 2025. One is a trend analysis tool, the other is a new advertising format for its popular Ask Me Anything (AMA) sessions.\nReddit Pro Trends is a free tool that tracks real-time trends and can help marketers discover communities on the site. It analyzes conversations by identifying keywords and phrases, allowing marketers to understand where their brand, topics, and categories are being discussed.\nIt also analyzes over 100,000 “smart” keywords, which allows it to differentiate between things like “apple” the fruit, and “Apple” the company.\nThe aim is to provide marketers with more insights into user behavior. This, in turn, lets brands create relevant, engaging content that resonates with Reddit users.\nAMA Ads is an ad format specifically designed to reach users interested in AMA conversations. This provides a targeted way to connect with engaged audiences on the platform. Reddit said the new format gives a structured way to participate in these conversations rather than just observe them.\nIt lets businesses promote Q&A sessions directly through Reddit’s ad dashboard, complete with RSVP tracking capabilities and includes a “Remind Me” button to keep the AMA on the user’s radar.\nReddit CEO Steve Huffman said during a video Ask Me Anything (AMA, in Reddit lingo) on the site that a paywall is coming to the site in 2025.\nArstechnica reports Huffman said during the chat that the company is “working on it as we speak.”\nThe paywall would most likely take the form of paid sub-Reddits, which Reddit users would need a subscription to access.\nReddit reported earnings the day before Huffman’s AMA. The company’s stock fell despite year-over-year earnings growth. Huffman reported volatility in traffic to the site, and put the blame on Google algorithm changes .\nReddit is rolling out a new ad control feature that gives users more power over the sponsored content they encounter on the platform.\nUsers can now hide any feed-based advertisement using a dropdown menu, blocking content from that advertiser’s account for at least one year. This feature complements the existing Report function, which also triggers advertiser blocking.\nThe feature creates stronger incentives to deliver relevant, quality advertising experiences. When users can block an advertiser’s entire account for at least a year with just one click, poor targeting or low-quality creative could result in permanent audience loss.\nReddit released new tools and updates to help SMBs advertise and monitor events on the site.\nReddit is replacing the old “Member count” metric on subreddit pages with two new measures:\nThe goal is to offer a better view of what “active” truly means, since many Redditors engage without formally subscribing to a community.\nTraditional subscriber numbers have often overstated or misrepresented a subreddit’s real activity. Reddit hopes to highlight authentic engagement by spotlighting how many users are showing up and contributing content. Marketers, social strategists and brands that use Reddit for audience insights or community building can now more reliably gauge which subreddits are active and worth investing time into.\nMarketers should rethink which subreddits they watch or invest in now that Reddit has made “Contributions” and “Visitors” visible. The new metrics show where conversations are happening—not just where passive followers pile up. That means subscriber counts are no longer the best proxy for influence. A content strategy built only on list size misses the point; posts and comments are the currency that signals momentum. Tracking contributions over time gives a sharper benchmark for whether your content sparks dialogue or sinks into the void.\nBombora has struck a strategic partnership with Reddit to bring firmographic and behavioral B2B audiences directly into Reddit’s network of decision-makers. With Reddit reaching 61% of business decision-makers through communities ranging from r/techsupport to r/cybersecurity, this deal provides advertisers with the opportunity to tap into intent-rich, conversation-driven environments at scale.\nThrough the deal, marketers on Reddit gain access to Bombora’s full suite of B2B audiences — including over 19,000 Company Surge® intent-based segments, 6,300+ attributes for custom audience creation, prebuilt firmographic and behavioral segments, and support for account‑based marketing lists. Even niche targets, such as leaders at emerging “unicorn” companies or specialized industry verticals, become accessible via Reddit’s 23 billion posts and comments."
  }
]