[
  {
    "url": "https://blog.hubspot.com/marketing/ai-email-content-suggestions",
    "title": "AI-powered email content suggestions that actually convert leads",
    "date": "2025-12-15T14:00:02+00:00",
    "content": "AI-powered email content suggestions are changing how marketing teams write, test, and scale email campaigns. Instead of guessing what message will resonate, marketers can now use AI to analyze data, predict engagement, and generate personalized content that converts.\nBut there’s a huge difference between emails that sound good and emails that perform .\nIn this guide, we’ll cover how to use AI email content suggestions to deliver stronger open rates, higher click-throughs, and measurable revenue impact.\nAI-powered email content suggestions use machine learning to tailor your subject lines, body copy, and CTAs to each audience segment and lifecycle stage. The system analyzes engagement data, like open rates and replies, to recommend what message, tone, or offer is most likely to drive action.\nWhen connected to your CRM, AI turns raw engagement data into actionable insight. Instead of guessing what your audience might respond to, you see which phrases, formats, and offers actually convert. As the AI tool collects and analyzes more data, it compounds on those learnings with every send.\nThe real advantage comes when these suggestions are used inside automated email campaigns . That integration creates a feedback loop between your content and data, allowing the AI to adapt in real time to audience intent and performance signals.\nReal results in action: HubSpot’s own demand generation team used AI to transform their email nurturing strategy, analyzing user behavior and website data to deliver hyper-personalized content recommendations.\nBy using GPT-4 to understand intent and match users with relevant courses, we achieved an 82% higher conversion rate, 30% better open rate, and 50% lift in click-throughs.\nRead more about it in the 2025 State of Marketing Report .\nWhen it comes to email creation, the real power of AI lies in tools that plug into your CRM and connect to your customer data. With this insider information, crafting compelling headlines or body copy is a breeze.\nHere are a few top options to consider, starting with HubSpot’s Breeze Copilot.\nHubSpot’s Breeze Copilot is built directly into the HubSpot email editor, giving marketers an AI assistant that knows their audience as well as their CRM does. It uses existing data, like lifecycle stage, engagement history, and past campaign performance.\nWhy it stands out: Most AI writers generate generic copy. Breeze Copilot is different, as it grounds every suggestion in your own CRM data and campaign analytics. That means smarter recommendations that match real buyer behavior.\nBest for: Marketing teams that want to combine creativity with data-driven precision.\nHubSpot pro tip: Pair Breeze Copilot with AI-assisted content creation to build reusable, modular assets, like headers and footers. You can then drag and drop those assets into future campaigns.\nWritesonic’s dedicated email generator helps marketers craft targeted email campaigns quickly in more than 25 languages.\nIts strength lies in how easy it is to iterate. Whether you’re writing onboarding sequences, announcing a product launch, or sending a recurring newsletter, Writesonic’s saved templates let you start with proven frameworks instead of a blank page.\nBest for: Marketing teams who need to turn around multiple campaign emails quickly, especially newsletters, product updates, or launches, but haven’t yet opted for a full CRM-embedded AI writing workflow.\nSeventh Sense is the secret weapon for timing. It uses machine learning to predict when each contact is most likely to open or click an email, then schedules delivery accordingly. By learning from historical engagement patterns, you ensure that your perfectly written AI-generated emails land in inboxes at the exact moment they’re most likely to be seen.\nBest for: Teams focused on maximizing open and click-through rates through smarter send times.\nCopy.ai is a creative AI platform that helps teams build multi-step workflows for campaign creation. It includes templates for full email sequences, making it a great tool for teams managing complex lifecycle or drip campaigns.\nBest for: Marketing teams that need to scale high-quality emails across multiple products or regions quickly.\nPricing: Plans vary. For Chat, plans start at $29/month.\nMailMaestro is an AI‐powered email writer and assistant designed to integrate directly with Outlook and Gmail, letting teams draft, reply, and manage professional email content more quickly and effectively.\nIt supports multiple languages, tone adjustments, and context-aware drafting, helping marketers scale email content production without sacrificing clarity or brand-voice integrity.\nBest for: Marketing and operations teams that handle high volumes of email communications.\nChatGPT is the most versatile large-language model for marketers looking to brainstorm, draft, and refine email content fast. You can use it to outline entire nurture flows, generate subject line variations, rewrite CTAs, or test tone and voice before syncing the copy into your CRM.\nBecause it’s not limited to pre-built templates, ChatGPT is great for creative ideation, making it an ideal starting point for teams that want to experiment with AI before committing to a fully embedded system.\nWhat we like: Great for brainstorming prompts or rephrasing CTAs across lifecycle stages.\nBest for: Teams developing a prompt library to fuel CRM-connected workflows.\nAI tools are fantastic for quickly creating email content that keeps readers engaged. But these tools work better when they’re connected to your data and approval processes.\nAI email suggestions are only as smart as the data they learn from. Create a single source of truth inside your CRM and consolidate:\nWhen your data is unified, your AI can recognize key patterns, like which content drives MQLs versus which stalls at the SQL stage, and generate a copy that reflects that insight.\nHubSpot Pro Tip: Treat data hygiene as part of content strategy. The more accurate your CRM, the better your AI recommendations.\nAI tools amplify personalization. That means any weak spots in your personalization consents or segmentation will be highlighted. Avoid this by:\nOnce confirmed, define your key lifecycle segments. This segment-level context helps the AI adapt tone and CTA strength to where a contact is in the journey.\nExample: A top-of-funnel lead might see “Learn more,” while an active trial user receives “Schedule your onboarding call.”\nUse HubSpot’s AI email assistant to start generating contextual copy directly inside your email editor. Because it’s native to HubSpot, the assistant automatically references:\nYou can also toggle between AI-generated subject lines, body copy, or CTAs, all while maintaining CRM context. With these insights and user options, content suggestions can be automatically tailored to fit your brand and your goals.\nIf you’re managing multiple campaigns or teams, modular content is your best bet for efficiency. Using HubSpot’s AI-assisted content creation tools, build a shared library of pre-approved elements, like intros, feature blurbs, and CTAs, that AI can pull into future campaigns.\nHubSpot Pro Tip : Label modules with tags like “BOFU CTA – Demo” or “Awareness Body – Product Value” so your AI assistant learns which assets perform best at each stage.\nThis cannot be stressed enough: AI-generated content should never be a one-click send.\nCreate approval workflows that route new email versions through a human reviewer before launch, especially for campaigns involving pricing, compliance, or regulated industries.\nWithin HubSpot, you can set role-based permissions to allow marketing leads, compliance officers, or product marketers to review drafts before publishing. This keeps your AI both efficient and accountable.\nWhen your CRM, content library, and approval process are working together, AI stops being a writing shortcut and becomes a conversion engine. Every email aligns with the right audience with a real shot at an expected outcome.\nGood AI depends on great direction. Without clear context, even the most advanced model will give you generic, one-size-fits-all copy. The key is to prompt your AI like a strategist, not just a writer.\nThat means telling it who you’re talking to, what you want them to do, and why now .\nWhether you’re using ChatGPT, Claude, or HubSpot’s AI email assistant, a few well-structured prompts can turn generic suggestions into high-performing, lifecycle-specific content.\nGoal: Introduce value quickly and encourage engagement.\nPrompt example: “ Write a 120-word welcome email for new sign-ups who downloaded our guide. Include one clear CTA to start a free trial and reference their interest in [topic]. Maintain a confident, approachable tone.”\nHubSpot pro tip: Use HubSpot’s AI email assistant to instantly generate multiple versions of your welcome email and test open rates across your automated email campaigns.\nPrompt example: “Generate a follow-up email that highlights a customer success story relevant to mid-funnel prospects. Keep tone helpful, not salesy. End with a soft CTA to schedule a demo.”\nHubSpot pro tip: You can find additional tested examples in HubSpot’s AI prompts for email content library.\nPrompt example: \" Write an email for contacts who engaged with pricing pages twice this week. Use urgency and social proof to encourage booking a demo.”\nHubSpot pro tip: Pair this with CRM filters to ensure only active, high-intent contacts receive the message.\nPrompt example: “Compose a renewal reminder for existing customers. Reinforce ROI achieved so far, introduce one new feature, and offer an incentive for early renewal.”\nHubSpot pro tip: Use HubSpot’s automation rules to trigger this sequence 30 days before contract expiration, and measure conversion uplift over time.\nUse this simple, repeatable structure for every prompt you write. It works whether you’re drafting in ChatGPT, Claude, or directly inside HubSpot’s AI email assistant.\nWhen used consistently, this framework helps AI generate more personalized, compliant, and performance-oriented email copy. You can also test variations directly in automated email campaigns to see which elements drive higher open, click, and reply rates.\nNeed more ideas? Explore AI prompts for email content for ready-made examples you can adapt to your workflows.\nWhile it’s true that AI can scale content production, without the right systems, it can also scale mistakes. A strong QA process protects your brand voice, ensures compliance, and keeps every AI-generated email aligned with your audience’s expectations.\nWhether you’re using HubSpot’s AI email writer or a large language model like ChatGPT, build guardrails into your workflow from the start.\nBefore any AI-generated email goes live, it should pass a two-layer QA process:\nReview for clarity, tone, accuracy, and alignment with the campaign goal.\nVerify that claims, disclaimers, and data usage follow regional privacy and consent rules.\nFor sensitive or high-stakes topics, like finance, health, legal, or regulated industries, add a subject matter expert (SME) review loop before publishing. A five-minute check by an internal expert can prevent weeks of damage control later.\nHubSpot pro tip: In your prompt library, include disallowed patterns (e.g., exaggerated claims, pressure tactics, or speculative results). Then train your team to flag and rewrite any AI-generated content that drifts into that language.\nEmbedding these tone and compliance rules directly in prompts keeps your AI from crossing your brand lines, even when generating at scale.\nPersonalization builds trust when it’s based on value. Use data responsibly, and design prompts that always respect permission settings.\nInclude privacy-safe context in every instruction: “Use only consented data points (e.g., name, company, or product type) to personalize this email.”\nWhen key data is missing, the AI should gracefully generalize: “If the user’s location is unknown, use a neutral greeting like ‘Hey there!’ instead of referencing city data.”\nOnly include data that’s necessary for relevance. Avoid sensitive attributes, even if technically available in your CRM.\nClose every personalized email with a simple way to manage settings or unsubscribe.\nHubSpot Pro Tip: Document your personalization guardrails in the same place as your prompt templates. When a team member or AI assistant pulls a new draft, privacy is a default.\nWhen done right, guardrails make email content creation safer and faster. By defining how your brand writes, what it never says, and what data it uses, you can scale content creation confidently across every campaign and segment.\nAI-powered content is just like any other part of your content strategy—you need to measure performance. A strong measurement plan helps you separate “sounds good” from “actually performs.”\nUse a test-and-learn approach to understand what works, prove ROI, and continuously refine your email strategy.\nStart by mapping your tests to lifecycle stages. Each stage focuses on a different lever for performance:\nMultivariate tests sound efficient, but can blur your results. To isolate true impact, adjust only one variable per variant, like subject line length, CTA wording, or tone.\nHubSpot Pro Tip: Use automated email campaigns to schedule, randomize, and record your variants automatically so you never lose data mid-test.\nThe power of testing inside a connected CRM is attribution. Every click, reply, or conversion can be traced back to the specific AI suggestion that influenced it.\nThis end-to-end visibility helps you answer the ultimate question: Did AI make us more effective, or just more efficient?\nYour email results are also signals for broader brand visibility. Use AI Search Grader to analyze your brand in AI search and see how your messaging performs in AI-driven search experiences.\nWhen the language that performs best in email also appears in AI search summaries, you’ve hit message-market alignment. This step ties your email testing back to top-funnel visibility, closing the loop between engagement and discovery.\nCreate a single view of your key metrics so your team can quickly see what’s working. Include:\nHubSpot pro tip: Build this as a shared HubSpot dashboard or Google Sheet synced via API. Over time, you’ll identify which prompt types, tones, or CTA structures deliver consistent lifts. Then, you can train your AI email assistant to prioritize those patterns automatically.\nEven experienced teams run into a few common mistakes when scaling AI workflows. Here’s how to avoid them.\nBegin with one clear use case, like onboarding or nurture, and one prompt library. Test your process in a controlled environment before scaling. HubSpot’s Breeze Copilot makes this easy: open your email editor, generate subject line and body copy variations, and compare results instantly inside your campaign dashboard.\nTrain your AI on your voice, not someone else’s. Include a short brand voice brief in every prompt, keep a “do not use” list for banned phrases or exaggerated claims, and route sensitive messages through a quick human review before publishing. This two-step process keeps every AI-generated email consistent, compliant, and trustworthy.\nPersonalization should feel like relevance, not surveillance. Use only consented data and focus on delivering clear value. HubSpot’s consent-first personalization tools make it easy to give subscribers transparent controls and preference management.\nStart small and measure clearly. Build a simple test matrix by lifecycle stage — subject lines for awareness, CTAs for decision — and change one element at a time. Track each variant in HubSpot’s campaign analytics and tie outcomes directly to CRM metrics like open rate, CTR, MQL, or SQL conversion. Keep what works, retire what doesn’t, and document learnings for your next round.\nHubSpot’s Marketing Hub powers creation, testing, and delivery through automated email campaigns. Content Hub manages reusable assets and brand voice libraries. Breeze Copilot and Agents automate AI-driven workflows and suggest optimized copy inside your editor, while AI Search Grader helps you analyze your brand in AI search and measure visibility across emerging AI-powered discovery channels.\nAI-powered email content suggestions use machine learning to generate subject lines, body copy, and calls-to-action tailored to your audience and lifecycle stage. By connecting these suggestions to your CRM data and workflows, you can boost open rates, clicks, and conversions—while saving time and maintaining brand consistency.\nReady to see the impact? Start free with HubSpot’s Marketing Hub and see how AI-powered content can transform your email performance."
  },
  {
    "url": "https://blog.hubspot.com/blog/tabid/6307/bid/34006/15-examples-of-brilliant-homepage-design.aspx",
    "title": "Website homepage design: My favorite 32 examples to inspire you",
    "date": "2025-12-15T14:00:00+00:00",
    "content": "Your website homepage is your company’s first impression for most customers, and first impressions are everything. Your landing page needs to make a killer first impression to encourage potential customers to stick around and engage.\nIn this guide, I’ll share some best practices for homepage design along with brilliant homepage design examples that have implemented these practices.\nThrough trial and error (and a whole lot of website analytics ), I’ve developed a set of homepage design best practices that consistently deliver results. These practices have helped me create homepages that are not only attention-grabbing but also compel action and leave a lasting impression on visitors.\nDon’t leave website visitors guessing. Introduce your brand and mission above the fold.\nI usually start by crafting a punchy headline that captures my brand’s identity and purpose. Keep it short, no more than eight words. TL;DR and short attention spans rule the internet, so longer headlines get skimmed over.\nIf I need more message room, I’ll add a subheading with my brand's key benefits.\nI’ll also include high-quality visuals like videos, images, or animations to reinforce my brand messaging and capture attention.\nFree visuals are always tempting, but relying heavily on them can lead to a cookie-cutter look on your website. Create unique visuals to increase your brand memorability.\nYour homepage should be laser-focused, engaging, and speak to your target audience in a style that makes them comfortable.\nResearch is my secret weapon in this case. I research my target audience ’s behaviors, preferences, needs, and challenges. Those findings guide the language and tone I use in my homepage elements. My goal is to speak in terms they use daily and avoid confusing them with technical jargon.\nWhile making viewers feel comfortable, it’s also important to create trust through your phrasing, so be careful not to use too much slang.\nYour homepage must explain your unique selling proposition (USP) . I start by asking myself what makes my products, services, and brand unique. Then, I ask why they’re superior to my competition.\nYour design elements should prominently display that message, whether as part of your headline and subheading or built into your hero image. Your message should focus attention on the USP.\nFor example, at HubSpot, our USP is perfectly captured in our subheading: “Seamlessly connect your data, teams, and customers on one AI-powered customer platform that grows with your business.”\nI also support my USP with other secondary elements, including:\nConsider contrasting colors in your palette or simple animations to focus attention on your USP.\nIn today’s mobile-first world, much of your website traffic will come from smartphones or tablets. In fact, as of 2024, mobile devices account for 67.3% of website traffic .\nI always plan for mobile responsiveness as part of every homepage. These three points are the cornerstone of my process to optimize a homepage for multiple devices .\nAvoiding slowing your page is especially important. Paige Arnof-Fenn , founder and CEO of marketing network Mavens & Moguls, says if your website doesn’t load in 3 seconds or less, “your users will go somewhere else, and the opportunity will be lost.”\nMute any sounds on your website as the default to avoid blasting mobile users with unexpected loud music. If they’re in a space where sound doesn’t matter, they can tap to turn sounds back on.\nYour homepage should also be designed to drive action. Using multiple calls to action (CTAs) improves those results.\nCTAs tell my website visitors what I want them to do next, whether it’s signing up for a free trial, exploring a specific product category, downloading a valuable resource, or contacting your sales team. They are the bridge between interest and conversion.\nHere’s what I do to maximize the effectiveness of my CTAs.\nDon’t overload your homepage with too many CTAs. Consider one or two per section of your homepage. The goal is for them to be easy to find, not overpowering.\nYour homepage should unmistakably reflect your brand’s style, creating a strong, cohesive identity that visitors recognize and remember.\nIf your brand already has strong product packaging or on-site branding, use those designs as a foundation to build your homepage.\nThe most effective homepages evolve regularly to meet the changing needs, problems, and questions of their visitors.\nI regularly update my homepage content to reflect current events, seasonal changes, emerging design trends, and special promotions. For instance, adjusting featured product page callouts during the year will keep your homepage fresh and relevant to visitors’ interests.\nI also use A/B testing to compare the effectiveness of different versions of my homepage elements (headlines, CTAs, visuals, and layouts).\nFinally, I use dynamic content that automatically changes based on visitor data. For example, my website can use location data to update currency settings and pricing.\nDon’t change elements just because a certain amount of time has passed. Each update should provide value to visitors.\nYour homepage needs to be accessible to every visitor to ensure a smooth and positive experience, which is crucial for building trust. The main accessibility features to consider are alternative text for images (alt text), keyboard-only navigation, resizable text, color contrast, and closed captions for videos.\nMany homepage design templates include some of these features (especially helpful to small businesses), but I always check local, state, and federal rules to make sure I include everything that’s required.\nCheck out HubSpot’s web accessibility guide for more on how to create accessible websites.\nI’ve shared my personal best website homepage design practices. Now, let’s take a look at some of the best real-world homepage examples that put these best practices into action.\nThere might be a bit of bias here since it's our website, but HubSpot is one of the best examples of good homepage design.\nThe clear and concise headline immediately catches my eye by telling me how it can help my business, and the subheading explains the specific benefits.\nBut it’s not just about telling me what it does — HubSpot also wants me to engage. So, immediately after the headline, it includes two prominent CTAs encouraging me to take the next step while reassuring me there’s no cost to try it out.\nWhat we love: I love how the homepage cleverly uses figures and statistics to show the vastness of HubSpot’s community. This helps support its USP and core value proposition and builds trust through social proof.\nThe first thing that grabs my attention on Dropbox’s homepage is the social proof headline that doubles as a call to action. It’s immediately inviting me to join its tribe of over 700 million users who already trust Dropbox.\nThe supporting visuals and copy are also spot-on, with a classic minimalist feel that doesn’t distract from the messaging. Additionally, an animation showcasing Dropbox in action provides a dynamic and engaging demonstration of its functionality.\nWhat we love: I love that Dropbox describes different use cases throughout the homepage. Helping visitors relate to the tools on a more granular level improves the odds of a conversion.\nA24 Films takes a unique approach to its homepage engagement, which works quite beautifully. Instead of a text-heavy layout that I often encounter on other websites, the homepage only features promos for its new films above the fold.\nThis is a great strategy for grabbing visitors’ attention — in fact, when I landed on the website, I clicked through and watched several before remembering I was supposed to be reviewing the page.\nWhat we love: This homepage example showcases the best of simple design. I love how every item on the homepage is a full-screen section as you scroll down — with just one image and a large text link.\nFreshBooks accounting software mainly targets small and medium-sized businesses. The website's homepage immediately outlines its features so I can quickly understand what I stand to gain by trying it out.\nThere’s also a great use of contrast and positioning with its primary calls-to-action (“Try It Free” and “BUY NOW & SAVE”).\nWhat we love: I love FreshBooks' use of social proof. The homepage includes customer testimonials to show real-world success, plus star ratings from third-party sites to build trust and credibility.\nAs Garry West , director at Imagefix, a design and digital marketing agency, says, social proof tells potential customers and visitors that a company “isn't just making promises — it delivers for others like them.”\nOmsom is a great homepage example of talking to their audience’s stomachs. Its homepage features a scrumptious meal that makes me hungry just looking at it. And the headline, “Real Asian Flavors in Minutes,” lets me know I could have a similar plate on my table in minutes.\nAs I scroll down, the homepage dives deeper into how the product works, addressing any potential skepticism I might have and offering more CTAs to try for conversions.\nWhat we love: I love that the hero section of the website features glowing customer reviews and a free shipping offer. This helps build social proof and motivates me to take action.\nPixelgrade is another solid example of a simple but effective design. There are no overwhelming menus or jargon — just a clear, bold title that tells me the company’s main offering (simple WordPress themes) and a subtitle that hints at the beautiful possibilities of taking them up on its offer.\nBut what really sold me was the way the page builds trust. As I scroll down, Pixelgrade showcases three reasons I should choose it, and a real testimonial from a happy customer backs up each reason. Social proof like that makes a huge difference.\nWhat we love: The simple design and the color combination that makes the above-the-fold CTA stand out is beautifully done.\neToro is an investing platform for trading securities, including stocks and crypto, which the homepage color scheme and style reflects well.\nThe homepage immediately welcomes me with a clever headline: “FRIENDLY PLATFORM, SERIOUS INVESTORS.” This headline conveys to me that eToro is accessible and easy to use for new investors but also possesses the depth and breadth needed for seasoned investors.\nThe homepage also perfectly leverages social proof. It cleverly weaves in the total number of users (30 million) in the subheadline. That’s a huge confidence booster for any visitor. Plus, the impressive 4.2-star Trustpilot rating right below adds another layer of trust.\nWhat we love : I love the use of the color green for its calls to action. Green is often linked to growth, prosperity, and financial well-being, which works well with eToro’s goal of empowering customers to achieve their financial goals and build wealth.\nChipotle's homepage is all about visual persuasion. The above-the-fold imagery includes a close-up video of the featured meals, plus high-resolution images that showcase the famous restaurant’s signature dishes in all their glory. Anticipating the needs of most of their website visitors, Chipotle includes prominent CTAs for finding a location or ordering online.\nThe page design is clean and uncluttered, ensuring a smooth user experience and keeping the focus squarely on the delicious food.\nWhat we love: The food videos are captivating and make me hungry just by looking at them.\nSince Grammarly is a well-known brand, it can afford to use its homepage to promote one of its newest features: an AI writing assistant. The headline and the subheadline immediately sell me on the new feature’s benefit — helping my writing and, by extension, my reputation shine through the power of responsible AI.\nThe design reflects that Grammarly is all about writing and text, with the only visuals being CTAs, an animation example, and logos for social proof.\nWhat we love : To support its core value proposition, the page has an animation on the left side that provides visitors with a glimpse of how the new Grammarly feature works as soon as they land on the page.\nFor engaged couples planning their big day, eWedding is a great platform for building custom wedding websites. The homepage is simple and clean and only includes the necessary elements to get you started. It features great product visuals, a powerful headline, and a straightforward CTA that promises to make wedding planning easier.\nBut eWedding also understands that budget is a major concern and pain point if I'm planning a wedding. So, to address this concern, the website has a cost calculator that helps me estimate how much I could save on RSVP, a cash registry, and a custom website.\nWhat we love: A counter of the number of wedding websites built using eWedding (over 912,000) is a great use of social proof.\nSpotify epitomizes less is more. Its homepage immediately greets me with a simple value proposition and CTA — get the music and podcasts I want for free. Below the fold, each section reinforces that concept with a bold design and minimal text and follows up with another CTA.\nWhat we love: I love that Spotify’s homepage integrates customer service by including a short FAQ answering the most common questions new users will likely have immediately after signing up.\nColorsmith’s primary headline immediately tells me what the website is about, and the background visuals support the message by showing men using Colorsmith. It's relatable and helps the target audience picture themselves using the product.\nBelow the fold, Colorsmith follows up with details on how the process works and focuses on how each client gets custom color formulations for a perfect match.\nWhat we love: I love the placement of the “Craft My Color” CTA at different spots on the homepage. No matter where I scroll, the CTA is always nearby to take me to the next stage.\nMelyssa Griffin’s website homepage showcases both her expertise and personality.\nIt features a short looping GIF of her chair dancing that evokes fun and liveliness to drive home the idea that she’s a real person and not a random faceless entity. The design itself is bright and cheerful but not overwhelming.\nWhat we love: I love the inclusion of a quick quiz as an interactive element. It's a win-win for everyone — visitors learn their money management archetype while Melyssa generates leads.\nNine Lives Foundation uses empowering text and emotional images to connect with visitors. By using a subtle parallax effect to create a sense of movement without the need for larger video files, they help increase their website speed while keeping a sense of motion.\nGetting and giving help is made easy, too. A well-laid-out list of services and ways volunteers can help lives just below the fold.\nWhat we love: I love that Nine Lives addresses giving AND getting help on the same page with well-organized CTAs.\nDigiday uses traditional newsprint style and takes it into the future with a well-planned layout, creating the digital equivalent of a newspaper front page. Digiday gives readers a comfortable experience and encourages clickthroughs by building on a familiar format.\nWhat we love: I love how Digiday uses simple and uncluttered formatting to present a lot of news on one screen.\nAsana’s headline is an attention grabber, and the subheading explains the exact value proposition. Together, the two quickly communicate the core functionality and benefits of using Asana.\nThe homepage doesn't waste any time trying to get a conversion, either. Two prominent CTAs, “Get Started” and “See how it works,” sit right below the main headline, making it clear what they want me to do next.\nWhat we love : Asana leverages social proof exceptionally well. They keep my attention as I start to scroll by stating that 85% of Fortune 100 companies use their software. They then include logos for some of the best-known brands.\nEvernote's homepage will feel like a beacon of hope if your desk is a warzone of sticky notes like mine. The headline “Tame your work, organize your schedule” is enough to make me want to try it immediately.\nThe design stays true to the promise of organization with a simple layout and graphics. The CTA, with its bright green color against the white space, is impossible to miss as well.\nWhat we love : The primary visual is an image of Evernote in action. I can almost see my own to-do lists and notes neatly organized within the app. It's a powerful image that fuels a desire to get started and experience that organization firsthand.\nTelerik’s website pops with bold colors, fun designs, and videography that creates a Google-like vibe.\nA simple headline tells me its core value proposition, and the rest of the homepage backs that up with a simple, high-level overview of its primary product offerings. Plus, a scroll-triggered animation keeps the homepage engaging as you scroll.\nWhat we love: I love that even though this is a tech-based platform, the copy is refreshingly lightweight and easy to read.\nBasecamp’s homepage speaks directly to the needs of overwhelmed project managers, its primary target audience. Everything on the homepage is designed to nudge you towards their primary solution — a central hub for managing different projects.\nThe graphic echoes the tagline message, there’s a video demo embedded on the page, screenshots of the software, and the page is organized to flow naturally as questions are raised and answered.\nWhat we love: I love that the page is arranged to raise and answer questions in a logical order to guide the audience through the sales funnel.\nThis homepage empowers visitors to tackle a huge goal: clean water. The charity: water homepage directly tells visitors they can make a difference, with a payment portal at the top of the page.\nVisuals, creative copywriting, and interactive web design work together to engage visitors and encourage action. The charity also uses personalization to show a different follow-up homepage to repeat visitors.\nWhat we love: I love the use of personalization to help follow up with repeat visitors who might still need to donate.\nTechValidate’s product is managing social proof and they lean into that by incorporating their own social proof throughout the homepage.\nThis homepage is also beautifully designed, making use of white space and contrasting colors that draw your eye to the most important elements.\nWhat we love: I love that the product’s video is front and center, making it effortless for potential customers to learn more.\nMedium’s homepage is another brilliant example of less is more. It uses simple messaging on a bold background that communicates what the brand is all about and the key value proposition.\nThis is followed by a prominent and action-oriented CTA that invites me to take the next step. BY minimizing messaging, they lean into their “Stay curious” headline and create curiosity to drive clickthroughs.\nWhat we love: I love the bold yellow color, which immediately grabs attention, and the contrasting black text for optimal readability.\nKind Snacks uses bold colors and product photography to drive ecommerce. While their homepage changes frequently to stay dynamic, it is always focused on conversion, with CTAs for shopping prominently displayed.\nWhat I love: Kind Snacks speaks directly to its target audience and keeps the page fresh with frequent updates to focus on different products.\nAhrefs offers tools that can help teams improve their search engine optimization. The design of Ahrefs’ homepage is clean and modern but quirky and starts with a quick pixel-style loading animation.\nBrief descriptions of each tool just below the fold with screenshots provide a quick overview of their features, making it easy for me to understand the range of capabilities without needing to navigate away from the home page.\nWhat I love : I love the digital retro theme of the page. It's eye-catching and adds an approachability to the company . I also like the dynamic counter that displays the number of new Ahrefs accounts created in the past week.\nHappy Money’s homepage grabs my attention with a positive and emotionally charged message that promises you won’t be just another number with the company. The color scheme and graphics play into this humanized feel to drive home the idea of trust and approachability.\nBelow the fold is well organized to keep visitors scrolling by answering questions and providing more encouragement with social proof.\nWhat we love : I love how color and style work together to reinforce the messaging.\nHeadspace’s homepage works to create connections with second-person language and benefits featured prominently. A soft color palette, ample white space, and a minimalist aesthetic mirror the mental clarity and relaxation the app promotes.\nCTAs, are strategically sprinkled throughout the homepage, gently nudging me to explore the platform further.\nWhat we love : I love that the homepage includes short, guided meditations you can try right away without any signup to add value for visitors.\nTesla’s is a bold homepage example. The design is all about letting its products speak for themselves. It's entirely product-focused, featuring breathtaking visuals of Tesla vehicles in action.\nThis focus is deliberate. Tesla knows their cars are statement pieces, and there’s no need to clutter the message with extensive promotional text. It’s a perfect example of a brand perfectly understanding its USP.\nWhat we love : I love the inclusion of clear and concise CTAs and visuals that prompt me to seamlessly transition from admiration to action.\nThe Thrive Market is another example of a website that gets straight to the point. The homepage immediately asks me a question, encouraging immediate engagement and moving me one step closer to conversion.\nThe page features vibrant images of wholesome foods and natural products with clear, straightforward text promising you don’t have to break the bank to eat well.\nWhat we love: I love that Thrive Market keeps it interesting with their call to action buttons. Instead of using a generic “Buy Now” they get a bit cheeky with phrases like “I like overpaying.”\nThe minute I land on Angi’s homepage, I can immediately tell what the company is all about. It's a great homepage example of a core value proposition and call to action rolled into one with an immediately accessible search bar and quick link buttons.\nNo need to wander through menus or different web pages — I can jump right to the service I need from the homepage.\nWhat I love : The homepage design is clean, functional, and conversion-focused without the need to scroll or visit other pages.\nSecurity.org positions itself as the ultimate resource for all things DIY digital security. The homepage encourages visitors to do it themselves with Security.org’s help.\nIn addition, the page employs a clear, uncluttered layout with ample white space around the text and between elements. This ensures everything is easy to read and find.\nWhat we love : I love how Security.org also strategically leverages social proof. Displaying logos of news outlets that covered the company, like Forbes, Wired, and ABC, alongside a mention of their impressive 10 million+ YouTube views, builds trust and establishes the platform's credibility.\nTaylor Shanklin , CEO and founder of Barlele, a branding strategy and web design agency, says when designing a homepage, you should start by creating a clear list of problems your target audience has and the solutions you offer for those problems.\n“ Once you have that really well defined, it is easier to design the website interaction journey in a way that quickly and clearly communicates how you are the best company to provide a solution to their problem.”\nCarmax nails that concept and directly addresses two of my biggest concerns as a used car buyer: hidden costs and the quality of the vehicle they are buying.\nWhat we love : I love the positive outlook of the visuals supporting the navigation cues that guide me to various service areas, including car buying, selling, and financing options.\nAdobe is synonymous with creative software for audio and visual mediums, and the company leans on its reputation as its own proof of quality for Creative Cloud.\nA bold headline, “Beautiful Portfolio Websites,” and a subheading, “Free with Creative Cloud,” immediately communicate the main benefits, and background visuals show a wide variety of example portfolios.\nWhat we love : I love that the homepage features a curated selection of project examples to show the quality and diversity of portfolios I can create on the platform.\nIn the words of Garry West, a “ great homepage design is like a perfect handshake – it's strong, confident, and leaves a lasting positive impression.”\nIt’s worth investing time and effort into getting your homepage right. My personal best homepage design practices and these inspirational website page examples are great places to start gathering ideas to create a standout homepage for your brand. Who knows, perhaps your brand will be the next addition to our brilliant homepage examples list."
  },
  {
    "url": "https://www.searchenginejournal.com/cloudflare-report-googlebot-tops-ai-crawler-traffic/563303/",
    "title": "Cloudflare Report: Googlebot Tops AI Crawler Traffic via @sejournal, @MattGSouthern",
    "date": "2025-12-15T14:04:52+00:00",
    "content": "Cloudflare published its sixth annual Year in Review , offering a comprehensive looks at Internet traffic, security, and AI crawler activity across 2025.\nThe report draws on data from Cloudflare’s network, which spans more than 330 cities across 125 countries and handles over 81 million HTTP requests per second on average.\nThe AI crawler findings stand out. Googlebot crawled far more web pages than any other AI bot, reflecting Google’s dual-purpose approach to crawling for both search indexing and AI training.\nCloudflare analyzed successful requests for HTML content from leading AI crawlers during October and November 2025. The results showed Googlebot reached 11.6% of unique web pages in the sample.\nThat’s more than 3 times the pages seen by OpenAI’s GPTBot at 3.6%. It’s nearly 200 times more than PerplexityBot, which crawled just 0.06% of pages.\nBingbot came in third at 2.6%, followed by Meta-ExternalAgent and ClaudeBot at 2.4% each.\nThe report noted that because Googlebot crawls for both search indexing and AI model training, web publishers face a difficult choice. Blocking Googlebot’s AI training means risking search discoverability.\n“Because Googlebot is used to crawl content for both search indexing and AI model training, and because of Google’s long-established dominance in search, Web site operators are essentially unable to block Googlebot’s AI training without risking search discoverability.”\nThroughout 2025, AI bots (excluding Googlebot) averaged 4.2% of HTML requests across Cloudflare’s customer base. The share fluctuated between 2.4% in early April and 6.4% in late June.\nGooglebot alone accounted for 4.5% of HTML requests, slightly more than all other AI bots combined.\nThe share of human-generated HTML traffic started 2025 at seven percentage points below non-AI bot traffic. By September, human traffic began exceeding non-AI bot traffic on some days. As of December 2, humans generated 47% of HTML requests while non-AI bots generated 44%.\nCloudflare tracks how often AI and search platforms send traffic to sites relative to how often they crawl. A high ratio means heavy crawling without sending users back to source sites.\nAnthropic had the highest ratios among AI platforms, ranging from approximately 25,000:1 to 100,000:1 during the second half of the year after stabilizing from earlier volatility.\nOpenAI’s ratios reached as high as 3,700:1 in March. Perplexity maintained the lowest ratios among leading AI platforms, generally below 400:1 and under 200:1 from September onward.\nFor comparison, Google’s search crawl-to-refer ratio stayed much lower, generally between 3:1 and 30:1 throughout the year.\nNot all AI crawling is for model training. “User action” crawling occurs when bots visit sites in response to user questions posed to chatbots.\nThis category saw the fastest growth in 2025. User-action crawling volume increased more than 15 times from January through early December. The trend closely matched the traffic pattern for OpenAI’s ChatGPT-User bot, which visits pages when users ask ChatGPT questions.\nThe growth showed a weekly usage pattern starting in mid-February, suggesting increased use in schools and workplaces. Activity dropped during June through August when students were on break and professionals took vacations.\nCloudflare analyzed robots.txt files across nearly 3,900 of the top 10,000 domains. AI crawlers were the most frequently blocked user agents.\nGPTBot, ClaudeBot, and CCBot had the highest number of full disallow directives. These directives tell crawlers to stay away from entire sites.\nGooglebot and Bingbot showed a different pattern. Their disallow directives leaned heavily toward partial blocks, likely focused on login endpoints and non-content areas rather than full site blocking.\nFor the first time, organizations in the “People and Society” vertical were the most targeted by attacks. This category includes religious institutions, nonprofits, civic organizations, and libraries.\nThe sector received 4.4% of global mitigated traffic, up from under 2% at the start of the year. Attack share jumped to over 17% in late March and peaked at 23.2% in early July.\nMany of these organizations are protected by Cloudflare’s Project Galileo.\nGambling and games, the most-attacked vertical in 2024, saw its share drop by more than half to 2.6%.\nCloudflare’s report included several additional findings across traffic, security, and connectivity.\nGlobal Internet traffic grew 19% year-over-year. Growth stayed relatively flat through mid-April, then accelerated after mid-August.\nPost-quantum encryption now secures 52% of human traffic to Cloudflare, nearly double the 29% share at the start of the year.\nChatGPT remained the top generative AI service globally. Google Gemini, Windsurf AI, Grok/xAI, and DeepSeek were new entrants to the top 10.\nStarlink traffic doubled in 2025, with service launching in more than 20 new countries.\nNearly half of the 174 major Internet outages observed globally were caused by government-directed shutdowns. Cable cut outages dropped nearly 50%, while power failure outages doubled.\nEuropean countries dominated Internet quality metrics. Spain topped the list for overall Internet quality, with average download speeds above 300 Mbps.\nThe AI crawler data should affects how you think about bot access and traffic.\nGoogle’s dual-purpose crawler creates a competitive advantage. You can block other AI crawlers while keeping Googlebot access for search visibility, but you can’t separate Google’s search crawling from its AI training crawling.\nThe crawl-to-refer ratios help quantify what publishers already suspected. AI platforms crawl heavily but send little traffic back. The gap between crawling and referring varies widely by platform.\nThe civil society attack data matters if you work with nonprofits or advocacy organizations. These groups now face the highest rate of attacks.\nCloudflare expects AI metrics to change as the space continues to evolve. The company added several new AI-related datasets to this year’s report that weren’t available in previous editions.\nThe crawl-to-refer ratios may change as AI platforms adjust their search features and referral behavior. OpenAI’s ratios already showed some decline through the year as ChatGPT search usage grew.\nFor robots.txt management, the data shows most publishers are choosing partial blocks for major search crawlers while fully blocking AI-only crawlers. The year-end state of these directives provides a baseline for tracking how publisher policies evolve in 2026."
  },
  {
    "url": "https://www.searchenginejournal.com/seo-experts-offer-their-advice-for-2026/562845/",
    "title": "20 SEO Experts Offer Their Advice For 2026 via @sejournal, @theshelleywalsh",
    "date": "2025-12-15T14:00:39+00:00",
    "content": "This year has been a continuation of learning and understanding about how AI impacts our industry. It’s been less about the chaos of the initial disruption and more about “ how do we leverage this? ”\nMy belief is that SEO is a practice that needs to be adaptable to the end goal and not fixed to any predetermined notions centered around Google, ranking, or keywords. The foundation of SEO is about making yourself visible online wherever your audience can find you .\n“S’ is for “search engine,” but one of my favorite phrases from the year is from Ashley Liddell , who said “search everywhere optimization,” and that is the perfect approach for the mindset needed to continue in the next level of SEO.\nIt might be TikTok, YouTube, Google, ChatGPT, or Reddit. Most likely, it’s a combination of all of these.\nFor the technical side of SEO , it’s fundamental that your pages can be accessed by all search engines and machines. For the content side of SEO, you need to be creating content experiences that can be cited by search engines and machines. And everyone should be thinking about the bottom line: Does this align with the defined business outcome for my client/brand/company? Show me the money.\nOne critical area I wouldn’t overlook is agentic AI and the development of closed systems completing actions for users. Think booking a holiday, personal shopping for a styled wardrobe, or buying your food shop based on a specific diet. When that happens, you need to ensure you are in the game and included in those closed spaces. Start learning about this now.\nAs the AI future is coming fast, get ready and go with it rather than resisting it. 2026 is the watershed where you need to get on board to stay in the game.\nAt Search Engine Journal, we showcase some of the best SEO minds in the industry, and in our usual tradition, we asked 20 of the best practicing SEO experts, including many of our contributors, “In 2026, what should SEOs focus on to maintain visibility and achieve measurable results?”\n(Editor’s Note: The following are not in any order of preference and are displayed in the order of who responded first.)\nIn 2026, visibility is the result of having the right content, engaging on the right channels, and being mentioned in the right places.\nThe right content is a mix of hyperlong-tail articles/landing pages tailored to your audience(s) and based on your unique positioning and data stories. People prompt 5x longer than they search on Google, so you want to be the best result for their specific context. LLMs also love fresh, unique datapoints, so you want to create research-driven content.\nThe right channels are Google, ChatGPT, Reddit, Quora, review sites, LinkedIn, and niche forums. Those are not just the most cited platforms in LLMs but also in Google Search. But being present here takes an engagement strategy rather than an SEO approach.\nThe right places to be mentioned are authoritative publishers and review sites in your industry. LLMs seem to rely heavily on mentions from other (relevant) sites, so you have to be present in context (surrounding words) that reflect your positioning and market position.\nNow, to get visibility in all the places where it is needed, having a good website, with high-quality, indexable content, is table stakes; it is the bare minimum, and likely not enough.\nFor years, Google’s algorithm focused on using content and links to a site to evaluate that particular site, and rank it. AI search utilities and LLMs work very differently. They were designed to find a consensus and synthesize it, and they are looking across all the information that they have access to, to do it.\nThis means, if you are just relying on your website to create your visibility online, it will not be enough. There is no consensus and minimal synthesis from just one site.\nYour branding message needs to be widely distributed across the web to create a consistent but discernibly unique branding message.\n→ Read More: Google’s AI Search Journeys Are Reshaping SEO With Cindy Krum\nDuane Forrester , Founder and CEO, UnboundAnswers.com\nIn 2026, SEOs need to treat visibility as something earned through retrieval, not ranking.\nFocus on how content is chunked, cited, and most importantly, trusted by AI systems.\nAudit what gets surfaced inside chatbots and answer engines, not just in SERPs.\nBuild authority signals machines can verify: structured data, consistent sourcing, and entity clarity.\nUse embeddings, vector search, and retrieval testing to understand how meaning (not keywords) drives exposure.\nReplace “optimize for Google” with “optimize for systems that read like machines.” Your goal isn’t a blue link anymore. It’s being the trusted source those systems turn to when humans ask questions. Trust, in 2026, is paramount.\n→ Read More: Ex-Microsoft SEO Pioneer On Why AI’s Biggest Threat To SEO Isn’t What You Think\nIn 2026, SEOs need to refocus on clarity, consistency, and comprehension.\nEvery channel that describes your brand – your site, feeds, listings, and profiles – must tell the same story, in the same words, in a way both humans *and machines* can understand. That means cleaning up fragmented site structures, removing “hidden” or toggle-buried information, and ensuring the important facts live on the page in visible text. (Note, I did not say Schema doesn’t matter, but I am saying that there are situations where the Schema that is in the JSON-LD is NOT being read, and for those times, it is important that you have valuable product specs and data ON the page, in visible text, and not hidden behind a tab or in a toggle.)\nYou won’t be penalized or hurt yourself in Google or Bing by *also* optimizing for the lowest-common-denominator crawlers – but you will lose out on that extra visibility if you ignore them. Build pages that are fast (LLMs have a short attention span), crawlable, and semantically clear. Make sure your product, pricing, and positioning statements are consistent across every surface.\nThe goal isn’t *just* to rank anymore (though ranking is still a necessary first step in most cases). It’s to be retrieved, cited, and trusted wherever users search – whether that’s Google, Bing, or an LLM.\n→ Read More: Why AI Search Isn’t Overhyped & What To Focus On Right Now\nIn 2026, we are finally designing for the Reasoning Web, where agents will read, decide, and act on our behalf, and SEO becomes the discipline of making these systems effective. Visibility will depend on agentic readiness: clean structured data, stable identifiers, precise ontologies, and knowledge graphs that let agents resolve entities, compare offers, execute tasks, and learn from results.\nThis is a semantic shift: not simply about being “mentioned” in AI Overviews or ChatGPT, but about exposing products, content, and services as machine-operable assets through feeds, APIs, and tools that make agents smarter every time they interact with us.\nThe brands that let agents run the show, safely and verifiably, will own the next chapter of search.\n→ Read More: How Structured Data Shapes AI Snippets And Extends Your Visibility Quota\nThe most important thing, in our view, is understanding that AI search is ubiquitous now across three core experiences: SERPs, LLMs, and agentic experiences.\nFor the first two, SERPs and LLMs, there is a lot of overlap because they rely on a shared search index (Google in most cases), but the way in which the retrieval process works across these two experiences varies widely. This is why we are hearing that everyone’s No. 1 problem is getting good data, so spend time to make sure your monitoring and data pipelines are accurate and fine-tuned.\nFor the agentic experience, it’s still early but you should be thinking about how your product strategy will intersect with feeds and APIs (and new, related protocols like MCP). Search and product are intimately connected going forward, and the real ones will know that they always have been.\n→ Read More: AI Platform Founder Explains Why We Need To Focus On Human Behavior, Not LLMs\nWhatever you do, don’t lose your mind to the AI hype and try to radically reinvent your SEO efforts. Yes, it will be tougher to grow traffic and revenue from search, but too many SEOs have been coasting along and relying on Google’s own growth to fuel their figures. Now that clicks from Google have stagnated, you’ll need to be smarter about your SEO.\nSpend less time and effort on “busywork,” those minor little things that don’t bring any measurable improvement to your traffic. Do the stuff that actually works. Don’t compromise on quality, have a relentless focus on being the best, and make sure you capitalize on your site’s strengths and eradicate its weaknesses.\nSites that are significantly suboptimal, either technically or editorially, will simply not succeed. You have to be all-in on search, without cutting corners and “that will do” concessions. Anything less than that and you will end up on the wrong side of the zero-sum game that Google search has become.\nLily Ray , Vice President, SEO Strategy & Research, Amsive\nFor many years, I’ve answered this question with some version of “focusing on E-E-A-T,” and believe it or not, I think this answer *still* applies in 2026 with the rise of AI search.\nWhy? Because being mentioned in AI search is all about reputability, experience, and trust. The more your brand is well-known and well-respected in your industry, the more likely LLMs will be to cite you as a trusted and recommended brand. This requires earning mentions and positive reviews in all the places where it matters; having a well-known and well-respected team of individuals who contribute authentic, expert insights into the brand’s content, etc.\nAs homogenous, AI-generated content floods the internet, users will continue to want to follow real human creators engaged in honest and authentic conversations. Also, focus on the quality and conversion potential of content over the quantity of content, as the latter can cause major SEO headaches over time.\n→ Read More: The Role Of E-E-A-T In AI Narratives: Building Brand Authority For Search Success\nPedrio Dias , Technical SEO/AI Discoverability Consultant, Visively\nI believe that, in the current scenario where a significant amount of new (AI) technologies have been introduced between users and how we interact with the web, and are currently being seen through a disruptive lens, it’s more important than ever to maintain objectivity and pragmatism in our approach to organic visibility as a whole, and search in particular. As professionals, we need to understand in depth the changes that we’re being faced with, both from a technical point of view, but also (and maybe more importantly) from a behavioral point of view.\nIt’s tempting to cling to old habits and metrics to chase around, instead of assessing if and how we need to rework our strategies and tactics. We’re currently being bombarded with an insane amount of tools claiming to “give you insights into AI answers” and promising that they can give you directional “data” – and in some cases even bold claims of outcomes – but we haven’t even started to understand if any kind of optimization can be performed on AI, or even if inference can be influenced in any controlled and desirable way. So far, everyone is mostly just poking around, guessing, and hoping.\nSo, that said, in 2026, I believe SEOs should maintain a strong focus on retrieval systems and search overall. Make sure your SEO strategy didn’t get stuck in 2005 and that you’re considering all areas that contribute to consistency in visibility, be it content, branding, technical, etc.\nAbove all, make sure your share-of-voice strategy is omnichannel and isn’t siloed. All this while keeping your curiosity sharp and your critical thinking aimed at questioning the inconsistencies, while being cautious with a dive-head-first approach.\nWatch out for overpromising claims, outdated methodologies sitting on top of baseless assumptions, and vanity metrics.\n→ Read More: AI Overviews – How Will They Impact The Industry? We Ask Pedro Dias\nMontserrat Cano , MC. International SEO & Digital Strategy\nIn 2026, SEOs and digital marketers need to combine a deep understanding of how AI platforms work with a strong knowledge of their user base across every market.\nAs search becomes more personalized, AI-driven, and fragmented, visibility may also depend on understanding local search behaviors, expectations, cultural nuances, and how audiences interact with SERP features and LLMs along the purchase path, often in different ways.\nThe real value comes from embedding this research into ongoing internal processes such as content planning, prioritization, and testing. This ensures teams remain focused on what drives impact, e.g., the queries and content formats that matter, and the AI experiences users actually engage with.\nGrounding strategies in first-party data, current market insights, and continuous learning may protect visibility and help build sustainable growth. In 2026, this becomes a core capability for effective SEO and marketing strategy.\n→ Read More: Why The Build Process Of Custom GPTs Matters More Than The Technology Itself\nSite speed, UX, and IA are obvious and constant, but structure is something that needs to be audited and improved in the coming months, as we now need to accommodate for both agents and humans. Review how content is organized, linked, and surfaced.\nSchema is essential, where in 2026, they will be utilized more to understand entities and their relationships better, which in turn reduces possible hallucinogenic responses from agents.\nAlso concentrate on IA, query grouping, and internal linking. These strategies have existed for some time, but also need to be revisited if you haven’t done so recently.\nFor brand and offsite, shift from old-hat link acquisition and instead focus on brand sentiment through third-party perspectives, including native digital PR (unlinked brand mentions are welcome).\nFinally, take advantage of multi-modal content – invest in imagery, video, and platforms beyond traditional search to increase discoverability.\n→ Read More: The Same But Different: Evolving Your Strategy For AI-Driven Discovery\nIn 2026, SEOs should be focusing on evaluating the revenue impact of their strategies. Too often, SEOs fall into the trap of trying to optimize for traffic or following the newest advice or fancy tactic.\nIn reality, the most effective SEO strategies are those that are constantly driving towards revenue or other commercial goals. Keeping this premise front and center to your SEO strategies in 2026 will ensure you don’t get sidetracked by the latest SEO fad rather than working on a plan that drives genuine value to your business.\nThis means setting out your priorities based on their likeliness of success, and their revenue-generating potential. This simple calculation can help you to identify which projects or activities are worth focusing on in 2026. You will be able to identify if the latest “reverse-meta-optimization-deindexing” fad, or whatever it ends up being, is really worth your budget and resources to pursue.”\n→ Read More: Ask An SEO: How Can You Distinguish Yourself In This Era Of AI Search Engines?\nIn 2026, SEOs must stop optimizing solely for pages and singular phrases and start optimizing for topical understanding.\nAI-driven search systems are no longer ranking documents but evaluating entities, synthesizing answers, and choosing which brands they trust enough to cite. Visibility now depends on three things: clean, authoritative data; deep topical coverage; and systems that make your content easy to retrieve, understand, and reuse. If your site architecture, structured data, and feeds aren’t aligned to these eligibility gates, you’re invisible before the ranking discussion even begins.\nThe SEOs who will win in 2026 are the ones who treat the website like an enterprise system, not a collection of pages. That means building durable information architecture, improving data reliability, collaborating with product and engineering teams, and creating content designed for synthesis across formats – not just the blue link.\nIf you’re not strengthening your site’s underlying information integrity and cross-functional alignment, you’re not competing in the new search environment; you’re just publishing.\n→ Read More: Industry Pioneer Reveals Why SEO Isn’t Working & What To Refocus On\nIn 2026, Brand Authority takes the front seat, replacing traffic volume as the primary metric. AI platforms prioritize trusted entities, so you must prove you are one. SEOs need a dual-speed strategy: a short-term strategy that maximizes today’s Google reality, and a long-term plan for a world where traffic and attention are more fragmented.\nIn the short term, Google is still the primary traffic driver, so optimize for multi-surface and multi-modal visibility. That means targeting AI Overviews, Discover, Top Stories, video, and short-form reels, not just traditional text results.\nConvert every visitor into a direct connection through email, apps, and own communities. At the same time, double down on entity and topic authority, publish useful and unique content that is hard for AI to replicate, such as strong opinion, investigative work, and proprietary data, and strengthen technical SEO, structured data, and answer-ready formatting.\nLong-term: Prepare for a post-click reality. Develop a distributed revenue strategy driven by a creator network that monetizes attention directly on social platforms and AI interfaces, accepting that success means revenue generated off-site, not just on your domain.\n→ Read More: Google Discover, AI Mode, And What It Means For Publishers: Interview With John Shehata\nHarry Clarkson-Bennett , SEO Director, The Telegraph\nThis is very brand and customer-dependent. My best advice is to really focus on your audience. Speak to them. Understand the impact SEO should have vs the impact it currently has. There may still be easy wins on the table. Don’t neglect it.\nIf you use a last click attribution system, I suspect SEO is over-valued. Work with your analytics team to trial multi-touch attribution and try to figure out the value of each channel. Then work with your PPC, social, and newsletter teams to create a proper marketing and acquisition strategy. Build your owned channels. Improve your blended CPA and solve real business problems.\nThis is the year you manage up more effectively and stop silo-ing channels and people. Make SEO Great Again.\n→ Read More: The Impact AI Is Having On The Marketing Ecosystem\nAudit and evolve your measurement framework. Many organizations track extensive data points without translating insights into actionable optimization strategies. The key differentiation lies not in data collection, but in strategic application.\nAdapt your metrics architecture for the fragmented SERP landscape. With AI Overviews, featured snippets, and expanding SERP features fragmenting traditional organic visibility, implement granular tracking that isolates performance by SERP element. This segmentation reveals where you’re capturing attention and, more critically, where competitors are intercepting traffic before users reach your listings.\nBalance emerging channels with revenue-driving fundamentals. AI search warrants monitoring – track share of voice in AI-generated responses and assess brand mention quality. However, at current adoption rates, AI search primarily serves upper-funnel awareness objectives. Your core optimization efforts should remain anchored to proven conversion pathways: traditional organic search, site experience optimization, and technical excellence that drives qualified traffic and revenue.\nTransform metrics into strategic levers. Don’t just report CTR decline from position 3 to 5 – quantify the revenue impact, and identify the ranking factors at play. Connect performance gaps directly to business outcomes, then prioritize initiatives that close those gaps with the highest ROI potential.\n→ Read More: Effective SEO Organizational Structure For A Global Company\nDawn Anderson , International SEO Consultant, Bertey\nIn 2026, SEOs should accept that we continue to have a steeper-than-ordinary SEO learning curve ahead of us. How AI is going to fully impact our industry over time continues to be largely an educated guessing game.\nLLMs and agentic search provide a considerable opportunity, but it is important to not simply presume producing copy and paste AI LLM slop will make the cut for performative SEO in 2026, since this is a degenerative downward quality spiral. Instead, we must prioritize adding more authentic value beyond the norm, standing head and shoulders above competitors, and using AI predominantly for efficiency and ideation kick starting, along with prototype generation and concept testing.\nBuilding increasingly robust reputation and authority through quality and connections should remain firmly a key priority. Particularly as the general consensus of opinion in verticals will continue to build via accumulative LLM extractions, shaping competitive narratives.\nWe should also be aware of falsehoods, which will continue to circulate in the vacuum of genuine knowledge that these severe industry changes create.  Don’t end up going down the wrong paths which may be very difficult to return from in the short to medium term.\n→ Read More: Building Trust In The AI Era: Content Marketing Ethics And Transparency\nI believe that our key to achieving measurable results in 2026 is looking beyond the tactics and the new shiny tools: we need to get back to basics and really understand the user, their motivations, their frustrations, and mostly how they make decisions.\nWhen customers decide to engage with a brand, a product, or a service, they do so by leveraging a number of micro-decisions that have very little to do with our marketing tactics and a lot more to do with their expectations and needs, their personal experiences, and the perception they have about us. A lot of those choices are made subconsciously, before they are even aware of them – and as a result, they are not visible by looking at traditional metrics.\nSo, focus on the bigger picture by working cross-functionally to understand not only how people get to your site, but what underlying needs and expectations they have by leveraging social listening, CX logs, and on-site behavioral metrics that will inform what they need to see and engage with before they even click on your result on the SERP.\n→ Read More: The Behavioral Data You Need To Improve Your Users’ Search Journey\nLooking into 2026 and beyond, I think SEOs need to be focused heavily on digital PR efforts and getting brand mentions and links from influential sites and people. I think we’re going to hit a point where what others say about your brand is going to have more weight than what you say about your own brand.\nWe’re already starting to see that with Reddit and forums, and as LLMs gain more traction, that is only becoming a more important factor in gaining visibility.\nI’d also be focused on finding unique content angles that can’t be easily replicated by AI. Whether it’s telling customer stories or doing primary research, you’re going to need to find ways to differentiate yourself from the noise.\n→ Read More: How To Get Brand Mentions In Generative AI\nShelley Walsh , Managing Editor, Search Engine Journal & IMHO\nDuring times of significant flux, go to the fundamentals and hold on: Know where your audience is finding its trusted information and have influence in those spaces.\nIf you embrace this core maxim, it will guide you through all the changes that Google, discovery engines, LLMs, and whatever comes next can throw at you.\nHowever, don’t overlook the significant changes happening with technology that do influence the channels through which audiences can find us. Also, pay attention to how agentic SEO is developing so that you can consider now how you could apply it to your niche.\nDon’t get caught up in pointless arguments over nomenclature or caught up in hype cycles chasing distractions. Keep focusing on what a user wants and applying your brand presence and message where they can see it. Everyone is running around like the sky is falling, but it’s all just SEO.\n→ Read More: Google’s Old Search Era Is Over – Here’s What 2026 SEO Will Really Look Like\nWhat most of our experts are saying is that what is changing is not so much the how, but the where.\nSearch is happening everywhere, and you need to ensure your brand narrative is accessible and consistent across all the channels where your audience is.\nHowever, that means being mentioned in the right places, and constantly asking: “ Does this move the needle for revenue, or is it just more noise? ”\nThe future of search is being built in real time, so make sure you’re not just watching it happen, but actively shaping how your brand shows up in it."
  }
]