[
  {
    "url": "https://sproutsocial.com/insights/brands-on-substack/",
    "title": "More brands are emerging on Substack: See how Sprout is building on the platform",
    "date": "2025-11-25T14:30:14+00:00",
    "content": "When Substack launched in 2017, it was intended to be a haven for writers building an audience independently without the backing of a publisher. The platform enabled writers to send long-form newsletters directly to subscribers’ inboxes. Spurred on by the COVID pandemic and fewer traditional media opportunities, Substack amassed a large network of writers with 1 million paid subscribers in 2021. By 2025, Substack CEO Chris Best reported 5 million paid subscribers and 20 million monthly active users.\nConsumers’ appetite for niche, community-based experiences on social media is behind the steady growth. People are hungry for intentional, slower-paced feeds. Sprout’s Q2 2025 Pulse Survey found that 41% of global social users plan to spend more time on Substack. That rises to 52% for Gen Z and 53% for Millennials.\nAs Substack becomes a powerhouse platform for building hyper-engaged audiences, brands from all sectors are getting in on the action. Read on for a step-by-step guide to launching a brand Substack, with tips we learned from launching Sprout’s Substack, Social Futures .\nSubstack is a hybrid newsletter, microblog and social platform where creators (primarily writers, journalists, and—increasingly—brands) publish editorial content and directly connect with their audiences. On Substack, you have both subscribers and followers. Subscribers are people who have shared their email address and opt-ed in to receive your posts. Followers are a broader audience who have chosen to follow your profile to see your activity, like Notes, within the app.\nOn Substack, brands share exclusive content their followers won’t find on their blog or social, and that content is often long-form and personality-driven.\nSubstack has a distinct, writer-driven culture. Developing a content strategy that feels native to the platform is crucial for success. Which is why it’s important to clarify what Substack is not . For example, Substack is not a replacement for your current blog, a vehicle for campaign assets, product releases and event promotion, a competitor to your existing newsletter, or an email list builder for other channels.\nTo create a Substack content strategy, it’s important to remember that the platform revolves around posts. Posts are the foundational building blocks of the Substack ecosystem.\nTo promote their posts and presences, Substack users can tap into a variety of in-platform features, which include:\nEven as Substack’s user base continues to grow, teams and leaders are unsure if their brand has a place on the platform. It’s distinct from other social networks, and requires ample effort and resourcing. Will those investments pay off on a platform that’s still relatively uncharted territory for brands?\nWhen balancing the Substack scales, consider these benefits.\nWhen our content team pitched launching a Substack presence to our CMO, we positioned it as a salve to the sting of traditional search trends . As organic search behaviors increasingly result in zero-click outcomes,  brands need to diversify their distribution and discoverability channels to engage future customers and cement their authority. Substack offers the perfect opportunity.\nOn Substack, you can tap into a direct, owned and highly engaged audience—something that’s getting harder to find via search engines or social platforms.\nSubstack gives brands a rare opportunity to speak without the constraints of traditional social algorithms or character limits. Long-form content allows teams to adopt a more human tone, whether that’s analytical, witty, educational, editorial or deeply narrative. By publishing in a space where readers opt-in, brands can experiment with a more nuanced voice and build a distinctive personality.\nBecause Substack centers around subscription models, readers choose to be part of your brand’s world. That active choice leads to deeper engagement, stronger relationships and recurring interaction. Subscriber-only discussion threads and direct messaging features help cultivate a sense of belonging, making followers feel more like members of a community rather than passive content consumers. Over time, this dynamic builds durable loyalty and advocates who stay connected.\nSubstack shouldn’t be a 1:1 replacement for your regular newsletter. The platform serves a completely different purpose, giving brands permission to slow down and offer richer, more substantive ideas. It’s an ideal channel for sharing founder-led POVs, behind-the-scenes perspectives, original research, creative explorations or exclusive guest editorials that don’t fit neatly into other platforms. By publishing thoughtful, high quality content, brands can position themselves as category leaders while also fueling creativity within their teams. The result is a channel that strengthens reputation, expands reach and showcases the brand’s most compelling ideas.\nTo see these benefits in action, take a closer look at some notable brands already finding their home on Substack.\nHinge, the dating app designed to be deleted, hasn’t posted from their brand’s traditional network social accounts since 2020. In the five years since, they’ve instead invested in growing their creator program and experimenting on emerging platforms.\nOn their Substack, No Ordinary Love, Hinge shared five posts featuring love stories of couples who met using their app, written by real authors. The brand includes short chapters in each of their posts, comparing key milestones in a couple’s relationship to a storybook romance. The limited series also included a foreword written by Roxanne Gay.\nGiven Substack’s origins as a platform made for writers, the series felt authentic and highly intentional. The branding also made it distinct from Hinge’s typical look and feel, juxtaposing the fairytale aesthetic with relaxed photography.\nAs the Hinge team told Forbes , the entire No Ordinary Love universe was created with Gen Z as a muse: the photography style, the writers, the relatable love stories.\nRestack this strategy: Substack is a playground for creative, long-form content, and Hinge’s strategy was truly out-of-the-box. What’s equally admirable is how they built their presence with members of their target audience, making their brand more human and in sync with their user’s needs.\nBlackbird is a loyalty company that rewards people who love restaurants. On their “secret Substack,” the Supersonic, Blackbird creates a space that feels like reading the food and culture section of your favorite newspaper.\nIn their posts, they feature their favorite food takes (“ There is no such thing as a bad Caesar salad ”), and editorial interviews with legendary chefs and leaders in the food industry. They also publish personal essays where writers share their favorite childhood food memories, and a newsletter full of top-of-mind news stories readers can take to inspire small talk during meals.\nOn their Substack site, the brand organizes their content with tabs for every series.\nThe Supersonic has grown their subscriber base to 11,000 subscribers, and frequently gets comments on their posts like, “Easily my favorite read of the week.”\nRestack this strategy: For brands considering Substack, you have to be sure you have the resources to fuel consistent content production. The Supersonic is a great example of what that looks like in reality, with content published weekly (or more often). The brand has also mastered writing people-driven content (v. brand-driven), with distinct author voices and personality-driven editorials.\nLoftie is a wellness company helping people create tech-life balance through beautifully designed, deceptively simple products for the home. On their Substack, Little Book of Sleep, the brand tackles a topic everyone can relate to: getting a good night of sleep.\nTheir posts cover everything from how to create a sustainable sleep routine, to the history of mattresses and pillows, to how caffeine, naps and screentime impact our sleep habits. They also comment on emerging sleep trends—including eating kiwis before bed and the science behind the “morning shed” trend.\nRestack this strategy: Substack newsletters are organized by categories (e.g., Technology, Health & Wellness), and many top authors find their niches within them. While it can be tempting to talk about everything that matters to your audience, take a cue from Loftie and narrow your focus. It can help you emerge as an expert and stand out as the platform continues to grow.\nOur team was elated to launch our Substack, Social Futures, earlier this year (more on how we built it in the next section). We love experimenting with timely and editorial content on the platform, like which brand won the celebrity denim showdown or holiday marketing trends (and horoscopes) for social marketers .\nIn our posts, we also share our proprietary data and My Social Media Diet interviews with our favorite social media subject matter experts. We recently invited a guest author, creator Coco Mocoe, to share her perspective on the future of the creator economy.\nAfter just three months, we hit 7,300 views and an average newsletter open rate of 61%. While we still have room to grow, we’re immensely proud of how much we’ve achieved in a short time, and will continue sharing our biggest lessons with our subscribers.\nRestack this strategy: Distribution is essential to driving views and subscribers. Using our other social channels and Employee Advocacy platform helped get the word out about our presence. Partnering with creators (through interviews and guest essays), who in turn amplify links with their networks, is another reliable way to fuel growth.\nWe’ve outlined an actionable, step-by-step process brands across industries can follow to launch their own Substack, based on what we learned launching Social Futures.\nThe first step is to reflect on what you want to create and the distinct purpose it serves. Ask yourself:\nAt Sprout, we saw gaps in our current editorial content that Substack would be the ideal home for. Casual, personality-driven interviews, deep dives into our data as it relates to timely trends, quick how-tos and frameworks, and an advice column.\nAs you develop your Substack beats, you also need to build your roster of Substack writers. Will you rely on an in-house team? Or outsource to creators, like when American Eagle tapped Casey Lewis for Off the Cuff?\nFor many brands, it might make sense to take a hybrid approach. That could include working with guest authors and producing editorial interviews, which is the approach we’ve taken at Sprout. Doing so required securing budget for creator partnerships upfront, and assessing how our content team would balance writing for Substack with production for our other channels.\nYou might also ask whether you plan to publish primarily text-based content or experiment with video. If on-camera talent and video editing skills are required, that could inform how you staff your Substack.\nSubstack isn’t a traditional social channel, and you can’t use a network like Instagram or LinkedIn as a benchmark when setting Substack goals. Instead, look to other brands on the platform (preferably in your industry) to set goals for subscribers, views and open rate.\nThough you shouldn’t expect massive subscriber numbers like you might be accustomed to on other channels, you should aim for your subscribers to be highly engaged—particularly with your newsletters.\nOnce you set goals, assign the role of “Substack analyst” to a member of your team. They should run the numbers on a monthly basis to inform your content and distribution strategies.\nAs mentioned, distribution on other networks played an essential role in growing our Substack. Make a plan for sharing the news about your launch across platforms and internally. We highly recommend reaching out to your leaders, internal communications team and social team to build an all-encompassing plan.\nOur launch plan included posting on Sprout’s LinkedIn and Instagram pages, adding our Substack site link to our Employee Advocacy platform, and posting in our marketing team’s Slack channel.\nIn this planning phase, you should also take stock of all of the creative assets you’ll need for launch and ongoing distribution (think Instagram carousel templates).\nWhen setting up our Substack, we were surprised how many new creative assets were needed to build our site. Here’s a comprehensive list of everything you’ll need to have designed or written just to set up your Substack presence:\nTo help us craft a cohesive and distinct brand for Social Futures, we worked with our Brand Creative team. They created our wordmark, color palette and imagery, and set the tone for our visual identity based on direction from our creative brief.\nInstead of posting and ghosting on Substack, the platform offers brands the opportunity to engage via Subscriber chats, Notes and comment section engagement. Build out a plan for how you will weave these audience touchpoints into your workflow.\nA tip we’re experimenting with: While Substack posts should be original, you can try repurposing short-form content, including videos, images and text posts, from other networks into your Notes strategy.\nAs we’ve experienced first-hand, you don’t have to have everything figured out from the start. Remain flexible when it comes to setting a cadence, assigning content themes and even building distribution strategies. There might be images you forgot to create or copy you forgot to draft (we’re guilty of this) when you set up your site. That’s okay. What’s most important is that you show up, ready to pivot and shift as you go.\nSubstack has evolved from a writer-first platform into a destination where brands can build deeper, more intentional relationships with their audiences. Its long-form, personality-first format gives teams a rare opportunity to slow down, share meaningful ideas and cultivate an engaged, opt-in community.\nAs more brands experiment (and succeed) on the platform, Substack is proving to be a powerful channel for creative expression and owned audience growth. By approaching it with clarity, focus and a willingness to iterate, your brand can carve out its own distinctive corner of this rapidly growing ecosystem.\nFor more on everything Sprout’s content team is trying, learning and publishing on Substack, be sure to subscribe to Social Futures ."
  },
  {
    "url": "https://www.blogdigital.fr/piloter-indicateurs-lead-management-hubspot-taux-qualification-taux-conversion-delai-moyen/",
    "title": "Piloter vos indicateurs de lead management sur HubSpot : taux de qualification, taux de conversion, délai moyen",
    "date": "2025-11-25T15:02:06+00:00",
    "content": "Des indicateurs qui façonnent la performance commerciale ?\nPour de plus en plus d’entreprises, le lead management ne peut plus être laissé de côté, si bien que certaines d’entre elles ont déjà compris que cela devait reposer sur trois piliers : la qualité des prospects, leur progression dans le pipeline, et la rapidité avec laquelle ils se transforment.\nEntre le taux de qualification, le taux de conversion, ou encore le délai moyen avant la prise de rendez-vous ou la signature, les indicateurs qui racontent l’histoire concrète de vos performances commerciales et marketing ne manquent pas !\nNéanmoins, faut-il encore pouvoir les centraliser , les analyser et les activer dans un environnement vraiment commun, et c’est précisément là que les outils modernes de gestion des leads changent la donne. Parmi eux, on retrouve notamment HubSpot, qu’il est d’ailleurs possible d’utiliser en créant un compte gratuit .\nEn faisant preuve de méthode et de rigueur, il est tout à fait possible de structurer, de suivre et d’interpréter ces métriques clés, tout en accompagnant vos équipes au quotidien. En vous connectant à une base de données centralisée, en analysant les interactions des leads et en automatisant les étapes répétitives, HubSpot aide déjà de nombreuses entreprises à piloter le lead management sans friction.\nPar exemple, avec l’utilisation de HubSpot, Devoteam a affirmé enregistrer 36% de leads supplémentaires , tandis que Flinks a obtenu 40% de leads qualifiés en plus en un an , preuve qu’une approche structurée du pilotage peut transformer la performance d’une entreprise…\nDès la première utilisation d’un outil comme HubSpot, une réalité apparaît : cette solution place la donnée au centre de la stratégie .\nAujourd’hui, cette plateforme a l’avantage de pouvoir regrouper la totalité des fiches de contacts, l’ensemble des interactions des clients, et la progression de chaque prospect dans le pipeline. Selon une étude récente, 83% des clients HubSpot affirment avoir pu regrouper de façon efficace leurs données dans cet outil, ce qui facilite naturellement la lecture des indicateurs et l’identification des tendances dans leur domaine d’activité.\nEt pour piloter le taux de qualification, les utilisateurs de HubSpot peuvent se baser sur plusieurs critères, comme par exemple :\nAvec cette vision consolidée, HubSpot permet de visualiser la qualité des flux entrants, de vérifier la cohérence du travail de qualification entre équipes, mais aussi de lancer des actions automatisées pour fluidifier la progression des leads. C’est d’autant plus pertinent que 79% des clients de HubSpot ont constaté une amélioration de la qualité des leads avec cette méthode.\nDans le domaine de la vente, le taux de qualification correspond à la part de leads considérés comme pertinents pour votre entreprise. Il dépend de critères objectifs , comme le secteur, la taille, le budget, ou encore la fonction, mais aussi de critères comportementaux comme les pages vues, les ouvertures des e-mails, ou les interactions commerciales. HubSpot permet justement de structurer cette analyse grâce à plusieurs briques essentielles dans son outil.\nL’outil de lead management proposé par HubSpot, y compris dans sa version gratuite, met à disposition :\nChaque fiche de contact bénéficie d’une consolidation automatique de l’activité du lead. On peut y retrouver les pages consultées, les contenus téléchargés, les clics, les réponses aux e-mails, les interactions commerciales, et même les engagements sur les réseaux sociaux.\nToute cette profondeur d’information, accessible dans un seul et même endroit avec HubSpot, permet d’aider les équipes à déterminer si un lead montre un intérêt sérieux ou non avant d’aller plus loin.\nDans le cadre d’un lead management efficace, HubSpot propose deux approches bien distinctes :\nPour aller encore plus loin, ces modèles évaluent chaque lead selon la conformité avec le profil client idéal, l’engagement sur votre site et vos contenus, ou encore les actions commerciales passées.\nLes scores sont accessibles directement sur les fiches CRM, et les commerciaux peuvent ainsi prioriser immédiatement les prospects les plus avancés et éviter de perdre du temps sur les leads moins prometteurs.\nAu total, 87% des utilisateurs de Sales Hub estiment que l’outil améliore la qualité des leads, ce qui illustre l’impact de ce pilotage structuré.\nEnfin, avec HubSpot, vous pouvez aussi configurer vos propres statuts , en plus des statuts traditionnels pour les nouveaux leads, les contacts à traiter, en qualification, qualifiés, ou disqualifiés.\nChaque statut peut déclencher des actions automatiques, qu’il s’agisse de notifications, de tâches, de messages ciblés, d’un changement de propriétaire, d’une intégration dans un workflow de nurturing, et bien d’autres. Cette standardisation vise à fluidifier le travail quotidien et éviter les interprétations personnelles sur l’avancement des leads.\nDans HubSpot, le taux de conversion indique la capacité de vos équipes à transformer un lead en opportunité commerciale , puis en client. Pour cela, HubSpot propose un environnement complet pour visualiser et faire progresser chaque prospect dans le pipeline.\nLes étapes du pipeline de HubSpot peuvent être définies selon votre modèle de vente . Vous pouvez identifier un lead à contacter, un premier échange avec celui-ci, un appel de découverte, une proposition, un échange pour une négociation, jusqu’à la signature.\nChaque mouvement dans le pipeline génère des données utiles pour le calcul du taux de conversion. HubSpot se charge ensuite de centraliser :\nPar ailleurs, cette vision de bout en bout est renforcée par les capacités d’automatisation, si bien que 82% des utilisateurs du Sales Hub affirment que la solution a grandement amélioré leur pipeline et leurs reportings.\nL’outil de marketing automation de HubSpot ajoute une dimension stratégique déterminante pour le lead management :\nEn procédant de la sorte, l’objectif est de maintenir l’intérêt du prospect à chaque étape et de réduire les frictions entre marketing et commerce. Cette cohérence explique d’ailleurs pourquoi Flinks a observé 40% de leads qualifiés supplémentaires en un an après avoir structuré son nurturing dans HubSpot.\nSi vous vous tournez vers HubSpot, vous verrez que tous les indicateurs comme les scores, les interactions, et les étapes du pipeline sont visibles à la fois par les commerciaux, les marketeurs et les responsables opérationnels.\nSi cela peut paraître anodin, c’est notamment ce qui permet de faciliter l’alignement des campagnes entre les équipes si vous distribuez plusieurs produits, l’ajustement des critères de qualification pour les leads, la priorisation des actions à réaliser, et le partage des informations entre les équipes.\nTout cela contribue à faciliter le pilotage du taux de conversion, celui-ci reposant sur une vision partagée et une coordination fluide entre les équipes.\nEn analysant finement son mode de fonctionnement, on constate rapidement que la puissance de HubSpot réside dans la combinaison de ses différents modules , où plutôt de « hubs » selon la plateforme. Entre le CRM, le Sales Hub, le Marketing Hub , ou encore l’outil de lead scoring et la solution marketing automation, les options ne manquent pas.\nQuand elle est bien maîtrisée dans le cadre d’une stratégie de lead management, cette utilisation apporte une segmentation plus fine de vos leads, une vision unique du parcours de vos clients, et un suivi détaillé pour piloter en temps réel les indicateurs clés.\nSelon HubSpot, les entreprises utilisant plusieurs « hubs » observent au passage un taux de clôture d’affaires 5 fois supérieur . Et plus globalement, 95% des clients HubSpot déclarent obtenir un retour sur investissement positif, dont 76% en moins de quatre semaines .\nPour calculer le taux de qualification, HubSpot s’appuie sur les propriétés des leads (profil, historique d’interaction, score…) et sur les statuts définis dans votre pipeline de qualification.\nOui, vous pouvez créer vos propres critères, utiliser des scores négatifs et activer le scoring prédictif pour affiner la priorité des leads.\nLe suivi du taux de conversion s’effectue directement via le pipeline commercial et les tableaux de bord personnalisés."
  }
]