[
  {
    "url": "https://martech.org/measuring-account-progression-makes-the-attribution-conversation-obsolete/",
    "title": "Measuring account progression makes the attribution conversation obsolete",
    "date": "2026-01-19T13:58:00+00:00",
    "content": "Measuring your marketing and sales success by defining, measuring and optimizing the stages an account progresses through will make the attribution conversation obsolete.\nTeams obsessively track impressions, clicks, website visits, form fills, event registrations, content downloads and MQLs to try and scientifically associate that behavior with what prompted a customer to become a customer.\nThis is ridiculous. We’re selling six-figure software. Your ad, email, event, or phone call did not, by itself, get that company to become a customer.\nWe do this because we want to connect it to revenue, show our value and prove our worth.\nI’ve been guilty of this. Early in my career, I fought hard to convince leadership that my MQLs were perfect and it was only a matter of time before they converted. I was wrong. The reality is that these activity metrics (alone) didn’t predict revenue.\nDig deeper: How to use CTV to strengthen your ABM strategy\nBefore any sales activity (meetings, demos, proposals, bookings) occurs, something else must happen first. And before that, something else has to happen.\nThis sounds obvious when you say it out loud. But most GTM teams don’t actually measure it — let alone understand it.\nAccount progression means defining stages that represent where an account is in its buying journey, and tracking how accounts move between those stages over time. The stages I typically use are: unaware, aware, engaged, qualified, sales-ready and customer.\nEach stage has clear criteria. An account moves from unaware to aware when multiple contacts from that account have been exposed to your brand (i.e., start showing saturation of impressions). They move from aware to engaged when those contacts start interacting with your content or campaigns (i.e., traffic, content consumption). They become qualified when they match your ICP criteria and show buying signals from multiple contacts in the account. They become sales-ready when they demonstrate purchase intent.\nThe beauty (and simplicity) of this model is that it creates a shared language between marketing and sales. Everyone knows where an account is and what needs to happen to move it forward.\nTraditional contact-based demand-gen metrics were designed under the assumption that individuals purchase in a linear funnel, where leads flow from marketing to sales in a predictable sequence.\nDig deeper: How small companies can win with account-based marketing\nResearch from Gartner shows that buyers complete more than half of their purchase process before ever talking to sales. Buying committees can include eight to ten stakeholders, sometimes more. The journey isn’t linear. It’s messy, multi-threaded and spans months.\nWhen you measure individual lead activity in this environment, you miss the forest for the trees. You might see that Jane from Acme Corp downloaded a whitepaper, but you have no idea whether Acme Corp as an account is actually getting closer to buying.\nWorse, lead-based metrics create perverse incentives. Marketing teams optimize for lead volume because that’s how they’re measured. They stuff the top of the funnel with cheap leads that will never convert. Sales gets frustrated because MQL quality is garbage. The relationship between marketing and sales breaks down.\nThis ends the same way every time. A marketing team proudly reports they generated 500 MQLs last quarter. Sales responds that 400 of them were rejected. Marketing blames sales for not properly working the leads. Sales blames marketing for not understanding what a qualified opportunity looks like.\nMost GTM teams complain constantly about attribution. They can’t figure out which channels are working. They can’t connect campaigns to revenue. They argue over first-touch, multi-touch and last-touch models.\nDig deeper: Account-based GTM pods that turn strategy into pipeline\nAttribution doesn’t matter when you measure account progression.\nThink about it this way: when you can see campaign, channel and tactic-level data for each account at each stage, you don’t need to argue about which touchpoint gets credit for a conversion. You can see the group of activities that contributed to an account moving from one stage to another.\nYou can measure that accounts in your target list who were exposed to your LinkedIn campaign progressed from aware to engaged at twice the rate of accounts who weren’t. You can see that accounts who attended your webinar moved from engaged to qualified 40% faster than average. You can identify that direct mail is most effective at moving accounts from qualified to sales-ready.\nWhen you track account progression, you create a baseline for what it typically takes to move an account from early stage to later stage. How many touches? Which channels? What sequence? Then you measure every campaign against that baseline.\nInstead of arguing about whether the whitepaper or the demo request should get credit for the closed deal, you’re asking a much more useful question: Did this campaign accelerate account progression?\nThat doesn’t mean you should throw out your lead-level tracking entirely. You still need to measure individual contact engagement. But you need to think about it as two funnels running in parallel.\nThe first funnel is your contact or lead funnel. This tracks the traditional flow: inquiry to lead to MQL to SQL to opportunity to closed-won. You need this to understand individual engagement and to route leads appropriately.\nThe second funnel is your account funnel. This tracks account progression: unaware to aware to engaged to qualified to sales ready to customer. This is your north star for understanding whether your marketing is actually advancing buying decisions.\nThe magic happens when you connect these two funnels. You can see which accounts have multiple engaged contacts. You can identify when an account has reached a qualification threshold by checking buying group coverage. You can trigger sales outreach when enough contacts from a target account show intent signals.\nMost importantly, you can measure marketing effectiveness at the account level and use that data to eventually predict revenue.\nGetting this right requires investment in your data infrastructure. You need to be able to associate contact-level activity with account-level records. You need clear definitions for each stage. And you need a way to calculate when an account has met the criteria to progress.\nDig deeper: A strategic framework for turning small-scale events into ABM wins\nDefine your stages clearly. What does it mean for an account to be aware, engaged or qualified? Write this down. Make it measurable. Get marketing, sales and ops aligned on the definitions.\nBuild your account scoring model. Determine which signals indicate progression. This might include: number of contacts engaged, types of content consumed, intent signals from third-party data, website behavior, event attendance and sales activity.\nSet thresholds for progression. An account might progress from aware to engaged when three or more contacts have engaged with marketing content in the last 90 days. An account might become qualified when it matches ICP criteria and shows active buying signals. Document these thresholds.\nTrack progression over time. This is where most teams fall short. You need to capture not just what stage an account is in today, but when it entered that stage and how long it took to progress from the previous stage. This gives you velocity metrics.\nMeasure campaigns against progression. Instead of asking how many leads a campaign generated, ask how many accounts progressed as a result of the campaign. Which accounts moved from aware to engaged? Which moved from engaged to qualified?\nThe attribution debate is really a symptom of a deeper problem: marketing and sales aren’t aligned on what success looks like.\nWhen marketing is measured by leads and sales by revenue, conflict is inevitable. Marketing optimizes for volume. Sales wants quality. Neither side can prove its position because they’re looking at different data.\nAccount progression gives both teams a shared metric to rally around. Everyone can see the account funnel. Everyone understands what needs to happen for accounts to progress. Marketing focuses on moving accounts forward. Sales engages when accounts are ready.\nI’ve watched teams transform their go-to-market effectiveness simply by adopting this shared view. The finger-pointing stops. The debates about lead quality disappear. Instead, you get productive conversations about how to accelerate account progression.\nOnce you have account progression tracking in place, here are the metrics that actually matter:\nThese metrics give you actionable insight into whether your GTM motion is actually working. They predict revenue in a way that lead counts never will.\nAccount progression is the north star metric for GTM teams because it captures what actually matters: whether target accounts are moving closer to becoming customers. It eliminates attribution debates by providing a holistic view of account engagement. It aligns marketing and sales around a shared goal.\nYes, implementing account progression tracking requires investment in your data infrastructure. Yes, it requires getting marketing, sales and ops aligned on definitions and thresholds. Yes, it’s more complicated than counting MQLs. But if you want your GTM function to actually predict and drive revenue, this is the path forward."
  }
]