[
  {
    "url": "https://www.searchenginejournal.com/google-releases-december-2025-core-update/563134/",
    "title": "Google Releases December 2025 Core Update via @sejournal, @MattGSouthern",
    "date": "2025-12-11T17:46:26+00:00",
    "content": "Google has released the December 2025 core update, the company confirmed through its Search Status Dashboard .\nThe rollout began at 9:25 a.m. Pacific Time on December 11, 2025.\nThis marks Google’s third core update of 2025, following the March and June core updates earlier this year.\nGoogle lists the update as an “incident affecting ranking” on its status dashboard.\nThe company states the rollout “may take up to three weeks to complete.”\nCore updates are broad changes to Google’s ranking systems designed to improve search results overall. Unlike specific updates targeting spam or particular ranking factors, core updates affect how Google’s systems assess content across the web.\nThe December update follows two previous core updates this year.\nThe March 2025 core update rolled out from March 13-27, taking 14 days to complete. Data from SEO tracking providers suggested volatility similar to the December 2024 core update.\nThe June 2025 core update ran from June 30 to July 17, lasting about 16 days. SEO data providers indicated it was one of the larger core updates in recent memory. Some sites previously hit by the September 2023 Helpful Content Update saw partial recoveries during this rollout.\nTwo days before this core update, Google updated its core updates documentation with new language about ongoing algorithm changes.\n“However, you don’t necessarily have to wait for a major core update to see the effect of your improvements. We’re continually making updates to our search algorithms, including smaller core updates. These updates are not announced because they aren’t widely noticeable, but they are another way that your content can see a rise in position (if you’ve made improvements).”\nGoogle explained that the addition was meant to clarify that content improvements can lead to ranking changes without waiting for the next announced update.\nIf you notice ranking fluctuations over the coming weeks, this update is likely a major factor.\nCore updates can shift rankings for pages that weren’t doing anything wrong. Google has consistently stated that pages losing visibility after a core update don’t necessarily have problems to fix. The systems are reassessing content relative to what else is available.\nThe documentation update is a reminder that rankings can change between major updates as Google rolls out smaller core changes behind the scenes.\nGoogle will update the Search Status Dashboard when the rollout is complete.\nMonitor your rankings and traffic over the next three weeks. If you see changes, document when they occurred relative to the rollout timeline.\nBased on 2025’s previous updates, completion typically takes two to three weeks. Google will confirm completion through the dashboard and its Search Central social accounts."
  }
]