[
  {
    "url": "https://sproutsocial.com/insights/internet-slang/",
    "title": "Social media slang isn’t for every brand",
    "date": "2026-01-08T15:43:47+00:00",
    "content": "The internet—and social media in particular—has a profound impact on our language, shaping so much of how we speak in the real world. But when it comes to brands using online slang, marketers need to tread carefully. Although an expertly-timed slang drop can boost your reach and endear you to specific communities, it’s equally likely to backfire. In plenty of cases, it’s probably best to avoid using certain terms at all.\nWe’re back with the latest edition of our series, @Me Next Time, where we invite Team Sprout and some of our favorite social experts to share how they really feel about the latest trends and industry discourse.\nThis time, we sat down with Paul Quigley—General Manager of Listening at Sprout Social and part of the team behind our 2025 Social Media Dictionary —to learn more about social’s influence on language and what that means for marketers.\n“Massive movements in culture often start from niche online communities. Tracking these emerging conversations is invaluable for predicting where social is headed and how we can best engage with audiences and create relevant, meaningful content. But just because you see a spike, doesn’t mean your brand should immediately start using a slang word,” said Quigley.\nRead on for more guidance about when to use (and not to use) social media slang, and examples of marketers thoughtfully embedding their brands into online culture .\nSocial media speeds up the rate of language evolution, changing the meaning of words and introducing new vocabulary overnight. The top words from the past few years all have roots on social.  “Rizz” was deemed the 2023 Word of the Year by Oxford . This year, Dictionary.com gave that distinction to “6-7”. It used to take decades for new words to emerge. Now, our vernacular changes as quickly as the algorithms.\n“The speed of language moves faster than it ever has before. If you think about it, we still use words from the age of exploration (i.e., ‘sailing too close to the wind’). But those phrases took a long time to become commonplace. Then there are words like ‘hacking.’ Everyone talks about hacking now—biohacking, lifehacking, sleep hacking. That all started with computer hacking in the 1960s. Modern internet slang moves even faster. Aura in its current meaning was first used by sports fans and fashion enthusiasts in the early 2020s. Now it’s Sprout’s Word of the Year,” adds Quigley.\nAura generated 31.9 billion impressions across major social networks in 2025. From “aura-farming” to “aura-maxxing,” the term’s explosive rise exemplifies how viral micro-moments can rapidly transform into global cultural phenomena.\nOther top words from our dictionary include pookie, skibidi, Labubu and the aforementioned 6-7, all generating billions of potential impressions.\nWith so much cultural cache, internet slang entices social marketers. Quigley explains this is only natural, and likens it to our collective fear of missing out.\n“We have all experienced that embarrassing moment when we have no idea what other people are talking about when new slang emerges. I remember when people first started saying COYBIG or COYGIG on Irish Twitter. It means ‘Come on, you boys in green’ or ‘girls in green.’ I had no idea what everyone was going on about. That sense of social panic is what so many marketers feel when they see a word like ‘aura.’  While it’s important to figure out what people are talking about (and why), it doesn’t mean your brand needs to start saying it, too. In fact, in most cases, you shouldn’t.”\nHere are some of the risks involved when using online slang.\nSo you see a new slang word start trending and pepper it into your next post caption. What’s the worst that could happen?\n“Before deciding to use a slang word, marketers need to understand their brand and audience really well. We all know brands like Duolingo or Brita that are able to lean into chaos culture and go viral. Even some B2B brands publish irreverent memes. But if your brand doesn’t have that established identity and it doesn’t make sense for your industry, you risk alienating your audience or receiving backlash,” Quigley warned.\nEven if the reception is positive on a single post, using internet slang is low on consumers’ priority list when it comes to what they actually want from brands long-term. Though 93% agree it’s important for brands to keep up with online culture, most say jumping on trends or using every word of the moment isn’t the way to stand out, per The 2025 Sprout Social Index™ .\nRather than being viral or trendy, audiences say the most memorable brands are honest and inspirational, according to the Q2 2025 Sprout Pulse Survey . And their favorite brand posts are distinct. Almost 60% of consumers say they want brands to prioritize crafting original content. Which makes sense given the growing rate of social media fatigue and apathy.\nPlus, many consumers consider mainstream adoption the death of a slang word’s cool factor. “Internet subgroups like having obscure language that only the in-crowd knows. Once brands start using it and it goes mainstream, it’s over,” lamented Quigley. Nothing reeks of trying too hard like posting a slang word past its expiration date.\nOn a deeper level, brands using internet slang without discernment can be harmful to the communities who create these terms.\n“Marketers need to understand how trends are culturally stapled. We, as social teams, need to recognize the nuance and know when trends aren’t right for our brand,” said Tameka Bazile, creator, Associate Director of B2B Social & Content Marketing at Business Insider, and member of our 2025 Sprout Social Index Council.\nWhen brands don’t understand the full meaning or origins of a slang word, they can inadvertently say offensive things or play into limiting stereotypes. Even if the use of a slang term is above board, brands can still cause harm by failing to give proper credit. Consider how Jools Lebron, the creator behind the “demure” trend, nearly had her own intellectual property trademarked by someone else after it was co-opted by thousands of brands and creators.\nWhen deciding whether or not to use social media slang, marketers must conduct comprehensive research. Quigley observed how this looks today compared to a decade ago: “Marketers I talk to are becoming obsessed with tracking the acceleration of slang words. The rate we’re evolving is uncomfortable for brands. In the past, you could rely on consumer surveys and traditional audience research. Now, you need real-time data to stay relevant.”\nHere are research considerations you can use to get started.\nAs already mentioned, knowing your target audience is an important first step when honing your brand voice and deciding whether or not to incorporate slang. Look at how your community communicates, and what makes up their daily lexicon. This is where social intelligence comes in.\nAs Quigley put it, “You used to be able to tell the world what to think about you through buying ads. Now the world tells you how to think about you.”\nBy conducting social intelligence analysis, you can learn which conversations are trending among your audience, and which specific words and phrases are emerging. From there, figure out how your brand adds something new to the conversation (if you aren’t yet part of it), and which terms allow you to create a cultural moment. Take Ryanair, for example.\n“Ryanair uses internet slang to riff on their own terrible reputation. Their posts whisper, ‘What do you expect for a cheap flight?’ They don’t take themselves too seriously, which lends itself to the cynicism Gen Z in particular is known for. They know their audience and their sense of humor, and are comfortable speaking their language.”\nYou must do more than surface-level research to understand the origins of internet slang. That includes digging into the communities it’s attributed to and/or the creators responsible for coining it.\nFrom there, develop your brand’s criteria for when it makes sense to use certain terms, and which formats you’ll lean into. Avoid copying content from creators and other brands one-for-one, and always give credit where it’s due. Consider how you can reference the slang, while making it your own and relevant to your audience. Ask: How can we make our followers feel seen?\nReferences to slang or a new trend might be best achieved via creator partnerships than on the brand account, according to Quigley. “There are ways to use internet slang in your brand’s ecosystem, without posting about it directly. Take OpenTable. They’re a large and respected brand in the food and dining sector. Even though the industry they’re part of does use slang, OpenTable ardently sticks to their brand voice. It makes sense. Their platform is for scheduling reservations, a service consumers count on to be stable and reliable, not trendy. Instead they allow the influencers and creators they partner with to use slang that feels natural to them and their audiences, which keeps the brand culturally relevant.”\nIt’s crucial to understand that some words have a short shelf-life. Research whether or not a word or phase is part of daily lexicon, or if it’s already fading into obsolescence before you use it.\nJust because a word represents a moment in time doesn’t mean it’s off-limits. But it does mean you have to act fast, and find a way to tie it to your brand. For example, 69% of all social users think brands should have posted about the release of Taylor Swift’s latest album, “The Life of a Showgirl,” per the Q4 2025 Sprout Pulse Survey. But 44% think the post needed to be relevant to a company’s product or service.\nLike when HubSpot posted about the TS12 album. Quigley observed, “HubSpot can get away with posting memes and referencing slang used by the chronically online because they always stay true to their brand’s purpose and ethos.”\nUsing social media slang only works when it genuinely aligns with your brand’s voice, values and community. As language evolves faster than ever, marketers need to prioritize understanding cultural context and audience expectations over chasing fleeting trends.\nThoughtful research and real-time social intelligence help ensure you’re contributing to conversations in a way that feels respectful and distinct. Ultimately, the most memorable brands aren’t the ones using every new slang term. They’re the ones communicating with clarity and purpose.\nCheck out Sprout Social’s entire 2025 Social Media Dictionary for a look ahead at what words will define digital conversation next year."
  },
  {
    "url": "https://sproutsocial.com/insights/automotive-social-media-marketing/",
    "title": "Automotive social media marketing: How brands like Honda drive success",
    "date": "2026-01-08T15:00:15+00:00",
    "content": "The automotive industry has always been highly competitive; a new car is a significant investment for individuals and businesses, and there’s often a lengthy consideration stage before a purchase is made. It’s also a crowded market, with multiple global brands competing for attention through distinct offerings and brand appeal.\nMarketing and sales for vehicles and parts used to be handled almost entirely offline, but times have changed. As buyers continue to turn to online channels when considering their options, a strong social media presence is more important than ever. By aligning social goals with companywide brand and sales targets, automotive companies can set themselves apart and build a more significant presence in the wider market.\nIn this article, we’ll explain which strategies automotive companies should be investing in, based on active trends. We’ll also share real-world examples of successful social media marketing for automotive, including from one of the world’s biggest automotive brands, Honda.\nAutomotive social media marketing is any tactics and strategies used by car or vehicle parts brands on social networks.\nThis might include the types of content automotive companies are creating, the channels they prioritize and the processes they follow to increase their reach. Typically, this form of marketing is used to drive sales, further a brand’s identity and build loyalty.\nGone are the days when people would simply walk into a dealership and buy based on sight and sales pitches. The rise of online shopping has completely changed the way people research and buy cars, and the parts they need for them.\nSocial media is at the forefront of that change. In the US, 44% of people believe that social media is the most influential form of media when it comes to marketing new vehicles. Similarly in the UK, 40% of people say that social media adverts would influence their decision of whether or not to buy a new car. Meanwhile, 46% of Chinese buyers rely on a car’s social media reviews before they make a purchase.\nThis is consistent with larger trends in social media. According to The State of Social Media in 2025 , 41% of Gen Z turn to social media first when searching for new information, and 76% of people overall said they’ve been influenced by social media when purchasing in the last six months.\nSocial has a vital role to play in wider automotive marketing strategies. Used effectively, social campaigns can help reduce overall marketing costs and increase a brand’s reach. It’s also an essential channel for direct communication with customers, particularly during a crisis .\nBy using advanced tools like Sprout Social Listening, an automotive social account can also be used to better understand customers’ feelings and intentions, which can then help with refining marketing approaches over time.\nAll of these factors point to social being the central point for consumers to discover and love brands, which is why automotive brands should be investing in their social media presence.\nWe’ve identified several current trends that automotive brands are using to set themselves apart on social media. While not all of them are unique to the industry, the way you approach these trends can help set you up for success when plotting your automotive social media marketing strategy.\nThe power of social media isn’t just because of the reach it can offer; it also offers brands opportunities to directly engage with their audience. Through replying to comments, managing DMs and social inboxes and leveraging user-generated content (UGC) , social media allows automotive companies to communicate with and encourage interactions from their fans.\nHonda is one such global automotive brand that’s benefiting from direct follower engagement. One of the company’s social media marketing goals is to use social as the primary engine for a two-way dialog between the brand and its customers. To achieve this, they’ve been using Sprout Social’s social media management tools.\nSince shifting to Sprout, in their first year, Honda achieved a 251% increase in community engagement. In year two, they focused on refining the quality of these conversations through automation and a smart use of filtering tools.\nThis focus on high-quality engagements meant Honda could reduce queue times by 40%, freeing up approximately 40 hours a month. Giving them more time to refine their content strategies and conduct proactive data analysis. It also enabled them to achieve a 91% high-quality engagement rate as a brand, far higher than the automotive industry standard of 75%.\nLearn more from Honda’s social team about the success and value they found with direct social media engagement while using Sprout.\nThe Q2 2025 Sprout Social Pulse Survey found that 64% of all social users say when a brand partners with an influencer they like, they’re willing to buy more from that brand.  Purchases can be significantly impacted by strategic influencer and creator collaborations , but success is dependent on careful research and audience alignment.\nIt’s important that you spend time finding the right influencer or collaborator for your particular brand. This same rule applies if you’re hoping to create collaborative content with traditional celebrities, like actors or athletes. The more an influencer’s content and audience aligns with your automotive brand, the more likely the content you create together will resonate.\nFor Honda, that meant partnering with content creators like @mobile_mama_reviews . Her understanding of the industry, and partner-focused content, align well with a specific market Honda is targeting: drivers wanting family-friendly cars.\nA proven way to stand out in the market is to lean into your niche audience, appealing to specific segments of the market that your brand can uniquely support.\nFor example, some brands focus primarily on segments within the luxury market, like premium sports vehicles or accoutrements, while others market themselves as affordable family cars. But in vehicle marketing, it’s possible to drill down into those segments even further to achieve a stronger connection with consumers.\nOne example of niche interest targeting in social automotive marketing is Subaru. A Japanese company that used to be associated with sports and motorbikes, Subaru uses its online and social strategies to market its vehicles to dog owners. They launched the BBC Countryfile Dog of the Year competition in 2025, and recently posted this social campaign in partnership with the ASPCA.\nThese campaigns put Subaru front-of-mind for people who value durable, adventure vehicles, but who also use them to transport their dogs. By targeting this niche, they’ve been able to speak directly to what a segment of their audience is passionate about. This helps their brand resonate more strongly with those within this niche of pet lovers.\nSince buying a car is such a personal experience (and investment), many buyers want to see a car in person and drive it themselves before they commit. Car dealerships still serve this important function, but new technologies can support virtual experiences that lead buyers to the dealership. Crucially, they’re also a great way to stand out from your competition, enticing new and loyal fans to test drive the latest model.\nAR/VR experiences can showcase new vehicle models, offering users an opportunity to inspect a car from several angles. You can also create short-form videos for feature showcases or long-form activations that link up with campaigns. By getting creative with these immersive experiences, you can offer customers a more unique buying journey. This can also help your brand feel more innovative and tech-focused, which can be an important affiliation to have in today’s market.\nIn Honda’s “Wall of Dreams” AR/VR campaign, they set up AR murals in LA, supported by sky segmentation technology, meaning their art could merge with the sky. They used this interactive experience to promote Honda’s mission for carbon neutrality with their suite of EV vehicles.\nNow that you’re aware of some of the leading trends in automotive social media marketing today, let’s dive into proven strategies you can use to boost performance. We’ll also share insights from Honda’s social media team on how some of these strategies guide their approach.\nEvery piece of content you post across social should fit somewhere along your customer journey. Content like a brand showcase Reel can build awareness, while a new model reveal could capture viewers at the consideration or decision stages.\nRegardless of stage, aim to embed a story within your content. Look at how you can build a narrative around your brand and its products, and weave this into everything you create. Here’s a recent example from Discount Tire’s Instagram , where they’ve combined storytelling with interaction, encouraging their followers to engage through emoji comments around a common problem their brand can solve.\nSocial media marketing tools can also help you connect social posts with your buyer’s journey through CRM integrations, like Sprout’s Salesforce integration . Integrations like this connect your content with data collected from your sales team so you have a more holistic view of your sales and marketing efforts.\nAn effective social strategy means putting your content in front of the right people, and choosing your channels is the first (and arguably most important) step. In the automotive industry, networks like Facebook, Instagram and YouTube are all vital for growing your brand’s reach.\nOther networks like TikTok and LinkedIn might also be useful for your brand, depending on the age of your target audience and if you’re trying to attract B2B customers. Once you select the right social channels for your brand, make sure you dedicate enough time to creating content for each account.\nAs an example, Honda has built a significant following of 5.6 million people on Facebook, and has started expanding onto TikTok, where they’ve achieved almost 500,000 followers. As you grow your following across networks, think about what content you can repost or repurpose, like using Instagram content for TikTok (shown below), or Facebook posts across LinkedIn. Honda often repurposes its Instagram Reels content for TikTok, so it can build a presence on both networks efficiently.\nAccording to Allie Coulter, Honda’s Social Media Director, “Social is so much beyond content…This isn’t just videos and photos anymore. It’s the community management piece that’s truly the dialog.”\nYour community is just as vital as the content you’re publishing. Alongside content, you need to manage the social inboxes of your accounts regularly so that you’re providing the right level of customer care. As Honda’s Senior Social Media Strategist, Heather Epstein, shares, it’s about “Working with our customers 1-to-1, making sure that we’re answering all of our customer’s’ questions, and also making sure that our customers know about everything that we’re doing.”\nIf your social or care teams are spread too thin, consider implementing a chatbot that can filter conversations before you get to them. Tools like Sprout offer a Bot Builder that enables you to easily build and automate unique chatbots for Instagram, WhatsApp, Facebook and X (formerly Twitter). By setting auto-responses, you can react quickly to common questions or issues, and save your team’s time for addressing complex customer requests.\nAs well as fielding messages, think about how you can build an active community through your social content. Create interactive posts like polls, contests or UGC campaigns that encourage followers to engage directly. Alongside boosting engagement, this type of content also gives you insight into customer opinions and behaviors, which can be used to refine your sales approach. Replying to comments can also surprise and delight your customers and show you’re listening to them.\nPaid social campaigns offer greater reach and can boost the successful content you’ve already created. They can be particularly beneficial when paired with an influencer, creator or celebrity campaign, as you’ll multiply the benefits of your campaign by getting it in front of more people.\nPaid social strategies can also be used to support omnichannel activations. As one example, BMW promoted its BMW Intelligence film series across YouTube and other video-based social networks, with each video linked to a feature of its cars.\nListening to customers is another core part of Honda’s social media success. As Coulter says, it “…goes back to that two way dialog that we really wanted to create, to make sure that we are the company that listens and that we are incorporating what our customers wants and needs are into our content.”\nEpstein says social listening is a particularly useful technique for content planning and understanding Honda’s audience: “When it comes to producing a lot of our content, we look to social listening to see what types of features people are talking about, like what features really make the difference between buying or not buying a certain vehicle. And we make sure to emphasize those features when it comes to producing that content.”\nAdvanced social listening and media monitoring tools offer you more detailed insights into current trends, audience behaviors and automotive news. By leveraging these tools, you can gain more value from your social networks by turning them into actionable data generators as well as reach growers.\nNewsWhip by Sprout Social enables automotive companies to access predictive media intelligence so you can react to trends before they hit the mainstream. By coupling this monitoring with Social Listening , you can gain full visibility into what your customers are saying right now and what they expect from you and your competition over the longer term.\nVehicle brands don’t perform in a vacuum; their success is dependent on a web of dealerships, franchises, suppliers and other partnerships. By enabling your partners on social, you’ll have the dual benefit of strengthening your connection with them while also creating engaging content.\nCoulter refers to this approach as a way of building a center of excellence: “There’s so many factions of our business. Which we know makes it complicated but awesome. And that’s where we know that…those brands need their own ability to communicate what they need. But the brand also needs that consistency as well. So that’s why we’re building that center of excellence.”\nHonda understands that each section of their brand and business needs its own communication method, but that they all need to be aligned to a core identity. A recent example of this is Honda’s collaboration post about their F1 vehicle, the Williams FW11. Honda collaborated on this post with five different Instagram accounts, including their main brand, their sub-brands like Honda Racing and the personal account of their racecar driver, Takuma Sato.\nCampaigns like this one further the reach of you and your partners, and show your customers how diverse your brand is.\nThe only way to effectively improve your social efforts is by gathering data, analyzing it and using it to refine future strategies.\nInvest in analytics tools that can offer greater visibility into your social strategy performance. Use this data to identify which campaigns are resonating the most with your audience, and where further refinement is needed. Then, use these insights to guide your upcoming content campaigns.\nBy tracking campaign performance, social data can also help you improve other areas of your organization. Embed the insights you’ve gained from these strategies into your quarterly reviews, and combine the data to uncover market changes and demands, and the actions your brand should be taking next.\nSocial media is already a key channel for consumers to discover brands, so it’ll continue to be an important and growing channel for automotive brands. By using these social strategies and injecting social data into your broader strategies, you’ll refine your approach to automotive social media marketing while staying deeply connected to your audience across touchpoints.\nLearn how you can position your social media strategy to impact the bottom line of your automotive business with The 2025 Impact of Social Media Marketing report."
  }
]